<abi-corpus version='2.1' architecture='elf-amd-x86_64' soname='libGLU.so.1'>
  <elf-needed>
    <dependency name='libGL.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- gluBeginCurve -->
    <elf-symbol name='gluBeginCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBeginPolygon -->
    <elf-symbol name='gluBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBeginSurface -->
    <elf-symbol name='gluBeginSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBeginTrim -->
    <elf-symbol name='gluBeginTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild1DMipmapLevels -->
    <elf-symbol name='gluBuild1DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild1DMipmaps -->
    <elf-symbol name='gluBuild1DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild2DMipmapLevels -->
    <elf-symbol name='gluBuild2DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild2DMipmaps -->

    <elf-symbol name='gluNewQuadric' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNewTess -->
    <elf-symbol name='gluNewTess' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNextContour -->
    <elf-symbol name='gluNextContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsCallback -->
    <elf-symbol name='gluNurbsCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsCallbackData -->
    <elf-symbol name='gluNurbsCallbackData' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsCallbackDataEXT -->
    <elf-symbol name='gluNurbsCallbackDataEXT' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsCurve -->
    <elf-symbol name='gluNurbsCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsProperty -->
    <elf-symbol name='gluNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsSurface -->
    <elf-symbol name='gluNurbsSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluOrtho2D -->
    <elf-symbol name='gluOrtho2D' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPartialDisk -->
    <elf-symbol name='gluPartialDisk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPerspective -->
    <elf-symbol name='gluPerspective' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPickMatrix -->
    <elf-symbol name='gluPickMatrix' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluProject -->
    <elf-symbol name='gluProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPwlCurve -->
    <elf-symbol name='gluPwlCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricCallback -->
    <elf-symbol name='gluQuadricCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricDrawStyle -->
    <elf-symbol name='gluQuadricDrawStyle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricNormals -->
    <elf-symbol name='gluQuadricNormals' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricOrientation -->
    <elf-symbol name='gluQuadricOrientation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricTexture -->
    <elf-symbol name='gluQuadricTexture' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluScaleImage -->
    <elf-symbol name='gluScaleImage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluSphere -->
    <elf-symbol name='gluSphere' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessBeginContour -->
    <elf-symbol name='gluTessBeginContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessBeginPolygon -->
    <elf-symbol name='gluTessBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessCallback -->
    <elf-symbol name='gluTessCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessEndContour -->
    <elf-symbol name='gluTessEndContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessEndPolygon -->
    <elf-symbol name='gluTessEndPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessNormal -->
    <elf-symbol name='gluTessNormal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessProperty -->
    <elf-symbol name='gluTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessVertex -->
    <elf-symbol name='gluTessVertex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluUnProject -->
    <elf-symbol name='gluUnProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluUnProject4 -->
    <elf-symbol name='gluUnProject4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='libnurbs/interface/glcurveval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- REAL[160] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='5120' id='type-id-2'>
      <!-- <anonymous range>[160] -->
      <subrange length='160' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <!-- REAL[40] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='1280' id='type-id-5'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='type-id-3' id='type-id-6'/>
    </array-type-def>
    <!-- struct curveEvalMachine -->
    <class-decl name='curveEvalMachine' size-in-bits='6592' is-struct='yes' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='55' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL curveEvalMachine::uprime -->
        <var-decl name='uprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int curveEvalMachine::k -->
        <var-decl name='k' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL curveEvalMachine::u1 -->
        <var-decl name='u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL curveEvalMachine::u2 -->
        <var-decl name='u2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int curveEvalMachine::ustride -->
        <var-decl name='ustride' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int curveEvalMachine::uorder -->
        <var-decl name='uorder' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- REAL curveEvalMachine::ctlpoints[160] -->
        <var-decl name='ctlpoints' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <!-- REAL curveEvalMachine::ucoeff[40] -->
        <var-decl name='ucoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef curveEvalMachine curveEvalMachine -->
    <typedef-decl name='curveEvalMachine' type-id='type-id-7' filepath='libnurbs/interface/glcurveval.h' line='64' column='1' id='type-id-9'/>
    <!-- class CachingEvaluator -->
    <class-decl name='CachingEvaluator' size-in-bits='64' visibility='default' filepath='libnurbs/internals/cachingeval.h' line='39' column='1' id='type-id-10'>
      <member-type access='private'>
        <!-- enum CachingEvaluator::ServiceMode -->
        <enum-decl name='ServiceMode' filepath='libnurbs/internals/cachingeval.h' line='42' column='1' id='type-id-11'>
          <underlying-type type-id='type-id-12'/>
          <enumerator name='play' value='0'/>
          <enumerator name='record' value='1'/>
          <enumerator name='playAndRecord' value='2'/>
        </enum-decl>
      </member-type>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- CachingEvaluator::~CachingEvaluator(int) -->
        <function-decl name='~CachingEvaluator' filepath='libnurbs/internals/cachingeval.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <!-- int CachingEvaluator::canRecord() -->
        <function-decl name='canRecord' mangled-name='_ZN16CachingEvaluator9canRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <!-- int CachingEvaluator::canPlayAndRecord() -->
        <function-decl name='canPlayAndRecord' mangled-name='_ZN16CachingEvaluator16canPlayAndRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <!-- int CachingEvaluator::createHandle(int) -->
        <function-decl name='createHandle' mangled-name='_ZN16CachingEvaluator12createHandleEi' filepath='libnurbs/internals/cachingeval.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <!-- void CachingEvaluator::beginOutput(CachingEvaluator::ServiceMode, int) -->
        <function-decl name='beginOutput' mangled-name='_ZN16CachingEvaluator11beginOutputENS_11ServiceModeEi' filepath='libnurbs/internals/cachingeval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <!-- parameter of type 'enum CachingEvaluator::ServiceMode' -->
          <parameter type-id='type-id-11'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <!-- void CachingEvaluator::endOutput() -->
        <function-decl name='endOutput' mangled-name='_ZN16CachingEvaluator9endOutputEv' filepath='libnurbs/internals/cachingeval.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='7'>
        <!-- void CachingEvaluator::discardRecording(int) -->
        <function-decl name='discardRecording' mangled-name='_ZN16CachingEvaluator16discardRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='8'>
        <!-- void CachingEvaluator::playRecording(int) -->
        <function-decl name='playRecording' mangled-name='_ZN16CachingEvaluator13playRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-13' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- typedef float REAL -->
    <typedef-decl name='REAL' type-id='type-id-15' filepath='libnurbs/internals/types.h' line='41' column='1' id='type-id-1'/>
    <!-- BasicCurveEvaluator* -->
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-17'/>
    <!-- CachingEvaluator* -->
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-13'/>
    <!-- CurveMap* -->
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <!-- OpenGLCurveEvaluator* -->
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-21'/>
    <!-- REAL* -->
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-22'/>
    <!-- const GLfloat -->
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-24'/>
    <!-- const GLfloat* -->
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <!-- curveEvalMachine* -->
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-26'/>
    <!-- void (const GLfloat*)* -->
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
    <!-- void (const GLfloat*, void*)* -->
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-30'/>
    <!-- struct CurveMap -->
    <class-decl name='CurveMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-18'/>
    <!-- class OpenGLCurveEvaluator -->
    <class-decl name='OpenGLCurveEvaluator' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='66' column='1' is-declaration-only='yes' id='type-id-20'>
      <!-- struct BasicCurveEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-16'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_vertex -->
        <var-decl name='em_vertex' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='102' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6656'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_normal -->
        <var-decl name='em_normal' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='103' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13248'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_color -->
        <var-decl name='em_color' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='104' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19840'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_texcoord -->
        <var-decl name='em_texcoord' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26432'>
        <!-- int OpenGLCurveEvaluator::vertex_flag -->
        <var-decl name='vertex_flag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26464'>
        <!-- int OpenGLCurveEvaluator::normal_flag -->
        <var-decl name='normal_flag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26496'>
        <!-- int OpenGLCurveEvaluator::color_flag -->
        <var-decl name='color_flag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26528'>
        <!-- int OpenGLCurveEvaluator::texcoord_flag -->
        <var-decl name='texcoord_flag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26560'>
        <!-- REAL OpenGLCurveEvaluator::global_grid_u0 -->
        <var-decl name='global_grid_u0' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26592'>
        <!-- REAL OpenGLCurveEvaluator::global_grid_u1 -->
        <var-decl name='global_grid_u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <!-- int OpenGLCurveEvaluator::global_grid_nu -->
        <var-decl name='global_grid_nu' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26688'>
        <!-- void (typedef GLenum)* OpenGLCurveEvaluator::beginCallBackN -->
        <var-decl name='beginCallBackN' type-id='type-id-31' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26752'>
        <!-- void ()* OpenGLCurveEvaluator::endCallBackN -->
        <var-decl name='endCallBackN' type-id='type-id-32' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26816'>
        <!-- void (const GLfloat*)* OpenGLCurveEvaluator::vertexCallBackN -->
        <var-decl name='vertexCallBackN' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26880'>
        <!-- void (const GLfloat*)* OpenGLCurveEvaluator::normalCallBackN -->
        <var-decl name='normalCallBackN' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26944'>
        <!-- void (const GLfloat*)* OpenGLCurveEvaluator::colorCallBackN -->
        <var-decl name='colorCallBackN' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27008'>
        <!-- void (const GLfloat*)* OpenGLCurveEvaluator::texcoordCallBackN -->
        <var-decl name='texcoordCallBackN' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27072'>
        <!-- void (typedef GLenum, void*)* OpenGLCurveEvaluator::beginCallBackData -->
        <var-decl name='beginCallBackData' type-id='type-id-33' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27136'>
        <!-- void (void*)* OpenGLCurveEvaluator::endCallBackData -->
        <var-decl name='endCallBackData' type-id='type-id-34' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27200'>
        <!-- void (const GLfloat*, void*)* OpenGLCurveEvaluator::vertexCallBackData -->
        <var-decl name='vertexCallBackData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27264'>
        <!-- void (const GLfloat*, void*)* OpenGLCurveEvaluator::normalCallBackData -->
        <var-decl name='normalCallBackData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27328'>
        <!-- void (const GLfloat*, void*)* OpenGLCurveEvaluator::colorCallBackData -->
        <var-decl name='colorCallBackData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <!-- void (const GLfloat*, void*)* OpenGLCurveEvaluator::texcoordCallBackData -->
        <var-decl name='texcoordCallBackData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <!-- void* OpenGLCurveEvaluator::userData -->
        <var-decl name='userData' type-id='type-id-35' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <!-- int OpenGLCurveEvaluator::output_triangles -->
        <var-decl name='output_triangles' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='154' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- OpenGLCurveEvaluator::OpenGLCurveEvaluator() -->
        <function-decl name='OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::addMap(CurveMap*) -->
        <function-decl name='addMap' mangled-name='_ZN20OpenGLCurveEvaluator6addMapEP8CurveMap' filepath='libnurbs/interface/glcurveval.cc' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'CurveMap*' -->
          <parameter type-id='type-id-19'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::putCallBack(GLenum, _GLUfuncptr) -->
        <function-decl name='putCallBack' mangled-name='_ZN20OpenGLCurveEvaluator11putCallBackEjPFvvE' filepath='libnurbs/interface/glcurveval.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'typedef GLenum' -->
          <parameter type-id='type-id-36'/>
          <!-- parameter of type 'typedef _GLUfuncptr' -->
          <parameter type-id='type-id-37'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::beginCallBack(GLenum, void*) -->
        <function-decl name='beginCallBack' mangled-name='_ZN20OpenGLCurveEvaluator13beginCallBackEjPv' filepath='libnurbs/interface/glcurveval.cc' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'typedef GLenum' -->
          <parameter type-id='type-id-36'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::endCallBack(void*) -->
        <function-decl name='endCallBack' mangled-name='_ZN20OpenGLCurveEvaluator11endCallBackEPv' filepath='libnurbs/interface/glcurveval.cc' line='359' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::vertexCallBack(const GLfloat*, void*) -->
        <function-decl name='vertexCallBack' mangled-name='_ZN20OpenGLCurveEvaluator14vertexCallBackEPKfPv' filepath='libnurbs/interface/glcurveval.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::normalCallBack(const GLfloat*, void*) -->
        <function-decl name='normalCallBack' mangled-name='_ZN20OpenGLCurveEvaluator14normalCallBackEPKfPv' filepath='libnurbs/interface/glcurveval.cc' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::colorCallBack(const GLfloat*, void*) -->
        <function-decl name='colorCallBack' mangled-name='_ZN20OpenGLCurveEvaluator13colorCallBackEPKfPv' filepath='libnurbs/interface/glcurveval.cc' line='387' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::texcoordCallBack(const GLfloat*, void*) -->
        <function-decl name='texcoordCallBack' mangled-name='_ZN20OpenGLCurveEvaluator16texcoordCallBackEPKfPv' filepath='libnurbs/interface/glcurveval.cc' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::evalpoint1i(long int) -->
        <function-decl name='evalpoint1i' mangled-name='_ZN20OpenGLCurveEvaluator11evalpoint1iEl' filepath='libnurbs/interface/glcurveval.cc' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::set_callback_userData(void*) -->
        <function-decl name='set_callback_userData' mangled-name='_ZN20OpenGLCurveEvaluator21set_callback_userDataEPv' filepath='libnurbs/interface/glcurveval.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::put_vertices_call_back(int) -->
        <function-decl name='put_vertices_call_back' mangled-name='_ZN20OpenGLCurveEvaluator22put_vertices_call_backEi' filepath='libnurbs/interface/glcurveval.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::inPreEvaluate(int, REAL, REAL*) -->
        <function-decl name='inPreEvaluate' mangled-name='_ZN20OpenGLCurveEvaluator13inPreEvaluateEifPf' filepath='libnurbs/interface/incurveeval.cc' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::inMap1f(int, int, REAL, REAL, int, int, REAL*) -->
        <function-decl name='inMap1f' mangled-name='_ZN20OpenGLCurveEvaluator7inMap1fEiiffiiPf' filepath='libnurbs/interface/incurveeval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::inDoDomain1(curveEvalMachine*, REAL, REAL*) -->
        <function-decl name='inDoDomain1' mangled-name='_ZN20OpenGLCurveEvaluator11inDoDomain1EP16curveEvalMachinefPf' filepath='libnurbs/interface/incurveeval.cc' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'curveEvalMachine*' -->
          <parameter type-id='type-id-26'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::inDoEvalCoord1(REAL) -->
        <function-decl name='inDoEvalCoord1' mangled-name='_ZN20OpenGLCurveEvaluator14inDoEvalCoord1Ef' filepath='libnurbs/interface/incurveeval.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLCurveEvaluator::inMapMesh1f(int, int) -->
        <function-decl name='inMapMesh1f' mangled-name='_ZN20OpenGLCurveEvaluator11inMapMesh1fEii' filepath='libnurbs/interface/incurveeval.cc' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- OpenGLCurveEvaluator::~OpenGLCurveEvaluator(int) -->
        <function-decl name='~OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <!-- void OpenGLCurveEvaluator::domain1f(REAL, REAL) -->
        <function-decl name='domain1f' mangled-name='_ZN20OpenGLCurveEvaluator8domain1fEff' filepath='libnurbs/interface/glcurveval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <!-- void OpenGLCurveEvaluator::range1f(long int, REAL*, REAL*) -->
        <function-decl name='range1f' mangled-name='_ZN20OpenGLCurveEvaluator7range1fElPfS0_' filepath='libnurbs/interface/glcurveval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <!-- void OpenGLCurveEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN20OpenGLCurveEvaluator6enableEl' filepath='libnurbs/interface/glcurveval.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <!-- void OpenGLCurveEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN20OpenGLCurveEvaluator7disableEl' filepath='libnurbs/interface/glcurveval.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <!-- void OpenGLCurveEvaluator::bgnmap1f(long int) -->
        <function-decl name='bgnmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8bgnmap1fEl' filepath='libnurbs/interface/glcurveval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <!-- void OpenGLCurveEvaluator::map1f(long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map1f' mangled-name='_ZN20OpenGLCurveEvaluator5map1fElffllPf' filepath='libnurbs/interface/glcurveval.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <!-- void OpenGLCurveEvaluator::mapgrid1f(long int, REAL, REAL) -->
        <function-decl name='mapgrid1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapgrid1fElff' filepath='libnurbs/interface/glcurveval.cc' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <!-- void OpenGLCurveEvaluator::mapmesh1f(long int, long int, long int) -->
        <function-decl name='mapmesh1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapmesh1fElll' filepath='libnurbs/interface/glcurveval.cc' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <!-- void OpenGLCurveEvaluator::evalcoord1f(long int, REAL) -->
        <function-decl name='evalcoord1f' mangled-name='_ZN20OpenGLCurveEvaluator11evalcoord1fElf' filepath='libnurbs/interface/glcurveval.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <!-- void OpenGLCurveEvaluator::endmap1f() -->
        <function-decl name='endmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8endmap1fEv' filepath='libnurbs/interface/glcurveval.cc' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <!-- void OpenGLCurveEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN20OpenGLCurveEvaluator7bgnlineEv' filepath='libnurbs/interface/glcurveval.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <!-- void OpenGLCurveEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN20OpenGLCurveEvaluator7endlineEv' filepath='libnurbs/interface/glcurveval.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-21' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct BasicCurveEvaluator -->
    <class-decl name='BasicCurveEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/internals/basiccrveval.h' line='43' column='1' is-declaration-only='yes' id='type-id-16'>
      <!-- class CachingEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-10'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <!-- BasicCurveEvaluator::~BasicCurveEvaluator(int) -->
        <function-decl name='~BasicCurveEvaluator' filepath='libnurbs/internals/basiccrveval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <!-- void BasicCurveEvaluator::domain1f(REAL, REAL) -->
        <function-decl name='domain1f' mangled-name='_ZN19BasicCurveEvaluator8domain1fEff' filepath='libnurbs/internals/basiccrveval.cc' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <!-- void BasicCurveEvaluator::range1f(long int, REAL*, REAL*) -->
        <function-decl name='range1f' mangled-name='_ZN19BasicCurveEvaluator7range1fElPfS0_' filepath='libnurbs/internals/basiccrveval.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <!-- void BasicCurveEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN19BasicCurveEvaluator6enableEl' filepath='libnurbs/internals/basiccrveval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <!-- void BasicCurveEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN19BasicCurveEvaluator7disableEl' filepath='libnurbs/internals/basiccrveval.cc' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <!-- void BasicCurveEvaluator::bgnmap1f(long int) -->
        <function-decl name='bgnmap1f' mangled-name='_ZN19BasicCurveEvaluator8bgnmap1fEl' filepath='libnurbs/internals/basiccrveval.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <!-- void BasicCurveEvaluator::map1f(long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map1f' mangled-name='_ZN19BasicCurveEvaluator5map1fElffllPf' filepath='libnurbs/internals/basiccrveval.cc' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <!-- void BasicCurveEvaluator::mapgrid1f(long int, REAL, REAL) -->
        <function-decl name='mapgrid1f' mangled-name='_ZN19BasicCurveEvaluator9mapgrid1fElff' filepath='libnurbs/internals/basiccrveval.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <!-- void BasicCurveEvaluator::mapmesh1f(long int, long int, long int) -->
        <function-decl name='mapmesh1f' mangled-name='_ZN19BasicCurveEvaluator9mapmesh1fElll' filepath='libnurbs/internals/basiccrveval.cc' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <!-- void BasicCurveEvaluator::evalcoord1f(long int, REAL) -->
        <function-decl name='evalcoord1f' mangled-name='_ZN19BasicCurveEvaluator11evalcoord1fElf' filepath='libnurbs/internals/basiccrveval.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <!-- void BasicCurveEvaluator::endmap1f() -->
        <function-decl name='endmap1f' mangled-name='_ZN19BasicCurveEvaluator8endmap1fEv' filepath='libnurbs/internals/basiccrveval.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <!-- void BasicCurveEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN19BasicCurveEvaluator7bgnlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <!-- void BasicCurveEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN19BasicCurveEvaluator7endlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- void (const GLfloat*) -->
    <function-type size-in-bits='64' id='type-id-27'>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='type-id-25'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
    <!-- void (const GLfloat*, void*) -->
    <function-type size-in-bits='64' id='type-id-29'>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='type-id-25'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-35'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glinterface.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- struct GLUnurbs -->
    <class-decl name='GLUnurbs' size-in-bits='1149440' is-struct='yes' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='49' column='1' id='type-id-39'>
      <!-- class NurbsTessellator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-40'/>
      <data-member access='public' layout-offset-in-bits='47616'>
        <!-- errorCallbackType GLUnurbs::errorCallback -->
        <var-decl name='errorCallback' type-id='type-id-41' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='71' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47680'>
        <!-- GLboolean GLUnurbs::autoloadmode -->
        <var-decl name='autoloadmode' type-id='type-id-42' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47744'>
        <!-- OpenGLSurfaceEvaluator GLUnurbs::surfaceEvaluator -->
        <var-decl name='surfaceEvaluator' type-id='type-id-43' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1121792'>
        <!-- OpenGLCurveEvaluator GLUnurbs::curveEvaluator -->
        <var-decl name='curveEvaluator' type-id='type-id-20' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1149376'>
        <!-- int GLUnurbs::callbackFlag -->
        <var-decl name='callbackFlag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='143' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- void GLUnurbs::setNurbsCallbackData(void*) -->
        <function-decl name='setNurbsCallbackData' mangled-name='_ZN8GLUnurbs20setNurbsCallbackDataEPv' filepath='libnurbs/interface/glrenderer.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void GLUnurbs::putSurfCallBack(GLenum, _GLUfuncptr) -->
        <function-decl name='putSurfCallBack' mangled-name='_ZN8GLUnurbs15putSurfCallBackEjPFvvE' filepath='libnurbs/interface/glrenderer.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'typedef GLenum' -->
          <parameter type-id='type-id-36'/>
          <!-- parameter of type 'typedef _GLUfuncptr' -->
          <parameter type-id='type-id-37'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void GLUnurbs::postError(int) -->
        <function-decl name='postError' mangled-name='_ZN8GLUnurbs9postErrorEi' filepath='libnurbs/interface/glrenderer.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- GLboolean GLUnurbs::getautoloadmode() -->
        <function-decl name='getautoloadmode' mangled-name='_ZN8GLUnurbs15getautoloadmodeEv' filepath='libnurbs/interface/glrenderer.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- typedef GLboolean -->
          <return type-id='type-id-42'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- int GLUnurbs::is_callback() -->
        <function-decl name='is_callback' mangled-name='_ZN8GLUnurbs11is_callbackEv' filepath='libnurbs/interface/glrenderer.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void GLUnurbs::setautoloadmode(float) -->
        <function-decl name='setautoloadmode' mangled-name='_ZN8GLUnurbs15setautoloadmodeEf' filepath='libnurbs/interface/glrenderer.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'float' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void GLUnurbs::put_callbackFlag(int) -->
        <function-decl name='put_callbackFlag' mangled-name='_ZN8GLUnurbs16put_callbackFlagEi' filepath='libnurbs/interface/glrenderer.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void GLUnurbs::LOD_eval_list(int) -->
        <function-decl name='LOD_eval_list' mangled-name='_ZN8GLUnurbs13LOD_eval_listEi' filepath='libnurbs/interface/glrenderer.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <!-- GLUnurbs::GLUnurbs() -->
        <function-decl name='GLUnurbs' filepath='libnurbs/interface/glrenderer.cc' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void GLUnurbs::transform4d(GLfloat*, GLfloat[4]*) -->
        <function-decl name='transform4d' mangled-name='_ZN8GLUnurbs11transform4dEPfS0_PA4_f' filepath='libnurbs/interface/glrenderer.cc' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'GLfloat*' -->
          <parameter type-id='type-id-45'/>
          <!-- parameter of type 'GLfloat*' -->
          <parameter type-id='type-id-45'/>
          <!-- parameter of type 'GLfloat[4]*' -->
          <parameter type-id='type-id-46'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void GLUnurbs::multmatrix4d(GLfloat[4]*, GLfloat[4]*) -->
        <function-decl name='multmatrix4d' mangled-name='_ZN8GLUnurbs12multmatrix4dEPA4_fPA4_KfS4_' filepath='libnurbs/interface/glrenderer.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'GLfloat[4]*' -->
          <parameter type-id='type-id-46'/>
          <!-- parameter of type 'GLfloat[4]*' -->
          <parameter type-id='type-id-46'/>
          <!-- parameter of type 'GLfloat[4]*' -->
          <parameter type-id='type-id-46'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void GLUnurbs::loadCullingMatrix(GLfloat[4]*) -->
        <function-decl name='loadCullingMatrix' mangled-name='_ZN8GLUnurbs17loadCullingMatrixEPA4_f' filepath='libnurbs/interface/glrenderer.cc' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'GLfloat[4]*' -->
          <parameter type-id='type-id-46'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void GLUnurbs::loadSamplingMatrix(GLfloat[4]*, const GLint*) -->
        <function-decl name='loadSamplingMatrix' mangled-name='_ZN8GLUnurbs18loadSamplingMatrixEPA4_KfPKi' filepath='libnurbs/interface/glrenderer.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'GLfloat[4]*' -->
          <parameter type-id='type-id-46'/>
          <!-- parameter of type 'const GLint*' -->
          <parameter type-id='type-id-47'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void GLUnurbs::useGLMatrices(const GLfloat*, const GLfloat*, const GLint*) -->
        <function-decl name='useGLMatrices' mangled-name='_ZN8GLUnurbs13useGLMatricesEPKfS1_PKi' filepath='libnurbs/interface/glrenderer.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'const GLint*' -->
          <parameter type-id='type-id-47'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void GLUnurbs::setSamplingMatrixIdentity() -->
        <function-decl name='setSamplingMatrixIdentity' mangled-name='_ZN8GLUnurbs25setSamplingMatrixIdentityEv' filepath='libnurbs/interface/glrenderer.cc' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void GLUnurbs::grabGLMatrix() -->
        <function-decl name='grabGLMatrix' mangled-name='_ZN8GLUnurbs12grabGLMatrixEPA4_f' filepath='libnurbs/interface/glrenderer.cc' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'GLfloat[4]*' -->
          <parameter type-id='type-id-46'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void GLUnurbs::loadGLMatrices() -->
        <function-decl name='loadGLMatrices' mangled-name='_ZN8GLUnurbs14loadGLMatricesEv' filepath='libnurbs/interface/glrenderer.cc' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <!-- void GLUnurbs::bgnrender() -->
        <function-decl name='bgnrender' mangled-name='_ZN8GLUnurbs9bgnrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <!-- void GLUnurbs::endrender() -->
        <function-decl name='endrender' mangled-name='_ZN8GLUnurbs9endrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <!-- void GLUnurbs::errorHandler(int) -->
        <function-decl name='errorHandler' mangled-name='_ZN8GLUnurbs12errorHandlerEi' filepath='libnurbs/interface/glrenderer.cc' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-44' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- GLUnurbs* -->
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-44'/>
    <!-- OpenGLSurfaceEvaluator* -->
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-48'/>
    <!-- float* -->
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-49'/>
    <!-- GLUnurbs* gluNewNurbsRenderer() -->
    <function-decl name='gluNewNurbsRenderer' mangled-name='gluNewNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNewNurbsRenderer'>
      <!-- GLUnurbs* -->
      <return type-id='type-id-44'/>
    </function-decl>
    <!-- void gluDeleteNurbsRenderer(GLUnurbs*) -->
    <function-decl name='gluDeleteNurbsRenderer' mangled-name='gluDeleteNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluDeleteNurbsRenderer'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluBeginSurface(GLUnurbs*) -->
    <function-decl name='gluBeginSurface' mangled-name='gluBeginSurface' filepath='libnurbs/interface/glinterface.cc' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginSurface'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluBeginCurve(GLUnurbs*) -->
    <function-decl name='gluBeginCurve' mangled-name='gluBeginCurve' filepath='libnurbs/interface/glinterface.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginCurve'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluEndCurve(GLUnurbs*) -->
    <function-decl name='gluEndCurve' mangled-name='gluEndCurve' filepath='libnurbs/interface/glinterface.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndCurve'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluEndSurface(GLUnurbs*) -->
    <function-decl name='gluEndSurface' mangled-name='gluEndSurface' filepath='libnurbs/interface/glinterface.cc' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndSurface'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluBeginTrim(GLUnurbs*) -->
    <function-decl name='gluBeginTrim' mangled-name='gluBeginTrim' filepath='libnurbs/interface/glinterface.cc' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginTrim'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluEndTrim(GLUnurbs*) -->
    <function-decl name='gluEndTrim' mangled-name='gluEndTrim' filepath='libnurbs/interface/glinterface.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndTrim'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluPwlCurve(GLUnurbs*, GLint, float*, GLint, GLenum) -->
    <function-decl name='gluPwlCurve' mangled-name='gluPwlCurve' filepath='libnurbs/interface/glinterface.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluPwlCurve'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='count' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <!-- parameter of type 'float*' -->
      <parameter type-id='type-id-49' name='array' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='stride' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-36' name='type' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluNurbsCurve(GLUnurbs*, GLint, float*, GLint, float*, GLint, GLenum) -->
    <function-decl name='gluNurbsCurve' mangled-name='gluNurbsCurve' filepath='libnurbs/interface/glinterface.cc' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCurve'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='nknots' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'float*' -->
      <parameter type-id='type-id-49' name='knot' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='stride' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'float*' -->
      <parameter type-id='type-id-49' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='order' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-36' name='type' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluNurbsSurface(GLUnurbs*, GLint, GLfloat*, GLint, GLfloat*, GLint, GLint, GLfloat*, GLint, GLint, GLenum) -->
    <function-decl name='gluNurbsSurface' mangled-name='gluNurbsSurface' filepath='libnurbs/interface/glinterface.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsSurface'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='sknot_count' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='type-id-45' name='sknot' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='tknot_count' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='type-id-45' name='tknot' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='s_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='t_stride' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='type-id-45' name='ctlarray' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='sorder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-50' name='torder' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-36' name='type' filepath='libnurbs/interface/glinterface.cc' line='203' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluLoadSamplingMatrices(GLUnurbs*, const GLfloat*, const GLfloat*, const GLint*) -->
    <function-decl name='gluLoadSamplingMatrices' mangled-name='gluLoadSamplingMatrices' filepath='libnurbs/interface/glinterface.cc' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluLoadSamplingMatrices'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='type-id-25' name='modelMatrix' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='type-id-25' name='projMatrix' filepath='libnurbs/interface/glinterface.cc' line='236' column='1'/>
      <!-- parameter of type 'const GLint*' -->
      <parameter type-id='type-id-47' name='viewport' filepath='libnurbs/interface/glinterface.cc' line='237' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluNurbsProperty(GLUnurbs*, GLenum, GLfloat) -->
    <function-decl name='gluNurbsProperty' mangled-name='gluNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsProperty'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-36' name='property' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <!-- parameter of type 'typedef GLfloat' -->
      <parameter type-id='type-id-23' name='value' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluGetNurbsProperty(GLUnurbs*, GLenum, GLfloat*) -->
    <function-decl name='gluGetNurbsProperty' mangled-name='gluGetNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluGetNurbsProperty'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-36' name='property' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='type-id-45' name='value' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluNurbsCallback(GLUnurbs*, GLenum, _GLUfuncptr) -->
    <function-decl name='gluNurbsCallback' mangled-name='gluNurbsCallback' filepath='libnurbs/interface/glinterface.cc' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallback'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-36' name='which' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <!-- parameter of type 'typedef _GLUfuncptr' -->
      <parameter type-id='type-id-37' name='fn' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluNurbsCallbackDataEXT(GLUnurbs*, void*) -->
    <function-decl name='gluNurbsCallbackDataEXT' mangled-name='gluNurbsCallbackDataEXT' filepath='libnurbs/interface/glinterface.cc' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackDataEXT'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-35' name='userData' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- void gluNurbsCallbackData(GLUnurbs*, void*) -->
    <function-decl name='gluNurbsCallbackData' mangled-name='gluNurbsCallbackData' filepath='libnurbs/interface/glinterface.cc' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackData'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-44' name='r' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-35' name='userData' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- void -->
      <return type-id='type-id-14'/>
    </function-decl>
    <!-- struct OpenGLSurfaceEvaluator -->
    <class-decl name='OpenGLSurfaceEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='100' column='1' is-declaration-only='yes' id='type-id-43'>
      <!-- struct BasicSurfaceEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-51'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- StoredVertex* OpenGLSurfaceEvaluator::vertexCache[3] -->
        <var-decl name='vertexCache' type-id='type-id-52' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='180' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- int OpenGLSurfaceEvaluator::tmeshing -->
        <var-decl name='tmeshing' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='181' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <!-- int OpenGLSurfaceEvaluator::which -->
        <var-decl name='which' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='182' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- int OpenGLSurfaceEvaluator::vcount -->
        <var-decl name='vcount' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='183' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <!-- GLint OpenGLSurfaceEvaluator::gl_polygon_mode[2] -->
        <var-decl name='gl_polygon_mode' type-id='type-id-53' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='185' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <!-- bezierPatchMesh* OpenGLSurfaceEvaluator::global_bpm -->
        <var-decl name='global_bpm' type-id='type-id-54' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <!-- int OpenGLSurfaceEvaluator::output_triangles -->
        <var-decl name='output_triangles' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- void (typedef GLenum)* OpenGLSurfaceEvaluator::beginCallBackN -->
        <var-decl name='beginCallBackN' type-id='type-id-31' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <!-- void ()* OpenGLSurfaceEvaluator::endCallBackN -->
        <var-decl name='endCallBackN' type-id='type-id-32' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <!-- void (const GLfloat*)* OpenGLSurfaceEvaluator::vertexCallBackN -->
        <var-decl name='vertexCallBackN' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <!-- void (const GLfloat*)* OpenGLSurfaceEvaluator::normalCallBackN -->
        <var-decl name='normalCallBackN' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <!-- void (const GLfloat*)* OpenGLSurfaceEvaluator::colorCallBackN -->
        <var-decl name='colorCallBackN' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <!-- void (const GLfloat*)* OpenGLSurfaceEvaluator::texcoordCallBackN -->
        <var-decl name='texcoordCallBackN' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <!-- void (typedef GLenum, void*)* OpenGLSurfaceEvaluator::beginCallBackData -->
        <var-decl name='beginCallBackData' type-id='type-id-33' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='200' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1024'>
        <!-- void (void*)* OpenGLSurfaceEvaluator::endCallBackData -->
        <var-decl name='endCallBackData' type-id='type-id-34' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='201' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <!-- void (const GLfloat*, void*)* OpenGLSurfaceEvaluator::vertexCallBackData -->
        <var-decl name='vertexCallBackData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <!-- void (const GLfloat*, void*)* OpenGLSurfaceEvaluator::normalCallBackData -->
        <var-decl name='normalCallBackData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <!-- void (const GLfloat*, void*)* OpenGLSurfaceEvaluator::colorCallBackData -->
        <var-decl name='colorCallBackData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='204' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <!-- void (const GLfloat*, void*)* OpenGLSurfaceEvaluator::texcoordCallBackData -->
        <var-decl name='texcoordCallBackData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='205' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <!-- void* OpenGLSurfaceEvaluator::userData -->
        <var-decl name='userData' type-id='type-id-35' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <!-- int OpenGLSurfaceEvaluator::LOD_eval_level -->
        <var-decl name='LOD_eval_level' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1440'>
        <!-- int OpenGLSurfaceEvaluator::global_uorder -->
        <var-decl name='global_uorder' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='231' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <!-- int OpenGLSurfaceEvaluator::global_vorder -->
        <var-decl name='global_vorder' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1504'>
        <!-- REAL OpenGLSurfaceEvaluator::global_uprime -->
        <var-decl name='global_uprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='233' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vprime -->
        <var-decl name='global_vprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='234' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1568'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vprime_BV -->
        <var-decl name='global_vprime_BV' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='235' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <!-- REAL OpenGLSurfaceEvaluator::global_uprime_BU -->
        <var-decl name='global_uprime_BU' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1632'>
        <!-- int OpenGLSurfaceEvaluator::global_uorder_BV -->
        <var-decl name='global_uorder_BV' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <!-- int OpenGLSurfaceEvaluator::global_vorder_BV -->
        <var-decl name='global_vorder_BV' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='238' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1696'>
        <!-- int OpenGLSurfaceEvaluator::global_uorder_BU -->
        <var-decl name='global_uorder_BU' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='239' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <!-- int OpenGLSurfaceEvaluator::global_vorder_BU -->
        <var-decl name='global_vorder_BU' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='240' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1760'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ucoeff[40] -->
        <var-decl name='global_ucoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3040'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vcoeff[40] -->
        <var-decl name='global_vcoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='243' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4320'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ucoeffDeriv[40] -->
        <var-decl name='global_ucoeffDeriv' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='244' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5600'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vcoeffDeriv[40] -->
        <var-decl name='global_vcoeffDeriv' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6880'>
        <!-- REAL OpenGLSurfaceEvaluator::global_BV[40][4] -->
        <var-decl name='global_BV' type-id='type-id-55' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='247' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='12000'>
        <!-- REAL OpenGLSurfaceEvaluator::global_PBV[40][4] -->
        <var-decl name='global_PBV' type-id='type-id-55' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='248' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='17120'>
        <!-- REAL OpenGLSurfaceEvaluator::global_BU[40][4] -->
        <var-decl name='global_BU' type-id='type-id-55' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='249' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='22240'>
        <!-- REAL OpenGLSurfaceEvaluator::global_PBU[40][4] -->
        <var-decl name='global_PBU' type-id='type-id-55' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='250' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <!-- REAL* OpenGLSurfaceEvaluator::global_baseData -->
        <var-decl name='global_baseData' type-id='type-id-22' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_k -->
        <var-decl name='global_ev_k' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='253' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27488'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_u1 -->
        <var-decl name='global_ev_u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='254' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_u2 -->
        <var-decl name='global_ev_u2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='255' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27552'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_ustride -->
        <var-decl name='global_ev_ustride' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='256' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27584'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_uorder -->
        <var-decl name='global_ev_uorder' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='257' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27616'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_v1 -->
        <var-decl name='global_ev_v1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='258' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27648'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_v2 -->
        <var-decl name='global_ev_v2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='259' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27680'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_vstride -->
        <var-decl name='global_ev_vstride' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='260' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27712'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_vorder -->
        <var-decl name='global_ev_vorder' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='261' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27744'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_ctlPoints[6400] -->
        <var-decl name='global_ev_ctlPoints' type-id='type-id-56' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='262' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232544'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_u0 -->
        <var-decl name='global_grid_u0' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='264' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232576'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_u1 -->
        <var-decl name='global_grid_u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='265' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232608'>
        <!-- int OpenGLSurfaceEvaluator::global_grid_nu -->
        <var-decl name='global_grid_nu' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='266' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232640'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_v0 -->
        <var-decl name='global_grid_v0' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='267' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232672'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_v1 -->
        <var-decl name='global_grid_v1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='268' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232704'>
        <!-- int OpenGLSurfaceEvaluator::global_grid_nv -->
        <var-decl name='global_grid_nv' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='269' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232736'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_vertex -->
        <var-decl name='em_vertex' type-id='type-id-57' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='349' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='443008'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_normal -->
        <var-decl name='em_normal' type-id='type-id-57' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='350' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='653280'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_color -->
        <var-decl name='em_color' type-id='type-id-57' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='351' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='863552'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_texcoord -->
        <var-decl name='em_texcoord' type-id='type-id-57' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073824'>
        <!-- int OpenGLSurfaceEvaluator::auto_normal_flag -->
        <var-decl name='auto_normal_flag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='354' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073856'>
        <!-- int OpenGLSurfaceEvaluator::callback_auto_normal -->
        <var-decl name='callback_auto_normal' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='356' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073888'>
        <!-- int OpenGLSurfaceEvaluator::vertex_flag -->
        <var-decl name='vertex_flag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073920'>
        <!-- int OpenGLSurfaceEvaluator::normal_flag -->
        <var-decl name='normal_flag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073952'>
        <!-- int OpenGLSurfaceEvaluator::color_flag -->
        <var-decl name='color_flag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073984'>
        <!-- int OpenGLSurfaceEvaluator::texcoord_flag -->
        <var-decl name='texcoord_flag' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='360' column='1'/>
      </data-member>
      <member-function access='public'>
        <!-- void OpenGLSurfaceEvaluator::set_callback_userData(void*) -->
        <function-decl name='set_callback_userData' mangled-name='_ZN22OpenGLSurfaceEvaluator21set_callback_userDataEPv' filepath='libnurbs/interface/glsurfeval.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void OpenGLSurfaceEvaluator::put_vertices_call_back(int) -->
        <function-decl name='put_vertices_call_back' mangled-name='_ZN22OpenGLSurfaceEvaluator22put_vertices_call_backEi' filepath='libnurbs/interface/glsurfeval.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <!-- OpenGLSurfaceEvaluator::OpenGLSurfaceEvaluator() -->
        <function-decl name='OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void OpenGLSurfaceEvaluator::putCallBack(GLenum, _GLUfuncptr) -->
        <function-decl name='putCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator11putCallBackEjPFvvE' filepath='libnurbs/interface/glsurfeval.cc' line='1190' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef GLenum' -->
          <parameter type-id='type-id-36'/>
          <!-- parameter of type 'typedef _GLUfuncptr' -->
          <parameter type-id='type-id-37'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::beginCallBack(GLenum, void*) -->
        <function-decl name='beginCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator13beginCallBackEjPv' filepath='libnurbs/interface/glsurfeval.cc' line='1237' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef GLenum' -->
          <parameter type-id='type-id-36'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::endCallBack(void*) -->
        <function-decl name='endCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator11endCallBackEPv' filepath='libnurbs/interface/glsurfeval.cc' line='1246' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::vertexCallBack(const GLfloat*, void*) -->
        <function-decl name='vertexCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator14vertexCallBackEPKfPv' filepath='libnurbs/interface/glsurfeval.cc' line='1255' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::normalCallBack(const GLfloat*, void*) -->
        <function-decl name='normalCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator14normalCallBackEPKfPv' filepath='libnurbs/interface/glsurfeval.cc' line='1265' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::colorCallBack(const GLfloat*, void*) -->
        <function-decl name='colorCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator13colorCallBackEPKfPv' filepath='libnurbs/interface/glsurfeval.cc' line='1274' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::texcoordCallBack(const GLfloat*, void*) -->
        <function-decl name='texcoordCallBack' mangled-name='_ZN22OpenGLSurfaceEvaluator16texcoordCallBackEPKfPv' filepath='libnurbs/interface/glsurfeval.cc' line='1283' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'const GLfloat*' -->
          <parameter type-id='type-id-25'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void OpenGLSurfaceEvaluator::coord2f(REAL, REAL) -->
        <function-decl name='coord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7coord2fEff' filepath='libnurbs/interface/glsurfeval.cc' line='1106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void OpenGLSurfaceEvaluator::point2i(long int, long int) -->
        <function-decl name='point2i' mangled-name='_ZN22OpenGLSurfaceEvaluator7point2iEll' filepath='libnurbs/interface/glsurfeval.cc' line='1069' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void OpenGLSurfaceEvaluator::newtmeshvert(REAL, REAL) -->
        <function-decl name='newtmeshvert' mangled-name='_ZN22OpenGLSurfaceEvaluator12newtmeshvertEff' filepath='libnurbs/interface/glsurfeval.cc' line='1160' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void OpenGLSurfaceEvaluator::newtmeshvert(long int, long int) -->
        <function-decl name='newtmeshvert' mangled-name='_ZN22OpenGLSurfaceEvaluator12newtmeshvertEll' filepath='libnurbs/interface/glsurfeval.cc' line='1134' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void OpenGLSurfaceEvaluator::LOD_eval_list(int) -->
        <function-decl name='LOD_eval_list' mangled-name='_ZN22OpenGLSurfaceEvaluator13LOD_eval_listEi' filepath='libnurbs/interface/glsurfeval.cc' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inMapGrid2f(int, REAL, REAL, int, REAL, REAL) -->
        <function-decl name='inMapGrid2f' mangled-name='_ZN22OpenGLSurfaceEvaluator11inMapGrid2fEiffiff' filepath='libnurbs/interface/insurfeval.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inComputeFirstPartials(REAL*, REAL*, REAL*) -->
        <function-decl name='inComputeFirstPartials' mangled-name='_ZN22OpenGLSurfaceEvaluator22inComputeFirstPartialsEPfS0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='501' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluate(int, REAL, REAL*) -->
        <function-decl name='inPreEvaluate' mangled-name='_ZN22OpenGLSurfaceEvaluator13inPreEvaluateEifPf' filepath='libnurbs/interface/insurfeval.cc' line='1022' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluateWithDeriv(int, REAL, REAL*, REAL*) -->
        <function-decl name='inPreEvaluateWithDeriv' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateWithDerivEifPfS0_' filepath='libnurbs/interface/insurfeval.cc' line='1066' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inDoDomain2WithDerivs(int, REAL, REAL, REAL, REAL, int, REAL, REAL, int, REAL*, REAL*, REAL*, REAL*) -->
        <function-decl name='inDoDomain2WithDerivs' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoDomain2WithDerivsEiffffiffiPfS0_S0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='949' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inDoDomain2WithDerivsBV(int, REAL, REAL, REAL, REAL, int, REAL, REAL, int, REAL*, REAL*, REAL*, REAL*) -->
        <function-decl name='inDoDomain2WithDerivsBV' mangled-name='_ZN22OpenGLSurfaceEvaluator23inDoDomain2WithDerivsBVEiffffiffiPfS0_S0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='903' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inDoDomain2WithDerivsBU(int, REAL, REAL, REAL, REAL, int, REAL, REAL, int, REAL*, REAL*, REAL*, REAL*) -->
        <function-decl name='inDoDomain2WithDerivsBU' mangled-name='_ZN22OpenGLSurfaceEvaluator23inDoDomain2WithDerivsBUEiffffiffiPfS0_S0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='868' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluateBU(int, int, int, REAL, REAL*) -->
        <function-decl name='inPreEvaluateBU' mangled-name='_ZN22OpenGLSurfaceEvaluator15inPreEvaluateBUEiiifPf' filepath='libnurbs/interface/insurfeval.cc' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluateBV(int, int, int, REAL, REAL*) -->
        <function-decl name='inPreEvaluateBV' mangled-name='_ZN22OpenGLSurfaceEvaluator15inPreEvaluateBVEiiifPf' filepath='libnurbs/interface/insurfeval.cc' line='809' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inEvalULine(int, REAL, REAL*, int, REAL[3]*, REAL[3]*) -->
        <function-decl name='inEvalULine' mangled-name='_ZN22OpenGLSurfaceEvaluator11inEvalULineEifPfiPA3_fS2_' filepath='libnurbs/interface/insurfeval.cc' line='1125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'REAL[3]*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'REAL[3]*' -->
          <parameter type-id='type-id-58'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inEvalVLine(int, REAL, REAL*, int, REAL[3]*, REAL[3]*) -->
        <function-decl name='inEvalVLine' mangled-name='_ZN22OpenGLSurfaceEvaluator11inEvalVLineEifPfiPA3_fS2_' filepath='libnurbs/interface/insurfeval.cc' line='1144' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'REAL[3]*' -->
          <parameter type-id='type-id-58'/>
          <!-- parameter of type 'REAL[3]*' -->
          <parameter type-id='type-id-58'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inMap2fEM(int, int, REAL, REAL, int, int, REAL, REAL, int, int, REAL*) -->
        <function-decl name='inMap2fEM' mangled-name='_ZN22OpenGLSurfaceEvaluator9inMap2fEMEiiffiiffiiPf' filepath='libnurbs/interface/insurfeval.cc' line='1540' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inDoDomain2WithDerivsEM(surfEvalMachine*, REAL, REAL, REAL*, REAL*, REAL*) -->
        <function-decl name='inDoDomain2WithDerivsEM' mangled-name='_ZN22OpenGLSurfaceEvaluator23inDoDomain2WithDerivsEMEP15surfEvalMachineffPfS2_S2_' filepath='libnurbs/interface/insurfeval.cc' line='1600' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'surfEvalMachine*' -->
          <parameter type-id='type-id-59'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inDoDomain2EM(surfEvalMachine*, REAL, REAL, REAL*) -->
        <function-decl name='inDoDomain2EM' mangled-name='_ZN22OpenGLSurfaceEvaluator13inDoDomain2EMEP15surfEvalMachineffPf' filepath='libnurbs/interface/insurfeval.cc' line='1653' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'surfEvalMachine*' -->
          <parameter type-id='type-id-59'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inEvalVStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='inEvalVStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator12inEvalVStripEifPfifS0_' filepath='libnurbs/interface/insurfeval.cc' line='1355' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inEvalUStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='inEvalUStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator12inEvalUStripEifPfifS0_' filepath='libnurbs/interface/insurfeval.cc' line='1166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inComputeNormal2(REAL*, REAL*, REAL*) -->
        <function-decl name='inComputeNormal2' mangled-name='_ZN22OpenGLSurfaceEvaluator16inComputeNormal2EPfS0_S0_' filepath='libnurbs/interface/insurfeval.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2EM(REAL, REAL) -->
        <function-decl name='inDoEvalCoord2EM' mangled-name='_ZN22OpenGLSurfaceEvaluator16inDoEvalCoord2EMEff' filepath='libnurbs/interface/insurfeval.cc' line='1702' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inBPMEvalEM(bezierPatchMesh*) -->
        <function-decl name='inBPMEvalEM' mangled-name='_ZN22OpenGLSurfaceEvaluator11inBPMEvalEMEP15bezierPatchMesh' filepath='libnurbs/interface/insurfeval.cc' line='1826' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'bezierPatchMesh*' -->
          <parameter type-id='type-id-54'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inBPMListEvalEM(bezierPatchMesh*) -->
        <function-decl name='inBPMListEvalEM' mangled-name='_ZN22OpenGLSurfaceEvaluator15inBPMListEvalEMEP15bezierPatchMesh' filepath='libnurbs/interface/insurfeval.cc' line='2056' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'bezierPatchMesh*' -->
          <parameter type-id='type-id-54'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2' mangled-name='_ZN22OpenGLSurfaceEvaluator14inDoEvalCoord2EffPfS0_' filepath='libnurbs/interface/insurfeval.cc' line='541' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inEvalMesh2(int, int, int, int) -->
        <function-decl name='inEvalMesh2' mangled-name='_ZN22OpenGLSurfaceEvaluator11inEvalMesh2Eiiii' filepath='libnurbs/interface/insurfeval.cc' line='400' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inEvalCoord2f(REAL, REAL) -->
        <function-decl name='inEvalCoord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator13inEvalCoord2fEff' filepath='libnurbs/interface/insurfeval.cc' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inEvalPoint2(int, int) -->
        <function-decl name='inEvalPoint2' mangled-name='_ZN22OpenGLSurfaceEvaluator12inEvalPoint2Eii' filepath='libnurbs/interface/insurfeval.cc' line='362' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inMap2f(int, REAL, REAL, int, int, REAL, REAL, int, int, REAL*) -->
        <function-decl name='inMap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7inMap2fEiffiiffiiPf' filepath='libnurbs/interface/insurfeval.cc' line='444' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inBPMEval(bezierPatchMesh*) -->
        <function-decl name='inBPMEval' mangled-name='_ZN22OpenGLSurfaceEvaluator9inBPMEvalEP15bezierPatchMesh' filepath='libnurbs/interface/insurfeval.cc' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'bezierPatchMesh*' -->
          <parameter type-id='type-id-54'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void OpenGLSurfaceEvaluator::inBPMListEval(bezierPatchMesh*) -->
        <function-decl name='inBPMListEval' mangled-name='_ZN22OpenGLSurfaceEvaluator13inBPMListEvalEP15bezierPatchMesh' filepath='libnurbs/interface/insurfeval.cc' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'bezierPatchMesh*' -->
          <parameter type-id='type-id-54'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <!-- OpenGLSurfaceEvaluator::~OpenGLSurfaceEvaluator(int) -->
        <function-decl name='~OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <!-- void OpenGLSurfaceEvaluator::range2f(long int, REAL*, REAL*) -->
        <function-decl name='range2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/interface/glsurfeval.cc' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <!-- void OpenGLSurfaceEvaluator::domain2f(REAL, REAL, REAL, REAL) -->
        <function-decl name='domain2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8domain2fEffff' filepath='libnurbs/interface/glsurfeval.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <!-- void OpenGLSurfaceEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN22OpenGLSurfaceEvaluator6enableEl' filepath='libnurbs/interface/glsurfeval.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <!-- void OpenGLSurfaceEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN22OpenGLSurfaceEvaluator7disableEl' filepath='libnurbs/interface/glsurfeval.cc' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <!-- void OpenGLSurfaceEvaluator::bgnmap2f(long int) -->
        <function-decl name='bgnmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/interface/glsurfeval.cc' line='739' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <!-- void OpenGLSurfaceEvaluator::map2f(long int, REAL, REAL, long int, long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map2f' mangled-name='_ZN22OpenGLSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/interface/glsurfeval.cc' line='872' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <!-- void OpenGLSurfaceEvaluator::mapgrid2f(long int, REAL, REAL, long int, REAL, REAL) -->
        <function-decl name='mapgrid2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/interface/glsurfeval.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <!-- void OpenGLSurfaceEvaluator::mapmesh2f(long int, long int, long int, long int, long int) -->
        <function-decl name='mapmesh2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/interface/glsurfeval.cc' line='946' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <!-- void OpenGLSurfaceEvaluator::evalcoord2f(long int, REAL, REAL) -->
        <function-decl name='evalcoord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/interface/glsurfeval.cc' line='1042' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <!-- void OpenGLSurfaceEvaluator::evalpoint2i(long int, long int) -->
        <function-decl name='evalpoint2i' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/interface/glsurfeval.cc' line='1059' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <!-- void OpenGLSurfaceEvaluator::endmap2f() -->
        <function-decl name='endmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8endmap2fEv' filepath='libnurbs/interface/glsurfeval.cc' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <!-- void OpenGLSurfaceEvaluator::polymode(long int) -->
        <function-decl name='polymode' mangled-name='_ZN22OpenGLSurfaceEvaluator8polymodeEl' filepath='libnurbs/interface/glsurfeval.cc' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <!-- void OpenGLSurfaceEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgnlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <!-- void OpenGLSurfaceEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN22OpenGLSurfaceEvaluator7endlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <!-- void OpenGLSurfaceEvaluator::bgnclosedline() -->
        <function-decl name='bgnclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <!-- void OpenGLSurfaceEvaluator::endclosedline() -->
        <function-decl name='endclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <!-- void OpenGLSurfaceEvaluator::bgntmesh() -->
        <function-decl name='bgntmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <!-- void OpenGLSurfaceEvaluator::swaptmesh() -->
        <function-decl name='swaptmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <!-- void OpenGLSurfaceEvaluator::endtmesh() -->
        <function-decl name='endtmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8endtmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <!-- void OpenGLSurfaceEvaluator::bgnqstrip() -->
        <function-decl name='bgnqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='712' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <!-- void OpenGLSurfaceEvaluator::endqstrip() -->
        <function-decl name='endqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9endqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='725' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <!-- void OpenGLSurfaceEvaluator::bgntfan() -->
        <function-decl name='bgntfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgntfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <!-- void OpenGLSurfaceEvaluator::endtfan() -->
        <function-decl name='endtfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7endtfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <!-- void OpenGLSurfaceEvaluator::evalUStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalUStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <!-- void OpenGLSurfaceEvaluator::evalVStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalVStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='530' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2NOGE(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN22OpenGLSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2NOGE_BU(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2NOGE_BV(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluateBV_intfac(REAL) -->
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluateBU_intfac(REAL) -->
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='321' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glrenderer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- GLfloat[4] -->
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='128' id='type-id-60'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='type-id-3' id='type-id-61'/>
    </array-type-def>
    <!-- typedef void (typedef GLenum)* errorCallbackType -->
    <typedef-decl name='errorCallbackType' type-id='type-id-31' filepath='libnurbs/interface/glrenderer.h' line='46' column='1' id='type-id-41'/>
    <!-- GLfloat[4]* -->
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-46'/>
    <!-- class NurbsTessellator -->
    <class-decl name='NurbsTessellator' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='53' column='1' is-declaration-only='yes' id='type-id-40'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <!-- Renderhints NurbsTessellator::renderhints -->
        <var-decl name='renderhints' type-id='type-id-62' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='104' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <!-- Maplist NurbsTessellator::maplist -->
        <var-decl name='maplist' type-id='type-id-63' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='105' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3008'>
        <!-- Backend NurbsTessellator::backend -->
        <var-decl name='backend' type-id='type-id-64' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3648'>
        <!-- Subdivider NurbsTessellator::subdivider -->
        <var-decl name='subdivider' type-id='type-id-65' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24064'>
        <!-- JumpBuffer* NurbsTessellator::jumpbuffer -->
        <var-decl name='jumpbuffer' type-id='type-id-66' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24128'>
        <!-- Pool NurbsTessellator::o_pwlcurvePool -->
        <var-decl name='o_pwlcurvePool' type-id='type-id-67' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <!-- Pool NurbsTessellator::o_nurbscurvePool -->
        <var-decl name='o_nurbscurvePool' type-id='type-id-67' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='29120'>
        <!-- Pool NurbsTessellator::o_curvePool -->
        <var-decl name='o_curvePool' type-id='type-id-67' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='31616'>
        <!-- Pool NurbsTessellator::o_trimPool -->
        <var-decl name='o_trimPool' type-id='type-id-67' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='34112'>
        <!-- Pool NurbsTessellator::o_surfacePool -->
        <var-decl name='o_surfacePool' type-id='type-id-67' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='36608'>
        <!-- Pool NurbsTessellator::o_nurbssurfacePool -->
        <var-decl name='o_nurbssurfacePool' type-id='type-id-67' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='39104'>
        <!-- Pool NurbsTessellator::propertyPool -->
        <var-decl name='propertyPool' type-id='type-id-67' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='41600'>
        <!-- Pool NurbsTessellator::quiltPool -->
        <var-decl name='quiltPool' type-id='type-id-67' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='44096'>
        <!-- TrimVertexPool NurbsTessellator::extTrimVertexPool -->
        <var-decl name='extTrimVertexPool' type-id='type-id-68' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46720'>
        <!-- int NurbsTessellator::inSurface -->
        <var-decl name='inSurface' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='148' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46752'>
        <!-- int NurbsTessellator::inCurve -->
        <var-decl name='inCurve' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='149' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46784'>
        <!-- int NurbsTessellator::inTrim -->
        <var-decl name='inTrim' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46816'>
        <!-- int NurbsTessellator::isCurveModified -->
        <var-decl name='isCurveModified' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='151' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46848'>
        <!-- int NurbsTessellator::isTrimModified -->
        <var-decl name='isTrimModified' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='152' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46880'>
        <!-- int NurbsTessellator::isSurfaceModified -->
        <var-decl name='isSurfaceModified' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46912'>
        <!-- int NurbsTessellator::isDataValid -->
        <var-decl name='isDataValid' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46944'>
        <!-- int NurbsTessellator::numTrims -->
        <var-decl name='numTrims' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='155' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46976'>
        <!-- int NurbsTessellator::playBack -->
        <var-decl name='playBack' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='156' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47040'>
        <!-- O_trim** NurbsTessellator::nextTrim -->
        <var-decl name='nextTrim' type-id='type-id-69' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='158' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47104'>
        <!-- O_curve** NurbsTessellator::nextCurve -->
        <var-decl name='nextCurve' type-id='type-id-70' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47168'>
        <!-- O_nurbscurve** NurbsTessellator::nextNurbscurve -->
        <var-decl name='nextNurbscurve' type-id='type-id-71' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47232'>
        <!-- O_pwlcurve** NurbsTessellator::nextPwlcurve -->
        <var-decl name='nextPwlcurve' type-id='type-id-72' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='161' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47296'>
        <!-- O_nurbssurface** NurbsTessellator::nextNurbssurface -->
        <var-decl name='nextNurbssurface' type-id='type-id-73' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47360'>
        <!-- O_surface* NurbsTessellator::currentSurface -->
        <var-decl name='currentSurface' type-id='type-id-74' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='164' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47424'>
        <!-- O_trim* NurbsTessellator::currentTrim -->
        <var-decl name='currentTrim' type-id='type-id-75' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='165' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47488'>
        <!-- O_curve* NurbsTessellator::currentCurve -->
        <var-decl name='currentCurve' type-id='type-id-76' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='166' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47552'>
        <!-- DisplayList* NurbsTessellator::dl -->
        <var-decl name='dl' type-id='type-id-77' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='168' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- NurbsTessellator::NurbsTessellator(BasicCurveEvaluator&, BasicSurfaceEvaluator&) -->
        <function-decl name='NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'BasicCurveEvaluator&' -->
          <parameter type-id='type-id-79'/>
          <!-- parameter of type 'BasicSurfaceEvaluator&' -->
          <parameter type-id='type-id-80'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::playRecording(void*) -->
        <function-decl name='playRecording' mangled-name='_ZN16NurbsTessellator13playRecordingEPv' filepath='libnurbs/internals/nurbsinterfac.cc' line='529' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::endRecording() -->
        <function-decl name='endRecording' mangled-name='_ZN16NurbsTessellator12endRecordingEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='522' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void* NurbsTessellator::beginRecording() -->
        <function-decl name='beginRecording' mangled-name='_ZN16NurbsTessellator14beginRecordingEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='515' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void* -->
          <return type-id='type-id-35'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::discardRecording(void*) -->
        <function-decl name='discardRecording' mangled-name='_ZN16NurbsTessellator16discardRecordingEPv' filepath='libnurbs/internals/nurbsinterfac.cc' line='509' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::defineMap(long int, long int, long int) -->
        <function-decl name='defineMap' mangled-name='_ZN16NurbsTessellator9defineMapElll' filepath='libnurbs/internals/nurbsinterfac.cc' line='503' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::redefineMaps() -->
        <function-decl name='redefineMaps' mangled-name='_ZN16NurbsTessellator12redefineMapsEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='497' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::setnurbsproperty(long int, long int, float*, long int, long int) -->
        <function-decl name='setnurbsproperty' mangled-name='_ZN16NurbsTessellator16setnurbspropertyEllPfll' filepath='libnurbs/internals/nurbsinterfac.cc' line='474' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::setnurbsproperty(long int, long int, float*) -->
        <function-decl name='setnurbsproperty' mangled-name='_ZN16NurbsTessellator16setnurbspropertyEllPf' filepath='libnurbs/internals/nurbsinterfac.cc' line='451' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::getnurbsproperty(long int, long int, float*) -->
        <function-decl name='getnurbsproperty' mangled-name='_ZN16NurbsTessellator16getnurbspropertyEllPf' filepath='libnurbs/internals/nurbsinterfac.cc' line='431' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::getnurbsproperty(long int, float*) -->
        <function-decl name='getnurbsproperty' mangled-name='_ZN16NurbsTessellator16getnurbspropertyElPf' filepath='libnurbs/internals/nurbsinterfac.cc' line='415' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::endtrim() -->
        <function-decl name='endtrim' mangled-name='_ZN16NurbsTessellator7endtrimEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::endsurface() -->
        <function-decl name='endsurface' mangled-name='_ZN16NurbsTessellator10endsurfaceEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::endcurve() -->
        <function-decl name='endcurve' mangled-name='_ZN16NurbsTessellator8endcurveEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::bgnsurface(long int) -->
        <function-decl name='bgnsurface' mangled-name='_ZN16NurbsTessellator10bgnsurfaceEl' filepath='libnurbs/internals/nurbsinterfac.cc' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::bgntrim() -->
        <function-decl name='bgntrim' mangled-name='_ZN16NurbsTessellator7bgntrimEv' filepath='libnurbs/internals/nurbsinterfac.cc' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::bgncurve(long int) -->
        <function-decl name='bgncurve' mangled-name='_ZN16NurbsTessellator8bgncurveEl' filepath='libnurbs/internals/nurbsinterfac.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::setnurbsproperty(long int, float) -->
        <function-decl name='setnurbsproperty' mangled-name='_ZN16NurbsTessellator16setnurbspropertyElf' filepath='libnurbs/internals/nurbsinterfac.cc' line='373' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::pwlcurve(long int, float*, long int, long int) -->
        <function-decl name='pwlcurve' mangled-name='_ZN16NurbsTessellator8pwlcurveElPfll' filepath='libnurbs/internals/nurbsinterfac.cc' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::setnurbsproperty(long int, long int, float) -->
        <function-decl name='setnurbsproperty' mangled-name='_ZN16NurbsTessellator16setnurbspropertyEllf' filepath='libnurbs/internals/nurbsinterfac.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::nurbscurve(long int, float*, long int, float*, long int, long int) -->
        <function-decl name='nurbscurve' mangled-name='_ZN16NurbsTessellator10nurbscurveElPflS0_ll' filepath='libnurbs/internals/nurbsinterfac.cc' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::nurbssurface(long int, float*, long int, float*, long int, long int, float*, long int, long int, long int) -->
        <function-decl name='nurbssurface' mangled-name='_ZN16NurbsTessellator12nurbssurfaceElPflS0_llS0_lll' filepath='libnurbs/internals/nurbsinterfac.cc' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'float*' -->
          <parameter type-id='type-id-49'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_freenurbsproperty(Property*) -->
        <function-decl name='do_freenurbsproperty' mangled-name='_ZN16NurbsTessellator20do_freenurbspropertyEP8Property' filepath='libnurbs/internals/nurbstess.cc' line='636' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'Property*' -->
          <parameter type-id='type-id-81'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_freepwlcurve(O_pwlcurve*) -->
        <function-decl name='do_freepwlcurve' mangled-name='_ZN16NurbsTessellator15do_freepwlcurveEP10O_pwlcurve' filepath='libnurbs/internals/nurbstess.cc' line='450' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_pwlcurve*' -->
          <parameter type-id='type-id-82'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_freebgncurve(O_curve*) -->
        <function-decl name='do_freebgncurve' mangled-name='_ZN16NurbsTessellator15do_freebgncurveEP7O_curve' filepath='libnurbs/internals/nurbstess.cc' line='456' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_curve*' -->
          <parameter type-id='type-id-76'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_freebgntrim(O_trim*) -->
        <function-decl name='do_freebgntrim' mangled-name='_ZN16NurbsTessellator14do_freebgntrimEP6O_trim' filepath='libnurbs/internals/nurbstess.cc' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_trim*' -->
          <parameter type-id='type-id-75'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_freebgnsurface(O_surface*) -->
        <function-decl name='do_freebgnsurface' mangled-name='_ZN16NurbsTessellator17do_freebgnsurfaceEP9O_surface' filepath='libnurbs/internals/nurbstess.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_surface*' -->
          <parameter type-id='type-id-74'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::resetObjects() -->
        <function-decl name='resetObjects' mangled-name='_ZN16NurbsTessellator12resetObjectsEv' filepath='libnurbs/internals/nurbstess.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::set_domain_distance_u_rate(REAL) -->
        <function-decl name='set_domain_distance_u_rate' mangled-name='_ZN16NurbsTessellator26set_domain_distance_u_rateEf' filepath='libnurbs/internals/nurbstess.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::set_domain_distance_v_rate(REAL) -->
        <function-decl name='set_domain_distance_v_rate' mangled-name='_ZN16NurbsTessellator26set_domain_distance_v_rateEf' filepath='libnurbs/internals/nurbstess.cc' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::set_is_domain_distance_sampling(int) -->
        <function-decl name='set_is_domain_distance_sampling' mangled-name='_ZN16NurbsTessellator31set_is_domain_distance_samplingEi' filepath='libnurbs/internals/nurbstess.cc' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_nurbserror(int) -->
        <function-decl name='do_nurbserror' mangled-name='_ZN16NurbsTessellator13do_nurbserrorEi' filepath='libnurbs/internals/nurbstess.cc' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_endtrim() -->
        <function-decl name='do_endtrim' mangled-name='_ZN16NurbsTessellator10do_endtrimEv' filepath='libnurbs/internals/nurbstess.cc' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- int NurbsTessellator::do_check_knots(Knotvector*, const char*) -->
        <function-decl name='do_check_knots' mangled-name='_ZN16NurbsTessellator14do_check_knotsEP10KnotvectorPKc' filepath='libnurbs/internals/nurbstess.cc' line='678' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'Knotvector*' -->
          <parameter type-id='type-id-83'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-84'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_setnurbsproperty2(Property*) -->
        <function-decl name='do_setnurbsproperty2' mangled-name='_ZN16NurbsTessellator20do_setnurbsproperty2EP8Property' filepath='libnurbs/internals/nurbstess.cc' line='657' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'Property*' -->
          <parameter type-id='type-id-81'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_setnurbsproperty(Property*) -->
        <function-decl name='do_setnurbsproperty' mangled-name='_ZN16NurbsTessellator19do_setnurbspropertyEP8Property' filepath='libnurbs/internals/nurbstess.cc' line='649' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'Property*' -->
          <parameter type-id='type-id-81'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_nurbssurface(O_nurbssurface*) -->
        <function-decl name='do_nurbssurface' mangled-name='_ZN16NurbsTessellator15do_nurbssurfaceEP14O_nurbssurface' filepath='libnurbs/internals/nurbstess.cc' line='598' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_nurbssurface*' -->
          <parameter type-id='type-id-85'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_bgnsurface(O_surface*) -->
        <function-decl name='do_bgnsurface' mangled-name='_ZN16NurbsTessellator13do_bgnsurfaceEP9O_surface' filepath='libnurbs/internals/nurbstess.cc' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_surface*' -->
          <parameter type-id='type-id-74'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_freenurbssurface(O_nurbssurface*) -->
        <function-decl name='do_freenurbssurface' mangled-name='_ZN16NurbsTessellator19do_freenurbssurfaceEP14O_nurbssurface' filepath='libnurbs/internals/nurbstess.cc' line='585' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_nurbssurface*' -->
          <parameter type-id='type-id-85'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_freenurbscurve(O_nurbscurve*) -->
        <function-decl name='do_freenurbscurve' mangled-name='_ZN16NurbsTessellator17do_freenurbscurveEP12O_nurbscurve' filepath='libnurbs/internals/nurbstess.cc' line='520' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_nurbscurve*' -->
          <parameter type-id='type-id-86'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_freecurveall(O_curve*) -->
        <function-decl name='do_freecurveall' mangled-name='_ZN16NurbsTessellator15do_freecurveallEP7O_curve' filepath='libnurbs/internals/nurbstess.cc' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_curve*' -->
          <parameter type-id='type-id-76'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_freeall() -->
        <function-decl name='do_freeall' mangled-name='_ZN16NurbsTessellator10do_freeallEv' filepath='libnurbs/internals/nurbstess.cc' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_nurbscurve(O_nurbscurve*) -->
        <function-decl name='do_nurbscurve' mangled-name='_ZN16NurbsTessellator13do_nurbscurveEP12O_nurbscurve' filepath='libnurbs/internals/nurbstess.cc' line='534' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_nurbscurve*' -->
          <parameter type-id='type-id-86'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_pwlcurve(O_pwlcurve*) -->
        <function-decl name='do_pwlcurve' mangled-name='_ZN16NurbsTessellator11do_pwlcurveEP10O_pwlcurve' filepath='libnurbs/internals/nurbstess.cc' line='468' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_pwlcurve*' -->
          <parameter type-id='type-id-82'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_bgncurve(O_curve*) -->
        <function-decl name='do_bgncurve' mangled-name='_ZN16NurbsTessellator11do_bgncurveEP7O_curve' filepath='libnurbs/internals/nurbstess.cc' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_curve*' -->
          <parameter type-id='type-id-76'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_bgntrim(O_trim*) -->
        <function-decl name='do_bgntrim' mangled-name='_ZN16NurbsTessellator10do_bgntrimEP6O_trim' filepath='libnurbs/internals/nurbstess.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- parameter of type 'O_trim*' -->
          <parameter type-id='type-id-75'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_endsurface() -->
        <function-decl name='do_endsurface' mangled-name='_ZN16NurbsTessellator13do_endsurfaceEv' filepath='libnurbs/internals/nurbstess.cc' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void NurbsTessellator::do_endcurve() -->
        <function-decl name='do_endcurve' mangled-name='_ZN16NurbsTessellator11do_endcurveEv' filepath='libnurbs/internals/nurbstess.cc' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- NurbsTessellator::~NurbsTessellator(int) -->
        <function-decl name='~NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <!-- void NurbsTessellator::bgnrender() -->
        <function-decl name='bgnrender' mangled-name='_ZN16NurbsTessellator9bgnrenderEv' filepath='libnurbs/internals/nurbstess.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <!-- void NurbsTessellator::endrender() -->
        <function-decl name='endrender' mangled-name='_ZN16NurbsTessellator9endrenderEv' filepath='libnurbs/internals/nurbstess.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <!-- void NurbsTessellator::makeobj(int) -->
        <function-decl name='makeobj' mangled-name='_ZN16NurbsTessellator7makeobjEi' filepath='libnurbs/internals/nurbstess.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <!-- void NurbsTessellator::closeobj() -->
        <function-decl name='closeobj' mangled-name='_ZN16NurbsTessellator8closeobjEv' filepath='libnurbs/internals/nurbstess.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <!-- void NurbsTessellator::errorHandler(int) -->
        <function-decl name='errorHandler' mangled-name='_ZN16NurbsTessellator12errorHandlerEi' filepath='libnurbs/internals/nurbstess.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-78' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glsurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- GLint[2] -->
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='64' id='type-id-53'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-3' id='type-id-87'/>
    </array-type-def>
    <!-- REAL[2] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' id='type-id-88'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-3' id='type-id-87'/>
    </array-type-def>
    <!-- REAL[3] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='96' id='type-id-89'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' type-id='type-id-3' id='type-id-90'/>
    </array-type-def>
    <!-- REAL[40][4] -->
    <array-type-def dimensions='2' type-id='type-id-1' size-in-bits='5120' id='type-id-55'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='type-id-3' id='type-id-6'/>
      <!-- <anonymous range>[4] -->
      <subrange length='4' type-id='type-id-3' id='type-id-61'/>
    </array-type-def>
    <!-- REAL[6400] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='204800' id='type-id-56'>
      <!-- <anonymous range>[6400] -->
      <subrange length='6400' type-id='type-id-3' id='type-id-91'/>
    </array-type-def>
    <!-- StoredVertex*[3] -->
    <array-type-def dimensions='1' type-id='type-id-92' size-in-bits='192' id='type-id-52'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' type-id='type-id-3' id='type-id-90'/>
    </array-type-def>
    <!-- long int[2] -->
    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='128' id='type-id-93'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-3' id='type-id-87'/>
    </array-type-def>
    <!-- struct bezierPatch -->
    <class-decl name='bezierPatch' size-in-bits='384' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='36' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- float bezierPatch::umin -->
        <var-decl name='umin' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- float bezierPatch::vmin -->
        <var-decl name='vmin' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- float bezierPatch::umax -->
        <var-decl name='umax' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- float bezierPatch::vmax -->
        <var-decl name='vmax' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int bezierPatch::uorder -->
        <var-decl name='uorder' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int bezierPatch::vorder -->
        <var-decl name='vorder' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int bezierPatch::dimension -->
        <var-decl name='dimension' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- float* bezierPatch::ctlpoints -->
        <var-decl name='ctlpoints' type-id='type-id-49' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- bezierPatch* bezierPatch::next -->
        <var-decl name='next' type-id='type-id-95' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef bezierPatch bezierPatch -->
    <typedef-decl name='bezierPatch' type-id='type-id-94' filepath='libnurbs/interface/bezierPatch.h' line='65' column='1' id='type-id-96'/>
    <!-- struct bezierPatchMesh -->
    <class-decl name='bezierPatchMesh' size-in-bits='960' is-struct='yes' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='39' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- bezierPatch* bezierPatchMesh::bpatch -->
        <var-decl name='bpatch' type-id='type-id-95' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- bezierPatch* bezierPatchMesh::bpatch_normal -->
        <var-decl name='bpatch_normal' type-id='type-id-95' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- bezierPatch* bezierPatchMesh::bpatch_texcoord -->
        <var-decl name='bpatch_texcoord' type-id='type-id-95' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- bezierPatch* bezierPatchMesh::bpatch_color -->
        <var-decl name='bpatch_color' type-id='type-id-95' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- float* bezierPatchMesh::UVarray -->
        <var-decl name='UVarray' type-id='type-id-49' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int* bezierPatchMesh::length_array -->
        <var-decl name='length_array' type-id='type-id-98' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- GLenum* bezierPatchMesh::type_array -->
        <var-decl name='type_array' type-id='type-id-99' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int bezierPatchMesh::size_UVarray -->
        <var-decl name='size_UVarray' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- int bezierPatchMesh::index_UVarray -->
        <var-decl name='index_UVarray' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int bezierPatchMesh::size_length_array -->
        <var-decl name='size_length_array' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- int bezierPatchMesh::index_length_array -->
        <var-decl name='index_length_array' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- int bezierPatchMesh::counter -->
        <var-decl name='counter' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- GLenum bezierPatchMesh::type -->
        <var-decl name='type' type-id='type-id-36' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- float* bezierPatchMesh::vertex_array -->
        <var-decl name='vertex_array' type-id='type-id-49' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- float* bezierPatchMesh::normal_array -->
        <var-decl name='normal_array' type-id='type-id-49' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- float* bezierPatchMesh::color_array -->
        <var-decl name='color_array' type-id='type-id-49' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- float* bezierPatchMesh::texcoord_array -->
        <var-decl name='texcoord_array' type-id='type-id-49' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- bezierPatchMesh* bezierPatchMesh::next -->
        <var-decl name='next' type-id='type-id-54' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef bezierPatchMesh bezierPatchMesh -->
    <typedef-decl name='bezierPatchMesh' type-id='type-id-97' filepath='libnurbs/interface/bezierPatchMesh.h' line='66' column='1' id='type-id-100'/>
    <!-- struct surfEvalMachine -->
    <class-decl name='surfEvalMachine' size-in-bits='210272' is-struct='yes' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='63' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL surfEvalMachine::uprime -->
        <var-decl name='uprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- REAL surfEvalMachine::vprime -->
        <var-decl name='vprime' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int surfEvalMachine::k -->
        <var-decl name='k' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL surfEvalMachine::u1 -->
        <var-decl name='u1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- REAL surfEvalMachine::u2 -->
        <var-decl name='u2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int surfEvalMachine::ustride -->
        <var-decl name='ustride' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int surfEvalMachine::uorder -->
        <var-decl name='uorder' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- REAL surfEvalMachine::v1 -->
        <var-decl name='v1' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- REAL surfEvalMachine::v2 -->
        <var-decl name='v2' type-id='type-id-1' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- int surfEvalMachine::vstride -->
        <var-decl name='vstride' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int surfEvalMachine::vorder -->
        <var-decl name='vorder' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- REAL surfEvalMachine::ctlPoints[6400] -->
        <var-decl name='ctlPoints' type-id='type-id-56' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='205152'>
        <!-- REAL surfEvalMachine::ucoeff[40] -->
        <var-decl name='ucoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='206432'>
        <!-- REAL surfEvalMachine::vcoeff[40] -->
        <var-decl name='vcoeff' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='207712'>
        <!-- REAL surfEvalMachine::ucoeffDeriv[40] -->
        <var-decl name='ucoeffDeriv' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208992'>
        <!-- REAL surfEvalMachine::vcoeffDeriv[40] -->
        <var-decl name='vcoeffDeriv' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef surfEvalMachine surfEvalMachine -->
    <typedef-decl name='surfEvalMachine' type-id='type-id-101' filepath='libnurbs/interface/glsurfeval.h' line='80' column='1' id='type-id-57'/>
    <!-- class StoredVertex -->
    <class-decl name='StoredVertex' size-in-bits='256' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='84' column='1' id='type-id-102'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- int StoredVertex::type -->
        <var-decl name='type' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <!-- REAL StoredVertex::coord[2] -->
        <var-decl name='coord' type-id='type-id-88' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='96' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- long int StoredVertex::point[2] -->
        <var-decl name='point' type-id='type-id-93' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='97' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- StoredVertex::StoredVertex() -->
        <function-decl name='StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'StoredVertex*' -->
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- StoredVertex::~StoredVertex(int) -->
        <function-decl name='~StoredVertex' filepath='libnurbs/interface/glsurfeval.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'StoredVertex*' -->
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void StoredVertex::saveEvalCoord(REAL, REAL) -->
        <function-decl name='saveEvalCoord' mangled-name='_ZN12StoredVertex13saveEvalCoordEff' filepath='libnurbs/interface/glsurfeval.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'StoredVertex*' -->
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void StoredVertex::saveEvalPoint(long int, long int) -->
        <function-decl name='saveEvalPoint' mangled-name='_ZN12StoredVertex13saveEvalPointEll' filepath='libnurbs/interface/glsurfeval.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'StoredVertex*' -->
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void StoredVertex::invoke(OpenGLSurfaceEvaluator*) -->
        <function-decl name='invoke' mangled-name='_ZN12StoredVertex6invokeEP22OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'StoredVertex*' -->
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <!-- parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-48'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- BasicSurfaceEvaluator* -->
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-103'/>
    <!-- GLenum* -->
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-99'/>
    <!-- REAL[3]* -->
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-58'/>
    <!-- StoredVertex* -->
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-92'/>
    <!-- SurfaceMap* -->
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <!-- bezierPatch* -->
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <!-- bezierPatchMesh* -->
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-54'/>
    <!-- int* -->
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-98'/>
    <!-- surfEvalMachine* -->
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-59'/>
    <!-- struct SurfaceMap -->
    <class-decl name='SurfaceMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-104'/>
    <!-- struct BasicSurfaceEvaluator -->
    <class-decl name='BasicSurfaceEvaluator' is-struct='yes' visibility='default' filepath='libnurbs/internals/basicsurfeval.h' line='43' column='1' is-declaration-only='yes' id='type-id-51'>
      <!-- class CachingEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-10'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <!-- BasicSurfaceEvaluator::~BasicSurfaceEvaluator(int) -->
        <function-decl name='~BasicSurfaceEvaluator' filepath='libnurbs/internals/basicsurfeval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <!-- void BasicSurfaceEvaluator::range2f(long int, REAL*, REAL*) -->
        <function-decl name='range2f' mangled-name='_ZN21BasicSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/internals/basicsurfeval.cc' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <!-- void BasicSurfaceEvaluator::domain2f(REAL, REAL, REAL, REAL) -->
        <function-decl name='domain2f' mangled-name='_ZN21BasicSurfaceEvaluator8domain2fEffff' filepath='libnurbs/internals/basicsurfeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <!-- void BasicSurfaceEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN21BasicSurfaceEvaluator6enableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <!-- void BasicSurfaceEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN21BasicSurfaceEvaluator7disableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <!-- void BasicSurfaceEvaluator::bgnmap2f(long int) -->
        <function-decl name='bgnmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/internals/basicsurfeval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <!-- void BasicSurfaceEvaluator::map2f(long int, REAL, REAL, long int, long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map2f' mangled-name='_ZN21BasicSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/internals/basicsurfeval.cc' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <!-- void BasicSurfaceEvaluator::mapgrid2f(long int, REAL, REAL, long int, REAL, REAL) -->
        <function-decl name='mapgrid2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/internals/basicsurfeval.cc' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <!-- void BasicSurfaceEvaluator::mapmesh2f(long int, long int, long int, long int, long int) -->
        <function-decl name='mapmesh2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/internals/basicsurfeval.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <!-- void BasicSurfaceEvaluator::evalcoord2f(long int, REAL, REAL) -->
        <function-decl name='evalcoord2f' mangled-name='_ZN21BasicSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/internals/basicsurfeval.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <!-- void BasicSurfaceEvaluator::evalpoint2i(long int, long int) -->
        <function-decl name='evalpoint2i' mangled-name='_ZN21BasicSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/internals/basicsurfeval.cc' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <!-- void BasicSurfaceEvaluator::endmap2f() -->
        <function-decl name='endmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8endmap2fEv' filepath='libnurbs/internals/basicsurfeval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <!-- void BasicSurfaceEvaluator::polymode(long int) -->
        <function-decl name='polymode' mangled-name='_ZN21BasicSurfaceEvaluator8polymodeEl' filepath='libnurbs/internals/basicsurfeval.cc' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <!-- void BasicSurfaceEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN21BasicSurfaceEvaluator7bgnlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <!-- void BasicSurfaceEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN21BasicSurfaceEvaluator7endlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <!-- void BasicSurfaceEvaluator::bgnclosedline() -->
        <function-decl name='bgnclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <!-- void BasicSurfaceEvaluator::endclosedline() -->
        <function-decl name='endclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <!-- void BasicSurfaceEvaluator::bgntmesh() -->
        <function-decl name='bgntmesh' mangled-name='_ZN21BasicSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <!-- void BasicSurfaceEvaluator::swaptmesh() -->
        <function-decl name='swaptmesh' mangled-name='_ZN21BasicSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <!-- void BasicSurfaceEvaluator::endtmesh() -->
        <function-decl name='endtmesh' mangled-name='_ZN21BasicSurfaceEvaluator8endtmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <!-- void BasicSurfaceEvaluator::bgnqstrip() -->
        <function-decl name='bgnqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <!-- void BasicSurfaceEvaluator::endqstrip() -->
        <function-decl name='endqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9endqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <!-- void BasicSurfaceEvaluator::bgntfan() -->
        <function-decl name='bgntfan' mangled-name='_ZN21BasicSurfaceEvaluator7bgntfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <!-- void BasicSurfaceEvaluator::endtfan() -->
        <function-decl name='endtfan' mangled-name='_ZN21BasicSurfaceEvaluator7endtfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <!-- void BasicSurfaceEvaluator::evalUStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalUStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <!-- void BasicSurfaceEvaluator::evalVStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalVStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='34'>
        <!-- void BasicSurfaceEvaluator::inDoEvalCoord2NOGE(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN21BasicSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='35'>
        <!-- void BasicSurfaceEvaluator::inDoEvalCoord2NOGE_BU(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='36'>
        <!-- void BasicSurfaceEvaluator::inDoEvalCoord2NOGE_BV(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-22'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='37'>
        <!-- void BasicSurfaceEvaluator::inPreEvaluateBV_intfac(REAL) -->
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='38'>
        <!-- void BasicSurfaceEvaluator::inPreEvaluateBU_intfac(REAL) -->
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/insurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-106'/>
    <!-- char*[32] -->
    <array-type-def dimensions='1' type-id='type-id-107' size-in-bits='2048' id='type-id-108'>
      <!-- <anonymous range>[32] -->
      <subrange length='32' type-id='type-id-3' id='type-id-109'/>
    </array-type-def>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='type-id-110'/>
    <!-- typedef Arc* Arc_ptr -->
    <typedef-decl name='Arc_ptr' type-id='type-id-111' filepath='libnurbs/internals/arc.h' line='50' column='1' id='type-id-112'/>
    <!-- enum arc_side -->
    <enum-decl name='arc_side' filepath='libnurbs/internals/arc.h' line='52' column='1' id='type-id-113'>
      <underlying-type type-id='type-id-12'/>
      <enumerator name='arc_none' value='0'/>
      <enumerator name='arc_right' value='1'/>
      <enumerator name='arc_top' value='2'/>
      <enumerator name='arc_left' value='3'/>
      <enumerator name='arc_bottom' value='4'/>
    </enum-decl>
    <!-- struct Arc -->
    <class-decl name='Arc' size-in-bits='448' is-struct='yes' visibility='default' filepath='libnurbs/internals/arc.h' line='55' column='1' id='type-id-114'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-115'/>
      <data-member access='public' static='yes'>
        <!-- static const int Arc::bezier_tag -->
        <var-decl name='bezier_tag' type-id='type-id-116' mangled-name='_ZN3Arc10bezier_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static const int Arc::arc_tag -->
        <var-decl name='arc_tag' type-id='type-id-116' mangled-name='_ZN3Arc7arc_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static const int Arc::tail_tag -->
        <var-decl name='tail_tag' type-id='type-id-116' mangled-name='_ZN3Arc8tail_tagE' visibility='default' filepath='libnurbs/internals/arc.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Arc_ptr Arc::prev -->
        <var-decl name='prev' type-id='type-id-112' visibility='default' filepath='libnurbs/internals/arc.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Arc_ptr Arc::next -->
        <var-decl name='next' type-id='type-id-112' visibility='default' filepath='libnurbs/internals/arc.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Arc_ptr Arc::link -->
        <var-decl name='link' type-id='type-id-112' visibility='default' filepath='libnurbs/internals/arc.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- BezierArc* Arc::bezierArc -->
        <var-decl name='bezierArc' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/arc.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- PwlArc* Arc::pwlArc -->
        <var-decl name='pwlArc' type-id='type-id-118' visibility='default' filepath='libnurbs/internals/arc.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- long int Arc::type -->
        <var-decl name='type' type-id='type-id-38' visibility='default' filepath='libnurbs/internals/arc.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- long int Arc::nuid -->
        <var-decl name='nuid' type-id='type-id-38' visibility='default' filepath='libnurbs/internals/arc.h' line='67' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <!-- Arc::Arc(Arc*, PwlArc*) -->
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- parameter of type 'Arc*' -->
          <parameter type-id='type-id-111'/>
          <!-- parameter of type 'PwlArc*' -->
          <parameter type-id='type-id-118'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <!-- Arc::Arc(arc_side, long int) -->
        <function-decl name='Arc' filepath='libnurbs/internals/arc.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- parameter of type 'enum arc_side' -->
          <parameter type-id='type-id-113'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::clearside() -->
        <function-decl name='clearside' mangled-name='_ZN3Arc9clearsideEv' filepath='libnurbs/internals/arc.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::clearbezier() -->
        <function-decl name='clearbezier' mangled-name='_ZN3Arc11clearbezierEv' filepath='libnurbs/internals/arc.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::setside(arc_side) -->
        <function-decl name='setside' mangled-name='_ZN3Arc7setsideE8arc_side' filepath='libnurbs/internals/arc.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- parameter of type 'enum arc_side' -->
          <parameter type-id='type-id-113'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- REAL* Arc::tail() -->
        <function-decl name='tail' mangled-name='_ZN3Arc4tailEv' filepath='libnurbs/internals/arc.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- REAL* -->
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- REAL* Arc::rhead() -->
        <function-decl name='rhead' mangled-name='_ZN3Arc5rheadEv' filepath='libnurbs/internals/arc.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- REAL* -->
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::show() -->
        <function-decl name='show' mangled-name='_ZN3Arc4showEv' filepath='libnurbs/internals/arc.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- long int Arc::isbezier() -->
        <function-decl name='isbezier' mangled-name='_ZN3Arc8isbezierEv' filepath='libnurbs/internals/arc.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- long int -->
          <return type-id='type-id-38'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::makeSide(PwlArc*, arc_side) -->
        <function-decl name='makeSide' mangled-name='_ZN3Arc8makeSideEP6PwlArc8arc_side' filepath='libnurbs/internals/arc.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- parameter of type 'PwlArc*' -->
          <parameter type-id='type-id-118'/>
          <!-- parameter of type 'enum arc_side' -->
          <parameter type-id='type-id-113'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- int Arc::numpts() -->
        <function-decl name='numpts' mangled-name='_ZN3Arc6numptsEv' filepath='libnurbs/internals/arc.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::markverts() -->
        <function-decl name='markverts' mangled-name='_ZN3Arc9markvertsEv' filepath='libnurbs/internals/arc.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::getextrema(Arc_ptr*) -->
        <function-decl name='getextrema' mangled-name='_ZN3Arc10getextremaEPPS_' filepath='libnurbs/internals/arc.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- parameter of type 'Arc_ptr*' -->
          <parameter type-id='type-id-119'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::print() -->
        <function-decl name='print' mangled-name='_ZN3Arc5printEv' filepath='libnurbs/internals/arc.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- int Arc::isDisconnected() -->
        <function-decl name='isDisconnected' mangled-name='_ZN3Arc14isDisconnectedEv' filepath='libnurbs/internals/arc.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- int Arc::check() -->
        <function-decl name='check' mangled-name='_ZN3Arc5checkEv' filepath='libnurbs/internals/arc.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- Arc_ptr Arc::append(Arc_ptr) -->
        <function-decl name='append' mangled-name='_ZN3Arc6appendEPS_' filepath='libnurbs/internals/arc.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- parameter of type 'typedef Arc_ptr' -->
          <parameter type-id='type-id-112'/>
          <!-- typedef Arc_ptr -->
          <return type-id='type-id-112'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- int Arc::getitail() -->
        <function-decl name='getitail' mangled-name='_ZN3Arc8getitailEv' filepath='libnurbs/internals/arc.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- REAL* Arc::head() -->
        <function-decl name='head' mangled-name='_ZN3Arc4headEv' filepath='libnurbs/internals/arc.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- REAL* -->
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::setbezier() -->
        <function-decl name='setbezier' mangled-name='_ZN3Arc9setbezierEv' filepath='libnurbs/internals/arc.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::setmark() -->
        <function-decl name='setmark' mangled-name='_ZN3Arc7setmarkEv' filepath='libnurbs/internals/arc.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- long int Arc::ismarked() -->
        <function-decl name='ismarked' mangled-name='_ZN3Arc8ismarkedEv' filepath='libnurbs/internals/arc.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- long int -->
          <return type-id='type-id-38'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::clearmark() -->
        <function-decl name='clearmark' mangled-name='_ZN3Arc9clearmarkEv' filepath='libnurbs/internals/arc.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::setitail() -->
        <function-decl name='setitail' mangled-name='_ZN3Arc8setitailEv' filepath='libnurbs/internals/arc.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- void Arc::clearitail() -->
        <function-decl name='clearitail' mangled-name='_ZN3Arc10clearitailEv' filepath='libnurbs/internals/arc.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- arc_side Arc::getside() -->
        <function-decl name='getside' mangled-name='_ZN3Arc7getsideEv' filepath='libnurbs/internals/arc.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- enum arc_side -->
          <return type-id='type-id-113'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <!-- int Arc::isTessellated() -->
        <function-decl name='isTessellated' mangled-name='_ZN3Arc13isTessellatedEv' filepath='libnurbs/internals/arc.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Arc*' -->
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-8'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Buffer -->
    <class-decl name='Buffer' size-in-bits='64' visibility='default' filepath='libnurbs/internals/bufpool.h' line='45' column='1' id='type-id-120'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Buffer* Buffer::next -->
        <var-decl name='next' type-id='type-id-121' visibility='default' filepath='libnurbs/internals/bufpool.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Pool -->
    <class-decl name='Pool' size-in-bits='2496' visibility='default' filepath='libnurbs/internals/bufpool.h' line='50' column='1' id='type-id-67'>
      <member-type access='protected'>
        <!-- enum Pool::Magic -->
        <enum-decl name='Magic' filepath='libnurbs/internals/bufpool.h' line='70' column='1' id='type-id-122'>
          <underlying-type type-id='type-id-12'/>
          <enumerator name='is_allocated' value='62369'/>
          <enumerator name='is_free' value='61858'/>
        </enum-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <!-- Buffer* Pool::freelist -->
        <var-decl name='freelist' type-id='type-id-121' visibility='default' filepath='libnurbs/internals/bufpool.h' line='62' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <!-- char* Pool::blocklist[32] -->
        <var-decl name='blocklist' type-id='type-id-108' visibility='default' filepath='libnurbs/internals/bufpool.h' line='63' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2112'>
        <!-- int Pool::nextblock -->
        <var-decl name='nextblock' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='64' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2176'>
        <!-- char* Pool::curblock -->
        <var-decl name='curblock' type-id='type-id-107' visibility='default' filepath='libnurbs/internals/bufpool.h' line='65' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2240'>
        <!-- int Pool::buffersize -->
        <var-decl name='buffersize' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='66' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2272'>
        <!-- int Pool::nextsize -->
        <var-decl name='nextsize' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='67' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2304'>
        <!-- int Pool::nextfree -->
        <var-decl name='nextfree' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='68' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2336'>
        <!-- int Pool::initsize -->
        <var-decl name='initsize' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='69' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2368'>
        <!-- const char* Pool::name -->
        <var-decl name='name' type-id='type-id-84' visibility='default' filepath='libnurbs/internals/bufpool.h' line='71' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2432'>
        <!-- Pool::Magic Pool::magic -->
        <var-decl name='magic' type-id='type-id-122' visibility='default' filepath='libnurbs/internals/bufpool.h' line='72' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- Pool::Pool(int, int, const char*) -->
        <function-decl name='Pool' filepath='libnurbs/internals/bufpool.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Pool*' -->
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-84'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- Pool::~Pool(int) -->
        <function-decl name='~Pool' filepath='libnurbs/internals/bufpool.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Pool*' -->
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-8' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void* Pool::new_buffer() -->
        <function-decl name='new_buffer' mangled-name='_ZN4Pool10new_bufferEv' filepath='libnurbs/internals/bufpool.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Pool*' -->
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <!-- void* -->
          <return type-id='type-id-35'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void Pool::clear() -->
        <function-decl name='clear' mangled-name='_ZN4Pool5clearEv' filepath='libnurbs/internals/bufpool.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Pool*' -->
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void Pool::grow() -->
        <function-decl name='grow' mangled-name='_ZN4Pool4growEv' filepath='libnurbs/internals/bufpool.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Pool*' -->
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void Pool::free_buffer(void*) -->
        <function-decl name='free_buffer' mangled-name='_ZN4Pool11free_bufferEPv' filepath='libnurbs/internals/bufpool.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'Pool*' -->
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class PooledObj -->
    <class-decl name='PooledObj' size-in-bits='8' visibility='default' filepath='libnurbs/internals/bufpool.h' line='118' column='1' id='type-id-115'>
      <member-function access='private' static='yes'>
        <!-- void PooledObj::operator delete(Pool&) -->
        <function-decl name='operator delete' mangled-name='_ZN9PooledObjdlEPvR4Pool' filepath='libnurbs/internals/bufpool.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-35'/>
          <!-- parameter of type 'Pool&' -->
          <parameter type-id='type-id-124'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void* PooledObj::operator new(Pool&) -->
        <function-decl name='operator new' mangled-name='_ZN9PooledObjnwEmR4Pool' filepath='libnurbs/internals/bufpool.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-110'/>
          <!-- parameter of type 'Pool&' -->
          <parameter type-id='type-id-124'/>
          <!-- void* -->
          <return type-id='type-id-35'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void PooledObj::deleteMe(Pool&) -->
        <function-decl name='deleteMe' mangled-name='_ZN9PooledObj8deleteMeER4Pool' filepath='libnurbs/internals/bufpool.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'PooledObj*' -->
          <parameter type-id='type-id-125' is-artificial='yes'/>
          <!-- parameter of type 'Pool&' -->
          <parameter type-id='type-id-124'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class PwlArc -->
    <class-decl name='PwlArc' size-in-bits='192' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='44' column='1' id='type-id-126'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-115'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- TrimVertex* PwlArc::pts -->
        <var-decl name='pts' type-id='type-id-127' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- int PwlArc::npts -->
        <var-decl name='npts' type-id='type-id-8' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- long int PwlArc::type -->
        <var-decl name='type' type-id='type-id-38' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='48' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <!-- PwlArc::PwlArc() -->
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'PwlArc*' -->
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- PwlArc::PwlArc(int, TrimVertex*) -->
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'PwlArc*' -->
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'TrimVertex*' -->
          <parameter type-id='type-id-127'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- PwlArc::PwlArc(int, TrimVertex*, long int) -->
        <function-decl name='PwlArc' filepath='libnurbs/internals/pwlarc.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <!-- implicit parameter of type 'PwlArc*' -->
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-8'/>
          <!-- parameter of type 'TrimVertex*' -->
          <parameter type-id='type-id-127'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-38'/>
          <!-- void -->
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct TrimVertex -->
    <class-decl name='TrimVertex' size-in-bits='128' is-struct='yes' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='43' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL TrimVertex::param[2] -->
        <var-decl name='param' type-id='type-id-88' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- long int TrimVertex::nuid -->
        <var-decl name='nuid' type-id='type-id-38' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- Arc* -->
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-111'/>
    <!-- Arc_ptr* -->
