{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",

   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/IComposerCallback.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer315IComposerClientE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::graphics::composer3::IComposerClient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware8graphics9composer315IComposerClientE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient11createLayerExiPx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient20createVirtualDisplayEiiNS2_6common11PixelFormatEiPNS3_14VirtualDisplayE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12destroyLayerExx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21destroyVirtualDisplayEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15executeCommandsERKNSt3__16vectorINS3_14DisplayCommandENS5_9allocatorIS7_EEEEPNS6_INS3_20CommandResultPayloadENS8_ISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15getActiveConfigExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient13getColorModesExPNSt3__16vectorINS3_9ColorModeENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient28getDataspaceSaturationMatrixENS2_6common9DataspaceEPNSt3__16vectorIfNS7_9allocatorIfEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19getDisplayAttributeExiNS3_16DisplayAttributeEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22getDisplayCapabilitiesExPNSt3__16vectorINS3_17DisplayCapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient17getDisplayConfigsExPNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24getDisplayConnectionTypeExPNS3_21DisplayConnectionTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient28getDisplayIdentificationDataExPNS3_21DisplayIdentificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient14getDisplayNameExPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21getDisplayVsyncPeriodExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient25getDisplayedContentSampleExxxPNS3_20DisplayContentSampleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient37getDisplayedContentSamplingAttributesExPNS3_32DisplayContentSamplingAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient29getDisplayPhysicalOrientationExPNS2_6common9TransformE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient18getHdrCapabilitiesExPNS3_15HdrCapabilitiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient25getMaxVirtualDisplayCountEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient23getPerFrameMetadataKeysExPNSt3__16vectorINS3_19PerFrameMetadataKeyENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient27getReadbackBufferAttributesExPNS3_24ReadbackBufferAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22getReadbackBufferFenceExPN3ndk20ScopedFileDescriptorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16getRenderIntentsExNS3_9ColorModeEPNSt3__16vectorINS3_12RenderIntentENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24getSupportedContentTypesExPNSt3__16vectorINS3_11ContentTypeENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient27getDisplayDecorationSupportExPNSt3__18optionalINS2_6common24DisplayDecorationSupportEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16registerCallbackERKNSt3__110shared_ptrINS3_17IComposerCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15setActiveConfigExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient30setActiveConfigWithConstraintsExiRKNS3_28VsyncPeriodChangeConstraintsEPNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient20setBootDisplayConfigExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22clearBootDisplayConfigEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient29getPreferredBootDisplayConfigExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21setAutoLowLatencyModeExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24setClientTargetSlotCountExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12setColorModeExNS3_9ColorModeENS3_12RenderIntentE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient14setContentTypeExNS3_11ContentTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient34setDisplayedContentSamplingEnabledExbNS3_20FormatColorComponentEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12setPowerModeExNS3_9PowerModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient17setReadbackBufferExRKNS1_6common12NativeHandleERKN3ndk20ScopedFileDescriptorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15setVsyncEnabledExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19setIdleTimerEnabledExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer317IComposerCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::graphics::composer3::IComposerCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware8graphics9composer317IComposerCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback9onHotplugExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback9onRefreshEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback18onSeamlessPossibleEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback7onVsyncExxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback26onVsyncPeriodTimingChangedExRKNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback11onVsyncIdleEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer39IComposerE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::graphics::composer3::IComposer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware8graphics9composer39IComposerE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer12createClientEPNSt3__110shared_ptrINS3_15IComposerClientEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer15getCapabilitiesEPNSt3__16vectorINS3_10CapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer315IComposerClientE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::graphics::composer3::IComposerClient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware8graphics9composer315IComposerClientE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient11createLayerExiPx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient20createVirtualDisplayEiiNS2_6common11PixelFormatEiPNS3_14VirtualDisplayE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12destroyLayerExx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21destroyVirtualDisplayEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15executeCommandsERKNSt3__16vectorINS3_14DisplayCommandENS5_9allocatorIS7_EEEEPNS6_INS3_20CommandResultPayloadENS8_ISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15getActiveConfigExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient13getColorModesExPNSt3__16vectorINS3_9ColorModeENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient28getDataspaceSaturationMatrixENS2_6common9DataspaceEPNSt3__16vectorIfNS7_9allocatorIfEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19getDisplayAttributeExiNS3_16DisplayAttributeEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22getDisplayCapabilitiesExPNSt3__16vectorINS3_17DisplayCapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient17getDisplayConfigsExPNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24getDisplayConnectionTypeExPNS3_21DisplayConnectionTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient28getDisplayIdentificationDataExPNS3_21DisplayIdentificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient14getDisplayNameExPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21getDisplayVsyncPeriodExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient25getDisplayedContentSampleExxxPNS3_20DisplayContentSampleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient37getDisplayedContentSamplingAttributesExPNS3_32DisplayContentSamplingAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient29getDisplayPhysicalOrientationExPNS2_6common9TransformE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient18getHdrCapabilitiesExPNS3_15HdrCapabilitiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient25getMaxVirtualDisplayCountEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient23getPerFrameMetadataKeysExPNSt3__16vectorINS3_19PerFrameMetadataKeyENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient27getReadbackBufferAttributesExPNS3_24ReadbackBufferAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22getReadbackBufferFenceExPN3ndk20ScopedFileDescriptorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16getRenderIntentsExNS3_9ColorModeEPNSt3__16vectorINS3_12RenderIntentENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24getSupportedContentTypesExPNSt3__16vectorINS3_11ContentTypeENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient27getDisplayDecorationSupportExPNSt3__18optionalINS2_6common24DisplayDecorationSupportEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16registerCallbackERKNSt3__110shared_ptrINS3_17IComposerCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15setActiveConfigExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient30setActiveConfigWithConstraintsExiRKNS3_28VsyncPeriodChangeConstraintsEPNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient20setBootDisplayConfigExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22clearBootDisplayConfigEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient29getPreferredBootDisplayConfigExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21setAutoLowLatencyModeExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24setClientTargetSlotCountExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12setColorModeExNS3_9ColorModeENS3_12RenderIntentE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient14setContentTypeExNS3_11ContentTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient34setDisplayedContentSamplingEnabledExbNS3_20FormatColorComponentEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12setPowerModeExNS3_9PowerModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient17setReadbackBufferExRKNS1_6common12NativeHandleERKN3ndk20ScopedFileDescriptorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15setVsyncEnabledExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19setIdleTimerEnabledExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer317IComposerCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::graphics::composer3::IComposerCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware8graphics9composer317IComposerCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback9onHotplugExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback9onRefreshEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback18onSeamlessPossibleEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback7onVsyncExxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback26onVsyncPeriodTimingChangedExRKNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback11onVsyncIdleEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer39IComposerE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::graphics::composer3::IComposer>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware8graphics9composer39IComposerE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer12createClientEPNSt3__110shared_ptrINS3_15IComposerClientEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer15getCapabilitiesEPNSt3__16vectorINS3_10CapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds",
     "referenced_type" : "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE"
    },
    {
     "field_name" : "ints",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "name" : "aidl::android::hardware::common::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "self_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/aidl/android.hardware.common-V2-ndk-source/gen/include/aidl/android/hardware/common/NativeHandle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PixelFormatE"
    },
    {
     "field_name" : "alphaInterpretation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common19AlphaInterpretationE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common24DisplayDecorationSupportE",
   "name" : "aidl::android::hardware::graphics::common::DisplayDecorationSupport",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common24DisplayDecorationSupportE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common24DisplayDecorationSupportE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-V3-ndk-source/gen/include/aidl/android/hardware/graphics/common/DisplayDecorationSupport.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common4RectE",
   "name" : "aidl::android::hardware::graphics::common::Rect",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common4RectE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common4RectE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-V3-ndk-source/gen/include/aidl/android/hardware/graphics/common/Rect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common5FRectE",
   "name" : "aidl::android::hardware::graphics::common::FRect",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common5FRectE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common5FRectE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-V3-ndk-source/gen/include/aidl/android/hardware/graphics/common/FRect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics6common5PointE",
   "name" : "aidl::android::hardware::graphics::common::Point",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common5PointE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics6common5PointE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/common/aidl/android.hardware.graphics.common-V3-ndk-source/gen/include/aidl/android/hardware/graphics/common/Point.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer310BnComposerE",
   "name" : "aidl::android::hardware::graphics::composer3::BnComposer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer310BnComposerE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer310BnComposerE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/BnComposer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer310BnComposerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BnComposerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BnComposerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer12createClientEPNSt3__110shared_ptrINS3_15IComposerClientEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer15getCapabilitiesEPNSt3__16vectorINS3_10CapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BnComposer19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BnComposer16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BnComposer12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer310BpComposerE",
   "name" : "aidl::android::hardware::graphics::composer3::BpComposer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer310BpComposerE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer310BpComposerE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/BpComposer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer310BpComposerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BpComposerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BpComposerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BpComposer12createClientEPNSt3__110shared_ptrINS3_15IComposerClientEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BpComposer15getCapabilitiesEPNSt3__16vectorINS3_10CapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BpComposer19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BpComposer16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alpha",
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer310PlaneAlphaE",
   "name" : "aidl::android::hardware::graphics::composer3::PlaneAlpha",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer310PlaneAlphaE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer310PlaneAlphaE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/PlaneAlpha.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer36BufferE"
    },
    {
     "field_name" : "dataspace",
     "field_offset" : 288,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9DataspaceE"
    },
    {
     "field_name" : "damage",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware8graphics6common4RectENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer312ClientTargetE",
   "name" : "aidl::android::hardware::graphics::composer3::ClientTarget",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer312ClientTargetE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer312ClientTargetE",
   "size" : 52,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ClientTarget.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "commandIndex",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "errorCode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer312CommandErrorE",
   "name" : "aidl::android::hardware::graphics::composer3::CommandError",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer312CommandErrorE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer312CommandErrorE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/CommandError.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layer",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "cursorPosition",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics6common5PointEEE"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer36BufferEEE"
    },
    {
     "field_name" : "damage",
     "field_offset" : 480,
     "referenced_type" : "_ZTINSt3__18optionalINS_6vectorINS0_IN4aidl7android8hardware8graphics6common4RectEEENS_9allocatorIS8_EEEEEE"
    },
    {
     "field_name" : "blendMode",
     "field_offset" : 608,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer319ParcelableBlendModeEEE"
    },
    {
     "field_name" : "color",
     "field_offset" : 672,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer35ColorEEE"
    },
    {
     "field_name" : "composition",
     "field_offset" : 832,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer321ParcelableCompositionEEE"
    },
    {
     "field_name" : "dataspace",
     "field_offset" : 896,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer319ParcelableDataspaceEEE"
    },
    {
     "field_name" : "displayFrame",
     "field_offset" : 960,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics6common4RectEEE"
    },
    {
     "field_name" : "planeAlpha",
     "field_offset" : 1120,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer310PlaneAlphaEEE"
    },
    {
     "field_name" : "sidebandStream",
     "field_offset" : 1184,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware6common12NativeHandleEEE"
    },
    {
     "field_name" : "sourceCrop",
     "field_offset" : 1408,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics6common5FRectEEE"
    },
    {
     "field_name" : "transform",
     "field_offset" : 1568,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer319ParcelableTransformEEE"
    },
    {
     "field_name" : "visibleRegion",
     "field_offset" : 1632,
     "referenced_type" : "_ZTINSt3__18optionalINS_6vectorINS0_IN4aidl7android8hardware8graphics6common4RectEEENS_9allocatorIS8_EEEEEE"
    },
    {
     "field_name" : "z",
     "field_offset" : 1760,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer36ZOrderEEE"
    },
    {
     "field_name" : "colorTransform",
     "field_offset" : 1824,
     "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIfNS_9allocatorIfEEEEEE"
    },
    {
     "field_name" : "brightness",
     "field_offset" : 1952,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer315LayerBrightnessEEE"
    },
    {
     "field_name" : "perFrameMetadata",
     "field_offset" : 2016,
     "referenced_type" : "_ZTINSt3__18optionalINS_6vectorINS0_IN4aidl7android8hardware8graphics9composer316PerFrameMetadataEEENS_9allocatorIS8_EEEEEE"
    },
    {
     "field_name" : "perFrameMetadataBlob",
     "field_offset" : 2144,
     "referenced_type" : "_ZTINSt3__18optionalINS_6vectorINS0_IN4aidl7android8hardware8graphics9composer320PerFrameMetadataBlobEEENS_9allocatorIS8_EEEEEE"
    },
    {
     "field_name" : "blockingRegion",
     "field_offset" : 2272,
     "referenced_type" : "_ZTINSt3__18optionalINS_6vectorINS0_IN4aidl7android8hardware8graphics6common4RectEEENS_9allocatorIS8_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer312LayerCommandE",
   "name" : "aidl::android::hardware::graphics::composer3::LayerCommand",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer312LayerCommandE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer312LayerCommandE",
   "size" : 300,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/LayerCommand.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "fence",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer312PresentFenceE",
   "name" : "aidl::android::hardware::graphics::composer3::PresentFence",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer312PresentFenceE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer312PresentFenceE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/PresentFence.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layer",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "fence",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer313ReleaseFences5LayerE",
   "name" : "aidl::android::hardware::graphics::composer3::ReleaseFences::Layer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer313ReleaseFences5LayerE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer313ReleaseFences5LayerE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ReleaseFences.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware8graphics9composer313ReleaseFences5LayerENS_9allocatorIS7_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer313ReleaseFencesE",
   "name" : "aidl::android::hardware::graphics::composer3::ReleaseFences",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer313ReleaseFencesE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer313ReleaseFencesE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ReleaseFences.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware8graphics9composer312LayerCommandENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "colorTransformMatrix",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIfNS_9allocatorIfEEEEEE"
    },
    {
     "field_name" : "brightness",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer317DisplayBrightnessEEE"
    },
    {
     "field_name" : "clientTarget",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer312ClientTargetEEE"
    },
    {
     "field_name" : "virtualDisplayOutputBuffer",
     "field_offset" : 832,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer36BufferEEE"
    },
    {
     "field_name" : "expectedPresentTime",
     "field_offset" : 1152,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware8graphics9composer323ClockMonotonicTimestampEEE"
    },
    {
     "field_name" : "validateDisplay",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "acceptDisplayChanges",
     "field_offset" : 1256,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "presentDisplay",
     "field_offset" : 1264,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "presentOrValidateDisplay",
     "field_offset" : 1272,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer314DisplayCommandE",
   "name" : "aidl::android::hardware::graphics::composer3::DisplayCommand",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer314DisplayCommandE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer314DisplayCommandE",
   "size" : 160,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/DisplayCommand.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layer",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer314DisplayRequest12LayerRequestE",
   "name" : "aidl::android::hardware::graphics::composer3::DisplayRequest::LayerRequest",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer314DisplayRequest12LayerRequestE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer314DisplayRequest12LayerRequestE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/DisplayRequest.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "layerRequests",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware8graphics9composer314DisplayRequest12LayerRequestENS_9allocatorIS7_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer314DisplayRequestE",
   "name" : "aidl::android::hardware::graphics::composer3::DisplayRequest",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer314DisplayRequestE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer314DisplayRequestE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/DisplayRequest.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PixelFormatE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer314VirtualDisplayE",
   "name" : "aidl::android::hardware::graphics::composer3::VirtualDisplay",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer314VirtualDisplayE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer314VirtualDisplayE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/VirtualDisplay.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "types",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware8graphics6common3HdrENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxAverageLuminance",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer315HdrCapabilitiesE",
   "name" : "aidl::android::hardware::graphics::composer3::HdrCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer315HdrCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer315HdrCapabilitiesE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/HdrCapabilities.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer315IComposerClientE",
   "name" : "aidl::android::hardware::graphics::composer3::IComposerClient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer315IComposerClientE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer315IComposerClientE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/IComposerClient.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer315IComposerClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClientD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient11createLayerExiPx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient20createVirtualDisplayEiiNS2_6common11PixelFormatEiPNS3_14VirtualDisplayE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12destroyLayerExx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21destroyVirtualDisplayEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15executeCommandsERKNSt3__16vectorINS3_14DisplayCommandENS5_9allocatorIS7_EEEEPNS6_INS3_20CommandResultPayloadENS8_ISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15getActiveConfigExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient13getColorModesExPNSt3__16vectorINS3_9ColorModeENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient28getDataspaceSaturationMatrixENS2_6common9DataspaceEPNSt3__16vectorIfNS7_9allocatorIfEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19getDisplayAttributeExiNS3_16DisplayAttributeEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22getDisplayCapabilitiesExPNSt3__16vectorINS3_17DisplayCapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient17getDisplayConfigsExPNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24getDisplayConnectionTypeExPNS3_21DisplayConnectionTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient28getDisplayIdentificationDataExPNS3_21DisplayIdentificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient14getDisplayNameExPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21getDisplayVsyncPeriodExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient25getDisplayedContentSampleExxxPNS3_20DisplayContentSampleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient37getDisplayedContentSamplingAttributesExPNS3_32DisplayContentSamplingAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient29getDisplayPhysicalOrientationExPNS2_6common9TransformE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient18getHdrCapabilitiesExPNS3_15HdrCapabilitiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient25getMaxVirtualDisplayCountEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient23getPerFrameMetadataKeysExPNSt3__16vectorINS3_19PerFrameMetadataKeyENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient27getReadbackBufferAttributesExPNS3_24ReadbackBufferAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22getReadbackBufferFenceExPN3ndk20ScopedFileDescriptorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16getRenderIntentsExNS3_9ColorModeEPNSt3__16vectorINS3_12RenderIntentENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24getSupportedContentTypesExPNSt3__16vectorINS3_11ContentTypeENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient27getDisplayDecorationSupportExPNSt3__18optionalINS2_6common24DisplayDecorationSupportEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16registerCallbackERKNSt3__110shared_ptrINS3_17IComposerCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15setActiveConfigExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient30setActiveConfigWithConstraintsExiRKNS3_28VsyncPeriodChangeConstraintsEPNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient20setBootDisplayConfigExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22clearBootDisplayConfigEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient29getPreferredBootDisplayConfigExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21setAutoLowLatencyModeExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24setClientTargetSlotCountExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12setColorModeExNS3_9ColorModeENS3_12RenderIntentE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient14setContentTypeExNS3_11ContentTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient34setDisplayedContentSamplingEnabledExbNS3_20FormatColorComponentEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12setPowerModeExNS3_9PowerModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient17setReadbackBufferExRKNS1_6common12NativeHandleERKN3ndk20ScopedFileDescriptorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15setVsyncEnabledExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19setIdleTimerEnabledExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "brightness",
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer315LayerBrightnessE",
   "name" : "aidl::android::hardware::graphics::composer3::LayerBrightness",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer315LayerBrightnessE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer315LayerBrightnessE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/LayerBrightness.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer316BnComposerClientE",
   "name" : "aidl::android::hardware::graphics::composer3::BnComposerClient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer316BnComposerClientE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer316BnComposerClientE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/BnComposerClient.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer316BnComposerClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BnComposerClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BnComposerClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient11createLayerExiPx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient20createVirtualDisplayEiiNS2_6common11PixelFormatEiPNS3_14VirtualDisplayE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12destroyLayerExx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21destroyVirtualDisplayEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15executeCommandsERKNSt3__16vectorINS3_14DisplayCommandENS5_9allocatorIS7_EEEEPNS6_INS3_20CommandResultPayloadENS8_ISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15getActiveConfigExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient13getColorModesExPNSt3__16vectorINS3_9ColorModeENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient28getDataspaceSaturationMatrixENS2_6common9DataspaceEPNSt3__16vectorIfNS7_9allocatorIfEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19getDisplayAttributeExiNS3_16DisplayAttributeEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22getDisplayCapabilitiesExPNSt3__16vectorINS3_17DisplayCapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient17getDisplayConfigsExPNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24getDisplayConnectionTypeExPNS3_21DisplayConnectionTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient28getDisplayIdentificationDataExPNS3_21DisplayIdentificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient14getDisplayNameExPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21getDisplayVsyncPeriodExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient25getDisplayedContentSampleExxxPNS3_20DisplayContentSampleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient37getDisplayedContentSamplingAttributesExPNS3_32DisplayContentSamplingAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient29getDisplayPhysicalOrientationExPNS2_6common9TransformE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient18getHdrCapabilitiesExPNS3_15HdrCapabilitiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient25getMaxVirtualDisplayCountEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient23getPerFrameMetadataKeysExPNSt3__16vectorINS3_19PerFrameMetadataKeyENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient27getReadbackBufferAttributesExPNS3_24ReadbackBufferAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22getReadbackBufferFenceExPN3ndk20ScopedFileDescriptorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16getRenderIntentsExNS3_9ColorModeEPNSt3__16vectorINS3_12RenderIntentENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24getSupportedContentTypesExPNSt3__16vectorINS3_11ContentTypeENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient27getDisplayDecorationSupportExPNSt3__18optionalINS2_6common24DisplayDecorationSupportEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient16registerCallbackERKNSt3__110shared_ptrINS3_17IComposerCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15setActiveConfigExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient30setActiveConfigWithConstraintsExiRKNS3_28VsyncPeriodChangeConstraintsEPNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient20setBootDisplayConfigExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient22clearBootDisplayConfigEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient29getPreferredBootDisplayConfigExPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient21setAutoLowLatencyModeExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient24setClientTargetSlotCountExi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12setColorModeExNS3_9ColorModeENS3_12RenderIntentE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient14setContentTypeExNS3_11ContentTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient34setDisplayedContentSamplingEnabledExbNS3_20FormatColorComponentEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient12setPowerModeExNS3_9PowerModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient17setReadbackBufferExRKNS1_6common12NativeHandleERKN3ndk20ScopedFileDescriptorE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient15setVsyncEnabledExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer315IComposerClient19setIdleTimerEnabledExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BnComposerClient19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BnComposerClient16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BnComposerClient12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer316BpComposerClientE",
   "name" : "aidl::android::hardware::graphics::composer3::BpComposerClient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer316BpComposerClientE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer316BpComposerClientE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/BpComposerClient.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer316BpComposerClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient11createLayerExiPx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient20createVirtualDisplayEiiNS2_6common11PixelFormatEiPNS3_14VirtualDisplayE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient12destroyLayerExx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient21destroyVirtualDisplayEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient15executeCommandsERKNSt3__16vectorINS3_14DisplayCommandENS5_9allocatorIS7_EEEEPNS6_INS3_20CommandResultPayloadENS8_ISD_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient15getActiveConfigExPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient13getColorModesExPNSt3__16vectorINS3_9ColorModeENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient28getDataspaceSaturationMatrixENS2_6common9DataspaceEPNSt3__16vectorIfNS7_9allocatorIfEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient19getDisplayAttributeExiNS3_16DisplayAttributeEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient22getDisplayCapabilitiesExPNSt3__16vectorINS3_17DisplayCapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient17getDisplayConfigsExPNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient24getDisplayConnectionTypeExPNS3_21DisplayConnectionTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient28getDisplayIdentificationDataExPNS3_21DisplayIdentificationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient14getDisplayNameExPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient21getDisplayVsyncPeriodExPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient25getDisplayedContentSampleExxxPNS3_20DisplayContentSampleE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient37getDisplayedContentSamplingAttributesExPNS3_32DisplayContentSamplingAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient29getDisplayPhysicalOrientationExPNS2_6common9TransformE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient18getHdrCapabilitiesExPNS3_15HdrCapabilitiesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient25getMaxVirtualDisplayCountEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient23getPerFrameMetadataKeysExPNSt3__16vectorINS3_19PerFrameMetadataKeyENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient27getReadbackBufferAttributesExPNS3_24ReadbackBufferAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient22getReadbackBufferFenceExPN3ndk20ScopedFileDescriptorE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient16getRenderIntentsExNS3_9ColorModeEPNSt3__16vectorINS3_12RenderIntentENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient24getSupportedContentTypesExPNSt3__16vectorINS3_11ContentTypeENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient27getDisplayDecorationSupportExPNSt3__18optionalINS2_6common24DisplayDecorationSupportEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient16registerCallbackERKNSt3__110shared_ptrINS3_17IComposerCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient15setActiveConfigExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient30setActiveConfigWithConstraintsExiRKNS3_28VsyncPeriodChangeConstraintsEPNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient20setBootDisplayConfigExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient22clearBootDisplayConfigEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient29getPreferredBootDisplayConfigExPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient21setAutoLowLatencyModeExb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient24setClientTargetSlotCountExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient12setColorModeExNS3_9ColorModeENS3_12RenderIntentE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient14setContentTypeExNS3_11ContentTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient34setDisplayedContentSamplingEnabledExbNS3_20FormatColorComponentEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient12setPowerModeExNS3_9PowerModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient17setReadbackBufferExRKNS1_6common12NativeHandleERKN3ndk20ScopedFileDescriptorE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient15setVsyncEnabledExb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient19setIdleTimerEnabledExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BpComposerClient16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer39IComposerE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer316IComposerDefaultE",
   "name" : "aidl::android::hardware::graphics::composer3::IComposerDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer316IComposerDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer316IComposerDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/IComposer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer316IComposerDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316IComposerDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316IComposerDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316IComposerDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316IComposerDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316IComposerDefault12createClientEPNSt3__110shared_ptrINS3_15IComposerClientEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316IComposerDefault15getCapabilitiesEPNSt3__16vectorINS3_10CapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316IComposerDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316IComposerDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer319PerFrameMetadataKeyE"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer316PerFrameMetadataE",
   "name" : "aidl::android::hardware::graphics::composer3::PerFrameMetadata",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer316PerFrameMetadataE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer316PerFrameMetadataE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/PerFrameMetadata.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "brightness",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "brightnessNits",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer317DisplayBrightnessE",
   "name" : "aidl::android::hardware::graphics::composer3::DisplayBrightness",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer317DisplayBrightnessE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer317DisplayBrightnessE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/DisplayBrightness.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer317IComposerCallbackE",
   "name" : "aidl::android::hardware::graphics::composer3::IComposerCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer317IComposerCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer317IComposerCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/IComposerCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer317IComposerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback9onHotplugExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback9onRefreshEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback18onSeamlessPossibleEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback7onVsyncExxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback26onVsyncPeriodTimingChangedExRKNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback11onVsyncIdleEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "result",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer317PresentOrValidate6ResultE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer317PresentOrValidateE",
   "name" : "aidl::android::hardware::graphics::composer3::PresentOrValidate",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer317PresentOrValidateE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer317PresentOrValidateE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/PresentOrValidate.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer318BnComposerCallbackE",
   "name" : "aidl::android::hardware::graphics::composer3::BnComposerCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer318BnComposerCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer318BnComposerCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/BnComposerCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer318BnComposerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BnComposerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BnComposerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback9onHotplugExb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback9onRefreshEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback18onSeamlessPossibleEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback7onVsyncExxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback26onVsyncPeriodTimingChangedExRKNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer317IComposerCallback11onVsyncIdleEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BnComposerCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BnComposerCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BnComposerCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer318BpComposerCallbackE",
   "name" : "aidl::android::hardware::graphics::composer3::BpComposerCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer318BpComposerCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer318BpComposerCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/BpComposerCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer318BpComposerCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallback9onHotplugExb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallback9onRefreshEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallback18onSeamlessPossibleEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallback7onVsyncExxi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallback26onVsyncPeriodTimingChangedExRKNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallback11onVsyncIdleEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BpComposerCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer310BnComposerE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware8graphics9composer39IComposerEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer318IComposerDelegatorE",
   "name" : "aidl::android::hardware::graphics::composer3::IComposerDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer318IComposerDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer318IComposerDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/BnComposer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer318IComposerDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318IComposerDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318IComposerDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer39IComposerEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318IComposerDelegator12createClientEPNSt3__110shared_ptrINS3_15IComposerClientEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318IComposerDelegator15getCapabilitiesEPNSt3__16vectorINS3_10CapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BnComposer19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BnComposer16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer310BnComposer12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "blendMode",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9BlendModeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer319ParcelableBlendModeE",
   "name" : "aidl::android::hardware::graphics::composer3::ParcelableBlendMode",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer319ParcelableBlendModeE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer319ParcelableBlendModeE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ParcelableBlendMode.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dataspace",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9DataspaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer319ParcelableDataspaceE",
   "name" : "aidl::android::hardware::graphics::composer3::ParcelableDataspace",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer319ParcelableDataspaceE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer319ParcelableDataspaceE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ParcelableDataspace.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "transform",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9TransformE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer319ParcelableTransformE",
   "name" : "aidl::android::hardware::graphics::composer3::ParcelableTransform",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer319ParcelableTransformE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer319ParcelableTransformE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ParcelableTransform.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pixelFormat",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PixelFormatE"
    },
    {
     "field_name" : "dataspace",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9DataspaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer320ClientTargetPropertyE",
   "name" : "aidl::android::hardware::graphics::composer3::ClientTargetProperty",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer320ClientTargetPropertyE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer320ClientTargetPropertyE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ClientTargetProperty.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware8graphics9composer312CommandErrorENS5_23ChangedCompositionTypesENS5_14DisplayRequestENS5_12PresentFenceENS5_13ReleaseFencesENS5_17PresentOrValidateENS5_34ClientTargetPropertyWithBrightnessEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer320CommandResultPayloadE",
   "name" : "aidl::android::hardware::graphics::composer3::CommandResultPayload",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer320CommandResultPayloadE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer320CommandResultPayloadE",
   "size" : 28,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/CommandResultPayload.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "frameCount",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "sampleComponent0",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIxNS_9allocatorIxEEEE"
    },
    {
     "field_name" : "sampleComponent1",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__16vectorIxNS_9allocatorIxEEEE"
    },
    {
     "field_name" : "sampleComponent2",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIxNS_9allocatorIxEEEE"
    },
    {
     "field_name" : "sampleComponent3",
     "field_offset" : 352,
     "referenced_type" : "_ZTINSt3__16vectorIxNS_9allocatorIxEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer320DisplayContentSampleE",
   "name" : "aidl::android::hardware::graphics::composer3::DisplayContentSample",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer320DisplayContentSampleE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer320DisplayContentSampleE",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/DisplayContentSample.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer319PerFrameMetadataKeyE"
    },
    {
     "field_name" : "blob",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer320PerFrameMetadataBlobE",
   "name" : "aidl::android::hardware::graphics::composer3::PerFrameMetadataBlob",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer320PerFrameMetadataBlobE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer320PerFrameMetadataBlobE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/PerFrameMetadataBlob.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "port",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer321DisplayIdentificationE",
   "name" : "aidl::android::hardware::graphics::composer3::DisplayIdentification",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer321DisplayIdentificationE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer321DisplayIdentificationE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/DisplayIdentification.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "composition",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer311CompositionE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer321ParcelableCompositionE",
   "name" : "aidl::android::hardware::graphics::composer3::ParcelableComposition",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer321ParcelableCompositionE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer321ParcelableCompositionE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ParcelableComposition.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer315IComposerClientE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer322IComposerClientDefaultE",
   "name" : "aidl::android::hardware::graphics::composer3::IComposerClientDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer322IComposerClientDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer322IComposerClientDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/IComposerClient.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer322IComposerClientDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault11createLayerExiPx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault20createVirtualDisplayEiiNS2_6common11PixelFormatEiPNS3_14VirtualDisplayE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault12destroyLayerExx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault21destroyVirtualDisplayEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault15executeCommandsERKNSt3__16vectorINS3_14DisplayCommandENS5_9allocatorIS7_EEEEPNS6_INS3_20CommandResultPayloadENS8_ISD_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault15getActiveConfigExPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault13getColorModesExPNSt3__16vectorINS3_9ColorModeENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault28getDataspaceSaturationMatrixENS2_6common9DataspaceEPNSt3__16vectorIfNS7_9allocatorIfEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault19getDisplayAttributeExiNS3_16DisplayAttributeEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault22getDisplayCapabilitiesExPNSt3__16vectorINS3_17DisplayCapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault17getDisplayConfigsExPNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault24getDisplayConnectionTypeExPNS3_21DisplayConnectionTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault28getDisplayIdentificationDataExPNS3_21DisplayIdentificationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault14getDisplayNameExPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault21getDisplayVsyncPeriodExPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault25getDisplayedContentSampleExxxPNS3_20DisplayContentSampleE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault37getDisplayedContentSamplingAttributesExPNS3_32DisplayContentSamplingAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault29getDisplayPhysicalOrientationExPNS2_6common9TransformE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault18getHdrCapabilitiesExPNS3_15HdrCapabilitiesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault25getMaxVirtualDisplayCountEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault23getPerFrameMetadataKeysExPNSt3__16vectorINS3_19PerFrameMetadataKeyENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault27getReadbackBufferAttributesExPNS3_24ReadbackBufferAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault22getReadbackBufferFenceExPN3ndk20ScopedFileDescriptorE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault16getRenderIntentsExNS3_9ColorModeEPNSt3__16vectorINS3_12RenderIntentENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault24getSupportedContentTypesExPNSt3__16vectorINS3_11ContentTypeENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault27getDisplayDecorationSupportExPNSt3__18optionalINS2_6common24DisplayDecorationSupportEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault16registerCallbackERKNSt3__110shared_ptrINS3_17IComposerCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault15setActiveConfigExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault30setActiveConfigWithConstraintsExiRKNS3_28VsyncPeriodChangeConstraintsEPNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault20setBootDisplayConfigExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault22clearBootDisplayConfigEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault29getPreferredBootDisplayConfigExPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault21setAutoLowLatencyModeExb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault24setClientTargetSlotCountExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault12setColorModeExNS3_9ColorModeENS3_12RenderIntentE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault14setContentTypeExNS3_11ContentTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault34setDisplayedContentSamplingEnabledExbNS3_20FormatColorComponentEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault12setPowerModeExNS3_9PowerModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault17setReadbackBufferExRKNS1_6common12NativeHandleERKN3ndk20ScopedFileDescriptorE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault15setVsyncEnabledExb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault19setIdleTimerEnabledExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer322IComposerClientDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layer",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "composition",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer311CompositionE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer323ChangedCompositionLayerE",
   "name" : "aidl::android::hardware::graphics::composer3::ChangedCompositionLayer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer323ChangedCompositionLayerE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer323ChangedCompositionLayerE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ChangedCompositionLayer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware8graphics9composer323ChangedCompositionLayerENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer323ChangedCompositionTypesE",
   "name" : "aidl::android::hardware::graphics::composer3::ChangedCompositionTypes",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer323ChangedCompositionTypesE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer323ChangedCompositionTypesE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ChangedCompositionTypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "timestampNanos",
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer323ClockMonotonicTimestampE",
   "name" : "aidl::android::hardware::graphics::composer3::ClockMonotonicTimestamp",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer323ClockMonotonicTimestampE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer323ClockMonotonicTimestampE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ClockMonotonicTimestamp.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer317IComposerCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer324IComposerCallbackDefaultE",
   "name" : "aidl::android::hardware::graphics::composer3::IComposerCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer324IComposerCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer324IComposerCallbackDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/IComposerCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer324IComposerCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault9onHotplugExb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault9onRefreshEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault18onSeamlessPossibleEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault7onVsyncExxi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault26onVsyncPeriodTimingChangedExRKNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault11onVsyncIdleEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer316BnComposerClientE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware8graphics9composer315IComposerClientEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer324IComposerClientDelegatorE",
   "name" : "aidl::android::hardware::graphics::composer3::IComposerClientDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer324IComposerClientDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer324IComposerClientDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/BnComposerClient.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer324IComposerClientDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer315IComposerClientEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator11createLayerExiPx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator20createVirtualDisplayEiiNS2_6common11PixelFormatEiPNS3_14VirtualDisplayE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator12destroyLayerExx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator21destroyVirtualDisplayEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator15executeCommandsERKNSt3__16vectorINS3_14DisplayCommandENS5_9allocatorIS7_EEEEPNS6_INS3_20CommandResultPayloadENS8_ISD_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator15getActiveConfigExPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator13getColorModesExPNSt3__16vectorINS3_9ColorModeENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator28getDataspaceSaturationMatrixENS2_6common9DataspaceEPNSt3__16vectorIfNS7_9allocatorIfEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator19getDisplayAttributeExiNS3_16DisplayAttributeEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator22getDisplayCapabilitiesExPNSt3__16vectorINS3_17DisplayCapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator17getDisplayConfigsExPNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator24getDisplayConnectionTypeExPNS3_21DisplayConnectionTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator28getDisplayIdentificationDataExPNS3_21DisplayIdentificationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator14getDisplayNameExPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator21getDisplayVsyncPeriodExPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator25getDisplayedContentSampleExxxPNS3_20DisplayContentSampleE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator37getDisplayedContentSamplingAttributesExPNS3_32DisplayContentSamplingAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator29getDisplayPhysicalOrientationExPNS2_6common9TransformE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator18getHdrCapabilitiesExPNS3_15HdrCapabilitiesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator25getMaxVirtualDisplayCountEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator23getPerFrameMetadataKeysExPNSt3__16vectorINS3_19PerFrameMetadataKeyENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator27getReadbackBufferAttributesExPNS3_24ReadbackBufferAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator22getReadbackBufferFenceExPN3ndk20ScopedFileDescriptorE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator16getRenderIntentsExNS3_9ColorModeEPNSt3__16vectorINS3_12RenderIntentENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator24getSupportedContentTypesExPNSt3__16vectorINS3_11ContentTypeENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator27getDisplayDecorationSupportExPNSt3__18optionalINS2_6common24DisplayDecorationSupportEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator16registerCallbackERKNSt3__110shared_ptrINS3_17IComposerCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator15setActiveConfigExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator30setActiveConfigWithConstraintsExiRKNS3_28VsyncPeriodChangeConstraintsEPNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator20setBootDisplayConfigExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator22clearBootDisplayConfigEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator29getPreferredBootDisplayConfigExPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator21setAutoLowLatencyModeExb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator24setClientTargetSlotCountExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator12setColorModeExNS3_9ColorModeENS3_12RenderIntentE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator14setContentTypeExNS3_11ContentTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator34setDisplayedContentSamplingEnabledExbNS3_20FormatColorComponentEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator12setPowerModeExNS3_9PowerModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator17setReadbackBufferExRKNS1_6common12NativeHandleERKN3ndk20ScopedFileDescriptorE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator15setVsyncEnabledExb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer324IComposerClientDelegator19setIdleTimerEnabledExi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BnComposerClient19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BnComposerClient16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer316BnComposerClient12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PixelFormatE"
    },
    {
     "field_name" : "dataspace",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9DataspaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer324ReadbackBufferAttributesE",
   "name" : "aidl::android::hardware::graphics::composer3::ReadbackBufferAttributes",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer324ReadbackBufferAttributesE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer324ReadbackBufferAttributesE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ReadbackBufferAttributes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "newVsyncAppliedTimeNanos",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "refreshRequired",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "refreshTimeNanos",
     "field_offset" : 96,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer325VsyncPeriodChangeTimelineE",
   "name" : "aidl::android::hardware::graphics::composer3::VsyncPeriodChangeTimeline",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer325VsyncPeriodChangeTimelineE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer325VsyncPeriodChangeTimelineE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/VsyncPeriodChangeTimeline.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer318BnComposerCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware8graphics9composer317IComposerCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegatorE",
   "name" : "aidl::android::hardware::graphics::composer3::IComposerCallbackDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/BnComposerCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware8graphics9composer317IComposerCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegator9onHotplugExb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegator9onRefreshEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegator18onSeamlessPossibleEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegator7onVsyncExxi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegator26onVsyncPeriodTimingChangedExRKNS3_25VsyncPeriodChangeTimelineE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer326IComposerCallbackDelegator11onVsyncIdleEx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BnComposerCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BnComposerCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer318BnComposerCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "desiredTimeNanos",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "seamlessRequired",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer328VsyncPeriodChangeConstraintsE",
   "name" : "aidl::android::hardware::graphics::composer3::VsyncPeriodChangeConstraints",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer328VsyncPeriodChangeConstraintsE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer328VsyncPeriodChangeConstraintsE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/VsyncPeriodChangeConstraints.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PixelFormatE"
    },
    {
     "field_name" : "dataspace",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9DataspaceE"
    },
    {
     "field_name" : "componentMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer320FormatColorComponentE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer332DisplayContentSamplingAttributesE",
   "name" : "aidl::android::hardware::graphics::composer3::DisplayContentSamplingAttributes",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer332DisplayContentSamplingAttributesE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer332DisplayContentSamplingAttributesE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/DisplayContentSamplingAttributes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "display",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "clientTargetProperty",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer320ClientTargetPropertyE"
    },
    {
     "field_name" : "brightness",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "dimmingStage",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer312DimmingStageE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer334ClientTargetPropertyWithBrightnessE",
   "name" : "aidl::android::hardware::graphics::composer3::ClientTargetPropertyWithBrightness",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer334ClientTargetPropertyWithBrightnessE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer334ClientTargetPropertyWithBrightnessE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ClientTargetPropertyWithBrightness.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "g",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "a",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer35ColorE",
   "name" : "aidl::android::hardware::graphics::composer3::Color",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer35ColorE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer35ColorE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/Color.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "slot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "handle",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware6common12NativeHandleEEE"
    },
    {
     "field_name" : "fence",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer36BufferE",
   "name" : "aidl::android::hardware::graphics::composer3::Buffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer36BufferE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer36BufferE",
   "size" : 36,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/Buffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer36ZOrderE",
   "name" : "aidl::android::hardware::graphics::composer3::ZOrder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer36ZOrderE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer36ZOrderE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/ZOrder.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware8graphics9composer39IComposerE",
   "name" : "aidl::android::hardware::graphics::composer3::IComposer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware8graphics9composer39IComposerE",
   "self_type" : "_ZTIN4aidl7android8hardware8graphics9composer39IComposerE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/graphics/composer/aidl/android.hardware.graphics.composer3-V1-ndk-source/gen/include/aidl/android/hardware/graphics/composer3/IComposer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware8graphics9composer39IComposerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer12createClientEPNSt3__110shared_ptrINS3_15IComposerClientEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer15getCapabilitiesEPNSt3__16vectorINS3_10CapabilityENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware8graphics9composer39IComposer16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<ndk::ScopedFileDescriptor, std::allocator<ndk::ScopedFileDescriptor>>>",
   "record_kind" : "class",
