{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",

   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long long, std::allocator<unsigned long long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/ISensorsCallback.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors16ISensorsCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::sensors::ISensorsCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware7sensors16ISensorsCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback25onDynamicSensorsConnectedERKNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback28onDynamicSensorsDisconnectedERKNSt3__16vectorIiNS4_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors8ISensorsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::sensors::ISensors>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware7sensors8ISensorsE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors8activateEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors5batchEixx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors18configDirectReportEiiNS3_9RateLevelEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors5flushEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors14getSensorsListEPNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors10initializeERKNS1_6common3fmq12MQDescriptorINS2_5EventENS5_21SynchronizedReadWriteEEERKNS6_IiS8_EERKNSt3__110shared_ptrINS2_16ISensorsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16injectSensorDataERKNS2_5EventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors21registerDirectChannelERKNS3_13SharedMemInfoEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16setOperationModeENS3_13OperationModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors23unregisterDirectChannelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors16ISensorsCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::sensors::ISensorsCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware7sensors16ISensorsCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback25onDynamicSensorsConnectedERKNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback28onDynamicSensorsDisconnectedERKNSt3__16vectorIiNS4_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors8ISensorsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::sensors::ISensors>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware7sensors8ISensorsE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors8activateEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors5batchEixx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors18configDirectReportEiiNS3_9RateLevelEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors5flushEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors14getSensorsListEPNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors10initializeERKNS1_6common3fmq12MQDescriptorINS2_5EventENS5_21SynchronizedReadWriteEEERKNS6_IiS8_EERKNSt3__110shared_ptrINS2_16ISensorsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16injectSensorDataERKNS2_5EventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors21registerDirectChannelERKNS3_13SharedMemInfoEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16setOperationModeENS3_13OperationModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors23unregisterDirectChannelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds",
     "referenced_type" : "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE"
    },
    {
     "field_name" : "ints",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "name" : "aidl::android::hardware::common::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "self_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/aidl/android.hardware.common-V2-ndk-source/gen/include/aidl/android/hardware/common/NativeHandle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "grantors",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6common3fmq17GrantorDescriptorENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "handle",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE"
    },
    {
     "field_name" : "quantum",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common3fmq12MQDescriptorINS1_7sensors5EventENS3_21SynchronizedReadWriteEEE",
   "name" : "aidl::android::hardware::common::fmq::MQDescriptor<aidl::android::hardware::sensors::Event, aidl::android::hardware::common::fmq::SynchronizedReadWrite>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common3fmq12MQDescriptorINS1_7sensors5EventENS3_21SynchronizedReadWriteEEE",
   "self_type" : "_ZTIN4aidl7android8hardware6common3fmq12MQDescriptorINS1_7sensors5EventENS3_21SynchronizedReadWriteEEE",
   "size" : 44,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/fmq/aidl/android.hardware.common.fmq-V1-ndk-source/gen/include/aidl/android/hardware/common/fmq/MQDescriptor.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware7sensors5EventE",
    "_ZTIN4aidl7android8hardware6common3fmq21SynchronizedReadWriteE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "grantors",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6common3fmq17GrantorDescriptorENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "handle",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE"
    },
    {
     "field_name" : "quantum",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common3fmq12MQDescriptorIiNS3_21SynchronizedReadWriteEEE",
   "name" : "aidl::android::hardware::common::fmq::MQDescriptor<int, aidl::android::hardware::common::fmq::SynchronizedReadWrite>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common3fmq12MQDescriptorIiNS3_21SynchronizedReadWriteEEE",
   "self_type" : "_ZTIN4aidl7android8hardware6common3fmq12MQDescriptorIiNS3_21SynchronizedReadWriteEEE",
   "size" : 44,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/fmq/aidl/android.hardware.common.fmq-V1-ndk-source/gen/include/aidl/android/hardware/common/fmq/MQDescriptor.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIN4aidl7android8hardware6common3fmq21SynchronizedReadWriteE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fdIndex",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "extent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common3fmq17GrantorDescriptorE",
   "name" : "aidl::android::hardware::common::fmq::GrantorDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common3fmq17GrantorDescriptorE",
   "self_type" : "_ZTIN4aidl7android8hardware6common3fmq17GrantorDescriptorE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/fmq/aidl/android.hardware.common.fmq-V1-ndk-source/gen/include/aidl/android/hardware/common/fmq/GrantorDescriptor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sensorHandle",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "vendor",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "version",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors10SensorTypeE"
    },
    {
     "field_name" : "typeAsString",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "maxRange",
     "field_offset" : 384,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "resolution",
     "field_offset" : 416,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "power",
     "field_offset" : 448,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minDelayUs",
     "field_offset" : 480,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fifoReservedEventCount",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fifoMaxEventCount",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "requiredPermission",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "maxDelayUs",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors10SensorInfoE",
   "name" : "aidl::android::hardware::sensors::SensorInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors10SensorInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors10SensorInfoE",
   "size" : 92,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/SensorInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values",
     "referenced_type" : "_ZTINSt3__15arrayIfLj14EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload11FloatValuesE",
   "name" : "aidl::android::hardware::sensors::AdditionalInfo::AdditionalInfoPayload::FloatValues",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload11FloatValuesE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload11FloatValuesE",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/AdditionalInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values",
     "referenced_type" : "_ZTINSt3__15arrayIiLj14EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload11Int32ValuesE",
   "name" : "aidl::android::hardware::sensors::AdditionalInfo::AdditionalInfoPayload::Int32Values",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload11Int32ValuesE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload11Int32ValuesE",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/AdditionalInfo.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dataInt32",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload11Int32ValuesE"
    },
    {
     "field_name" : "dataFloat",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload11FloatValuesE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload8_value_tE",
   "name" : "aidl::android::hardware::sensors::AdditionalInfo::AdditionalInfoPayload::_value_t",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload8_value_tE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload8_value_tE",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/AdditionalInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_tag",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload3TagE"
    },
    {
     "access" : "private",
     "field_name" : "_value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayload8_value_tE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayloadE",
   "name" : "aidl::android::hardware::sensors::AdditionalInfo::AdditionalInfoPayload",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayloadE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayloadE",
   "size" : 60,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/AdditionalInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo18AdditionalInfoTypeE"
    },
    {
     "field_name" : "serial",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "payload",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfo21AdditionalInfoPayloadE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfoE",
   "name" : "aidl::android::hardware::sensors::AdditionalInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfoE",
   "size" : 68,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/AdditionalInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors8ISensorsE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors15ISensorsDefaultE",
   "name" : "aidl::android::hardware::sensors::ISensorsDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors15ISensorsDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors15ISensorsDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/ISensors.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors15ISensorsDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault8activateEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault5batchEixx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault18configDirectReportEiiNS2_8ISensors9RateLevelEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault5flushEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault14getSensorsListEPNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault10initializeERKNS1_6common3fmq12MQDescriptorINS2_5EventENS5_21SynchronizedReadWriteEEERKNS6_IiS8_EERKNSt3__110shared_ptrINS2_16ISensorsCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault16injectSensorDataERKNS2_5EventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault21registerDirectChannelERKNS2_8ISensors13SharedMemInfoEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault16setOperationModeENS2_8ISensors13OperationModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault23unregisterDirectChannelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors15ISensorsDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors16ISensorsCallbackE",
   "name" : "aidl::android::hardware::sensors::ISensorsCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors16ISensorsCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors16ISensorsCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/ISensorsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors16ISensorsCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback25onDynamicSensorsConnectedERKNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback28onDynamicSensorsDisconnectedERKNSt3__16vectorIiNS4_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors17BnSensorsCallbackE",
   "name" : "aidl::android::hardware::sensors::BnSensorsCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors17BnSensorsCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors17BnSensorsCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/BnSensorsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors17BnSensorsCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BnSensorsCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BnSensorsCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback25onDynamicSensorsConnectedERKNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors16ISensorsCallback28onDynamicSensorsDisconnectedERKNSt3__16vectorIiNS4_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BnSensorsCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BnSensorsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BnSensorsCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors17BpSensorsCallbackE",
   "name" : "aidl::android::hardware::sensors::BpSensorsCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors17BpSensorsCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors17BpSensorsCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/BpSensorsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors17BpSensorsCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BpSensorsCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BpSensorsCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BpSensorsCallback25onDynamicSensorsConnectedERKNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BpSensorsCallback28onDynamicSensorsDisconnectedERKNSt3__16vectorIiNS4_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BpSensorsCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BpSensorsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "values",
     "referenced_type" : "_ZTINSt3__15arrayIhLj16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors17DynamicSensorInfo4UuidE",
   "name" : "aidl::android::hardware::sensors::DynamicSensorInfo::Uuid",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors17DynamicSensorInfo4UuidE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors17DynamicSensorInfo4UuidE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/DynamicSensorInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "connected",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "sensorHandle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uuid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors17DynamicSensorInfo4UuidE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors17DynamicSensorInfoE",
   "name" : "aidl::android::hardware::sensors::DynamicSensorInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors17DynamicSensorInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors17DynamicSensorInfoE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/DynamicSensorInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors9BnSensorsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware7sensors8ISensorsEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors17ISensorsDelegatorE",
   "name" : "aidl::android::hardware::sensors::ISensorsDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors17ISensorsDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors17ISensorsDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/BnSensors.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors17ISensorsDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator8activateEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator5batchEixx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator18configDirectReportEiiNS2_8ISensors9RateLevelEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator5flushEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator14getSensorsListEPNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator10initializeERKNS1_6common3fmq12MQDescriptorINS2_5EventENS5_21SynchronizedReadWriteEEERKNS6_IiS8_EERKNSt3__110shared_ptrINS2_16ISensorsCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator16injectSensorDataERKNS2_5EventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator21registerDirectChannelERKNS2_8ISensors13SharedMemInfoEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator16setOperationModeENS2_8ISensors13OperationModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17ISensorsDelegator23unregisterDirectChannelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BnSensors19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BnSensors16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BnSensors12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors16ISensorsCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors23ISensorsCallbackDefaultE",
   "name" : "aidl::android::hardware::sensors::ISensorsCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors23ISensorsCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors23ISensorsCallbackDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/ISensorsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors23ISensorsCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors23ISensorsCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors23ISensorsCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors23ISensorsCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors23ISensorsCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors23ISensorsCallbackDefault25onDynamicSensorsConnectedERKNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors23ISensorsCallbackDefault28onDynamicSensorsDisconnectedERKNSt3__16vectorIiNS4_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors23ISensorsCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors23ISensorsCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors17BnSensorsCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware7sensors16ISensorsCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors25ISensorsCallbackDelegatorE",
   "name" : "aidl::android::hardware::sensors::ISensorsCallbackDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors25ISensorsCallbackDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors25ISensorsCallbackDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/BnSensorsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors25ISensorsCallbackDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors25ISensorsCallbackDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors25ISensorsCallbackDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors16ISensorsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors25ISensorsCallbackDelegator25onDynamicSensorsConnectedERKNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors25ISensorsCallbackDelegator28onDynamicSensorsDisconnectedERKNSt3__16vectorIiNS4_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BnSensorsCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BnSensorsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors17BnSensorsCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rx",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "ry",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "rz",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "vx",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "vy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "vz",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "discontinuityCount",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload11HeadTrackerE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::HeadTracker",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload11HeadTrackerE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload11HeadTrackerE",
   "size" : 28,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "xSupported",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "ySupported",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "zSupported",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload14LimitedAxesImuE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::LimitedAxesImu",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload14LimitedAxesImuE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload14LimitedAxesImuE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "xBias",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "yBias",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "zBias",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "xSupported",
     "field_offset" : 192,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "ySupported",
     "field_offset" : 224,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "zSupported",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload19LimitedAxesImuUncalE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::LimitedAxesImuUncal",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload19LimitedAxesImuUncalE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload19LimitedAxesImuUncalE",
   "size" : 36,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values",
     "referenced_type" : "_ZTINSt3__15arrayIfLj16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4DataE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::Data",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4DataE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4DataE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "status",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors12SensorStatusE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4Vec3E",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::Vec3",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4Vec3E",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4Vec3E",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "w",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4Vec4E",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::Vec4",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4Vec4E",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4Vec4E",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "xBias",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "yBias",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "zBias",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload5UncalE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::Uncal",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload5UncalE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload5UncalE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "heading",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "accuracy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload7HeadingE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::Heading",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload7HeadingE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload7HeadingE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "what",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8MetaData17MetaDataEventTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8MetaDataE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::MetaData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8MetaDataE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8MetaDataE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values",
     "referenced_type" : "_ZTINSt3__15arrayIfLj15EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8Pose6DofE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::Pose6Dof",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8Pose6DofE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8Pose6DofE",
   "size" : 60,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vec3",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4Vec3E"
    },
    {
     "field_name" : "vec4",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4Vec4E"
    },
    {
     "field_name" : "uncal",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload5UncalE"
    },
    {
     "field_name" : "meta",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8MetaDataE"
    },
    {
     "field_name" : "scalar",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "stepCount",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "heartRate",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload9HeartRateE"
    },
    {
     "field_name" : "pose6DOF",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8Pose6DofE"
    },
    {
     "field_name" : "dynamic",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors17DynamicSensorInfoE"
    },
    {
     "field_name" : "additional",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors14AdditionalInfoE"
    },
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload4DataE"
    },
    {
     "field_name" : "headTracker",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload11HeadTrackerE"
    },
    {
     "field_name" : "limitedAxesImu",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload14LimitedAxesImuE"
    },
    {
     "field_name" : "limitedAxesImuUncal",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload19LimitedAxesImuUncalE"
    },
    {
     "field_name" : "heading",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload7HeadingE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8_value_tE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::_value_t",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8_value_tE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8_value_tE",
   "size" : 72,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bpm",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "status",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors12SensorStatusE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload9HeartRateE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload::HeartRate",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload9HeartRateE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload9HeartRateE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_tag",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload3TagE"
    },
    {
     "access" : "private",
     "field_name" : "_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayload8_value_tE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayloadE",
   "name" : "aidl::android::hardware::sensors::Event::EventPayload",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayloadE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayloadE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "sensorHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sensorType",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors10SensorTypeE"
    },
    {
     "field_name" : "payload",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5Event12EventPayloadE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors5EventE",
   "name" : "aidl::android::hardware::sensors::Event",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors5EventE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors5EventE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/Event.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors8ISensors13SharedMemInfo13SharedMemTypeE"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware7sensors8ISensors13SharedMemInfo15SharedMemFormatE"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "memoryHandle",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors8ISensors13SharedMemInfoE",
   "name" : "aidl::android::hardware::sensors::ISensors::SharedMemInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors8ISensors13SharedMemInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors8ISensors13SharedMemInfoE",
   "size" : 36,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/ISensors.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors8ISensorsE",
   "name" : "aidl::android::hardware::sensors::ISensors",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors8ISensorsE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors8ISensorsE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/ISensors.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors8ISensorsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensorsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensorsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors8activateEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors5batchEixx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors18configDirectReportEiiNS3_9RateLevelEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors5flushEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors14getSensorsListEPNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors10initializeERKNS1_6common3fmq12MQDescriptorINS2_5EventENS5_21SynchronizedReadWriteEEERKNS6_IiS8_EERKNSt3__110shared_ptrINS2_16ISensorsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16injectSensorDataERKNS2_5EventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors21registerDirectChannelERKNS3_13SharedMemInfoEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16setOperationModeENS3_13OperationModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors23unregisterDirectChannelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors9BnSensorsE",
   "name" : "aidl::android::hardware::sensors::BnSensors",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors9BnSensorsE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors9BnSensorsE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/BnSensors.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors9BnSensorsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BnSensorsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BnSensorsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors8activateEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors5batchEixx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors18configDirectReportEiiNS3_9RateLevelEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors5flushEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors14getSensorsListEPNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors10initializeERKNS1_6common3fmq12MQDescriptorINS2_5EventENS5_21SynchronizedReadWriteEEERKNS6_IiS8_EERKNSt3__110shared_ptrINS2_16ISensorsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16injectSensorDataERKNS2_5EventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors21registerDirectChannelERKNS3_13SharedMemInfoEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors16setOperationModeENS3_13OperationModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors8ISensors23unregisterDirectChannelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BnSensors19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BnSensors16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BnSensors12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware7sensors9BpSensorsE",
   "name" : "aidl::android::hardware::sensors::BpSensors",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware7sensors9BpSensorsE",
   "self_type" : "_ZTIN4aidl7android8hardware7sensors9BpSensorsE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/sensors/aidl/android.hardware.sensors-V1-ndk-source/gen/include/aidl/android/hardware/sensors/BpSensors.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware7sensors9BpSensorsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensorsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensorsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware7sensors8ISensorsEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors8activateEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors5batchEixx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors18configDirectReportEiiNS2_8ISensors9RateLevelEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors5flushEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors14getSensorsListEPNSt3__16vectorINS2_10SensorInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors10initializeERKNS1_6common3fmq12MQDescriptorINS2_5EventENS5_21SynchronizedReadWriteEEERKNS6_IiS8_EERKNSt3__110shared_ptrINS2_16ISensorsCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors16injectSensorDataERKNS2_5EventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors21registerDirectChannelERKNS2_8ISensors13SharedMemInfoEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors16setOperationModeENS2_8ISensors13OperationModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors23unregisterDirectChannelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware7sensors9BpSensors16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__15arrayIfLj14EEEEE",
   "name" : "android::internal::details::IsIterable<std::array<float, 14>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__15arrayIfLj14EEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__15arrayIfLj14EEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__15arrayIfLj14EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__15arrayIfLj15EEEEE",
   "name" : "android::internal::details::IsIterable<std::array<float, 15>>",
   "record_kind" : "class",
