{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",

   "name" : "const std::optional<std::vector<long, std::allocator<long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long, std::allocator<unsigned long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraDeviceCallback.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device13ICameraDeviceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::camera::device::ICameraDevice>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device13ICameraDeviceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice24getCameraCharacteristicsEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice32getPhysicalCameraCharacteristicsERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice15getResourceCostEPNS2_6common18CameraResourceCostE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice28isStreamCombinationSupportedERKNS3_19StreamConfigurationEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice4openERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_20ICameraDeviceSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice20openInjectionSessionERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_23ICameraInjectionSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice12setTorchModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice28turnOnTorchWithStrengthLevelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice21getTorchStrengthLevelEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceSessionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::camera::device::ICameraDeviceSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceSessionE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession16configureStreamsERKNS3_19StreamConfigurationEPNSt3__16vectorINS3_9HalStreamENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession31constructDefaultRequestSettingsENS3_15RequestTemplateEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession30getCaptureRequestMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession25isReconfigurationRequiredERKNS3_14CameraMetadataES7_Pb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession21processCaptureRequestERKNSt3__16vectorINS3_14CaptureRequestENS5_9allocatorIS7_EEEERKNS6_INS3_11BufferCacheENS8_ISD_EEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession17signalStreamFlushERKNSt3__16vectorIiNS5_9allocatorIiEEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession15switchToOfflineERKNSt3__16vectorIiNS5_9allocatorIiEEEEPNS3_24CameraOfflineSessionInfoEPNS5_10shared_ptrINS3_21ICameraOfflineSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession19repeatingRequestEndEiRKNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::camera::device::ICameraDeviceCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback6notifyERKNSt3__16vectorINS3_9NotifyMsgENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback20processCaptureResultERKNSt3__16vectorINS3_13CaptureResultENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback20requestStreamBuffersERKNSt3__16vectorINS3_13BufferRequestENS5_9allocatorIS7_EEEEPNS6_INS3_15StreamBufferRetENS8_ISD_EEEEPNS3_19BufferRequestStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback19returnStreamBuffersERKNSt3__16vectorINS3_12StreamBufferENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraOfflineSessionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::camera::device::ICameraOfflineSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device21ICameraOfflineSessionE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession11setCallbackERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device23ICameraInjectionSessionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::camera::device::ICameraInjectionSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device23ICameraInjectionSessionE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession25configureInjectionStreamsERKNS3_19StreamConfigurationERKNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession22getCameraDeviceSessionEPNSt3__110shared_ptrINS3_20ICameraDeviceSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider15ICameraProviderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::camera::provider::ICameraProvider>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera8provider15ICameraProviderE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider11setCallbackERKNSt3__110shared_ptrINS3_23ICameraProviderCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider13getVendorTagsEPNSt3__16vectorINS2_6common16VendorTagSectionENS5_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider15getCameraIdListEPNSt3__16vectorINS5_12basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENSA_ISC_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider24getCameraDeviceInterfaceERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS5_10shared_ptrINS2_6device13ICameraDeviceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider23notifyDeviceStateChangeEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider22getConcurrentCameraIdsEPNSt3__16vectorINS3_29ConcurrentCameraIdCombinationENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider38isConcurrentStreamCombinationSupportedERKNSt3__16vectorINS3_28CameraIdAndStreamCombinationENS5_9allocatorIS7_EEEEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::camera::provider::ICameraProviderCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback24cameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common18CameraDeviceStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback21torchModeStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common15TorchModeStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback32physicalCameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_NS2_6common18CameraDeviceStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device13ICameraDeviceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::camera::device::ICameraDevice>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device13ICameraDeviceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice24getCameraCharacteristicsEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice32getPhysicalCameraCharacteristicsERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice15getResourceCostEPNS2_6common18CameraResourceCostE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice28isStreamCombinationSupportedERKNS3_19StreamConfigurationEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice4openERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_20ICameraDeviceSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice20openInjectionSessionERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_23ICameraInjectionSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice12setTorchModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice28turnOnTorchWithStrengthLevelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice21getTorchStrengthLevelEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceSessionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::camera::device::ICameraDeviceSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceSessionE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession16configureStreamsERKNS3_19StreamConfigurationEPNSt3__16vectorINS3_9HalStreamENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession31constructDefaultRequestSettingsENS3_15RequestTemplateEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession30getCaptureRequestMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession25isReconfigurationRequiredERKNS3_14CameraMetadataES7_Pb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession21processCaptureRequestERKNSt3__16vectorINS3_14CaptureRequestENS5_9allocatorIS7_EEEERKNS6_INS3_11BufferCacheENS8_ISD_EEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession17signalStreamFlushERKNSt3__16vectorIiNS5_9allocatorIiEEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession15switchToOfflineERKNSt3__16vectorIiNS5_9allocatorIiEEEEPNS3_24CameraOfflineSessionInfoEPNS5_10shared_ptrINS3_21ICameraOfflineSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession19repeatingRequestEndEiRKNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::camera::device::ICameraDeviceCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback6notifyERKNSt3__16vectorINS3_9NotifyMsgENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback20processCaptureResultERKNSt3__16vectorINS3_13CaptureResultENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback20requestStreamBuffersERKNSt3__16vectorINS3_13BufferRequestENS5_9allocatorIS7_EEEEPNS6_INS3_15StreamBufferRetENS8_ISD_EEEEPNS3_19BufferRequestStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback19returnStreamBuffersERKNSt3__16vectorINS3_12StreamBufferENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraOfflineSessionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::camera::device::ICameraOfflineSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device21ICameraOfflineSessionE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession11setCallbackERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device23ICameraInjectionSessionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::camera::device::ICameraInjectionSession>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera6device23ICameraInjectionSessionE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession25configureInjectionStreamsERKNS3_19StreamConfigurationERKNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession22getCameraDeviceSessionEPNSt3__110shared_ptrINS3_20ICameraDeviceSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider15ICameraProviderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::camera::provider::ICameraProvider>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera8provider15ICameraProviderE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider11setCallbackERKNSt3__110shared_ptrINS3_23ICameraProviderCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider13getVendorTagsEPNSt3__16vectorINS2_6common16VendorTagSectionENS5_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider15getCameraIdListEPNSt3__16vectorINS5_12basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENSA_ISC_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider24getCameraDeviceInterfaceERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS5_10shared_ptrINS2_6device13ICameraDeviceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider23notifyDeviceStateChangeEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider22getConcurrentCameraIdsEPNSt3__16vectorINS3_29ConcurrentCameraIdCombinationENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider38isConcurrentStreamCombinationSupportedERKNSt3__16vectorINS3_28CameraIdAndStreamCombinationENS5_9allocatorIS7_EEEEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::camera::provider::ICameraProviderCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback24cameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common18CameraDeviceStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback21torchModeStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common15TorchModeStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback32physicalCameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_NS2_6common18CameraDeviceStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sectionName",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "tags",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6common9VendorTagENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6common16VendorTagSectionE",
   "name" : "aidl::android::hardware::camera::common::VendorTagSection",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6common16VendorTagSectionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6common16VendorTagSectionE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/common/aidl/android.hardware.camera.common-V1-ndk-source/gen/include/aidl/android/hardware/camera/common/VendorTagSection.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "resourceCost",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "conflictingDevices",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6common18CameraResourceCostE",
   "name" : "aidl::android::hardware::camera::common::CameraResourceCost",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6common18CameraResourceCostE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6common18CameraResourceCostE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/common/aidl/android.hardware.camera.common-V1-ndk-source/gen/include/aidl/android/hardware/camera/common/CameraResourceCost.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tagId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tagName",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "tagType",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6common18CameraMetadataTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6common9VendorTagE",
   "name" : "aidl::android::hardware::camera::common::VendorTag",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6common9VendorTagE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6common9VendorTagE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/common/aidl/android.hardware.camera.common-V1-ndk-source/gen/include/aidl/android/hardware/camera/common/VendorTag.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "readoutTimestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device10ShutterMsgE",
   "name" : "aidl::android::hardware::camera::device::ShutterMsg",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device10ShutterMsgE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device10ShutterMsgE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ShutterMsg.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streamId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bufferId",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device11BufferCacheE",
   "name" : "aidl::android::hardware::camera::device::BufferCache",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device11BufferCacheE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device11BufferCacheE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BufferCache.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streamId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bufferId",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE"
    },
    {
     "field_name" : "status",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device12BufferStatusE"
    },
    {
     "field_name" : "acquireFence",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE"
    },
    {
     "field_name" : "releaseFence",
     "field_offset" : 960,
     "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device12StreamBufferE",
   "name" : "aidl::android::hardware::camera::device::StreamBuffer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device12StreamBufferE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device12StreamBufferE",
   "size" : 168,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/StreamBuffer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "streamId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numBuffersRequested",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device13BufferRequestE",
   "name" : "aidl::android::hardware::camera::device::BufferRequest",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device13BufferRequestE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device13BufferRequestE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BufferRequest.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fmqResultSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "result",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14CameraMetadataE"
    },
    {
     "field_name" : "outputBuffers",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6device12StreamBufferENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "inputBuffer",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device12StreamBufferE"
    },
    {
     "field_name" : "partialResult",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "physicalCameraMetadata",
     "field_offset" : 1920,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6device22PhysicalCameraMetadataENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device13CaptureResultE",
   "name" : "aidl::android::hardware::camera::device::CaptureResult",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device13CaptureResultE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device13CaptureResultE",
   "size" : 264,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/CaptureResult.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device13ICameraDeviceE",
   "name" : "aidl::android::hardware::camera::device::ICameraDevice",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device13ICameraDeviceE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device13ICameraDeviceE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraDevice.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device13ICameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDeviceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice24getCameraCharacteristicsEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice32getPhysicalCameraCharacteristicsERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice15getResourceCostEPNS2_6common18CameraResourceCostE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice28isStreamCombinationSupportedERKNS3_19StreamConfigurationEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice4openERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_20ICameraDeviceSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice20openInjectionSessionERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_23ICameraInjectionSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice12setTorchModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice28turnOnTorchWithStrengthLevelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice21getTorchStrengthLevelEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numOutstandingBuffers",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "circulatingBufferIds",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIlNS_9allocatorIlEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device13OfflineStreamE",
   "name" : "aidl::android::hardware::camera::device::OfflineStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device13OfflineStreamE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device13OfflineStreamE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/OfflineStream.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device14BnCameraDeviceE",
   "name" : "aidl::android::hardware::camera::device::BnCameraDevice",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14BnCameraDeviceE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device14BnCameraDeviceE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraDevice.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device14BnCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BnCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BnCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice24getCameraCharacteristicsEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice32getPhysicalCameraCharacteristicsERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice15getResourceCostEPNS2_6common18CameraResourceCostE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice28isStreamCombinationSupportedERKNS3_19StreamConfigurationEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice4openERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_20ICameraDeviceSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice20openInjectionSessionERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_23ICameraInjectionSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice12setTorchModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice28turnOnTorchWithStrengthLevelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device13ICameraDevice21getTorchStrengthLevelEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BnCameraDevice19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BnCameraDevice16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BnCameraDevice12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device14BpCameraDeviceE",
   "name" : "aidl::android::hardware::camera::device::BpCameraDevice",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14BpCameraDeviceE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device14BpCameraDeviceE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BpCameraDevice.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device14BpCameraDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice24getCameraCharacteristicsEPNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice32getPhysicalCameraCharacteristicsERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice15getResourceCostEPNS2_6common18CameraResourceCostE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice28isStreamCombinationSupportedERKNS3_19StreamConfigurationEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice4openERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_20ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice20openInjectionSessionERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_23ICameraInjectionSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice12setTorchModeEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice28turnOnTorchWithStrengthLevelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice21getTorchStrengthLevelEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BpCameraDevice16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "metadata",
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device14CameraMetadataE",
   "name" : "aidl::android::hardware::camera::device::CameraMetadata",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14CameraMetadataE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device14CameraMetadataE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/CameraMetadata.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fmqSettingsSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "settings",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14CameraMetadataE"
    },
    {
     "field_name" : "inputBuffer",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device12StreamBufferE"
    },
    {
     "field_name" : "inputWidth",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "inputHeight",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "outputBuffers",
     "field_offset" : 1728,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6device12StreamBufferENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "physicalCameraSettings",
     "field_offset" : 1920,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6device21PhysicalCameraSettingENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device14CaptureRequestE",
   "name" : "aidl::android::hardware::camera::device::CaptureRequest",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14CaptureRequestE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device14CaptureRequestE",
   "size" : 264,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/CaptureRequest.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pendingStreams",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device14OfflineRequestE",
   "name" : "aidl::android::hardware::camera::device::OfflineRequest",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14OfflineRequestE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device14OfflineRequestE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/OfflineRequest.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streamId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "val",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device16StreamBuffersValE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device15StreamBufferRetE",
   "name" : "aidl::android::hardware::camera::device::StreamBufferRet",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device15StreamBufferRetE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device15StreamBufferRetE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/StreamBufferRet.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware6camera6device24StreamBufferRequestErrorENS_6vectorINS5_12StreamBufferENS_9allocatorIS8_EEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device16StreamBuffersValE",
   "name" : "aidl::android::hardware::camera::device::StreamBuffersVal",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device16StreamBuffersValE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device16StreamBuffersValE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/StreamBuffersVal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streams",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6device6StreamENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "operationMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device23StreamConfigurationModeE"
    },
    {
     "field_name" : "sessionParams",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14CameraMetadataE"
    },
    {
     "field_name" : "streamConfigCounter",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "multiResolutionInputImage",
     "field_offset" : 480,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device19StreamConfigurationE",
   "name" : "aidl::android::hardware::camera::device::StreamConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device19StreamConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device19StreamConfigurationE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/StreamConfiguration.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device13ICameraDeviceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceDefaultE",
   "name" : "aidl::android::hardware::camera::device::ICameraDeviceDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraDevice.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault24getCameraCharacteristicsEPNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault32getPhysicalCameraCharacteristicsERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault15getResourceCostEPNS2_6common18CameraResourceCostE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault28isStreamCombinationSupportedERKNS3_19StreamConfigurationEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault4openERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_20ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault20openInjectionSessionERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_23ICameraInjectionSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault12setTorchModeEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault28turnOnTorchWithStrengthLevelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault21getTorchStrengthLevelEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceSessionE",
   "name" : "aidl::android::hardware::camera::device::ICameraDeviceSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceSessionE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraDeviceSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSessionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession16configureStreamsERKNS3_19StreamConfigurationEPNSt3__16vectorINS3_9HalStreamENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession31constructDefaultRequestSettingsENS3_15RequestTemplateEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession30getCaptureRequestMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession25isReconfigurationRequiredERKNS3_14CameraMetadataES7_Pb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession21processCaptureRequestERKNSt3__16vectorINS3_14CaptureRequestENS5_9allocatorIS7_EEEERKNS6_INS3_11BufferCacheENS8_ISD_EEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession17signalStreamFlushERKNSt3__16vectorIiNS5_9allocatorIiEEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession15switchToOfflineERKNSt3__16vectorIiNS5_9allocatorIiEEEEPNS3_24CameraOfflineSessionInfoEPNS5_10shared_ptrINS3_21ICameraOfflineSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession19repeatingRequestEndEiRKNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device21BnCameraDeviceSessionE",
   "name" : "aidl::android::hardware::camera::device::BnCameraDeviceSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21BnCameraDeviceSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device21BnCameraDeviceSessionE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraDeviceSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device21BnCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BnCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BnCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession16configureStreamsERKNS3_19StreamConfigurationEPNSt3__16vectorINS3_9HalStreamENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession31constructDefaultRequestSettingsENS3_15RequestTemplateEPNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession30getCaptureRequestMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession25isReconfigurationRequiredERKNS3_14CameraMetadataES7_Pb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession21processCaptureRequestERKNSt3__16vectorINS3_14CaptureRequestENS5_9allocatorIS7_EEEERKNS6_INS3_11BufferCacheENS8_ISD_EEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession17signalStreamFlushERKNSt3__16vectorIiNS5_9allocatorIiEEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession15switchToOfflineERKNSt3__16vectorIiNS5_9allocatorIiEEEEPNS3_24CameraOfflineSessionInfoEPNS5_10shared_ptrINS3_21ICameraOfflineSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device20ICameraDeviceSession19repeatingRequestEndEiRKNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BnCameraDeviceSession19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BnCameraDeviceSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BnCameraDeviceSession12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device21BpCameraDeviceSessionE",
   "name" : "aidl::android::hardware::camera::device::BpCameraDeviceSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21BpCameraDeviceSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device21BpCameraDeviceSessionE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BpCameraDeviceSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device21BpCameraDeviceSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession16configureStreamsERKNS3_19StreamConfigurationEPNSt3__16vectorINS3_9HalStreamENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession31constructDefaultRequestSettingsENS3_15RequestTemplateEPNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession5flushEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession30getCaptureRequestMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession25isReconfigurationRequiredERKNS3_14CameraMetadataES7_Pb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession21processCaptureRequestERKNSt3__16vectorINS3_14CaptureRequestENS5_9allocatorIS7_EEEERKNS6_INS3_11BufferCacheENS8_ISD_EEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession17signalStreamFlushERKNSt3__16vectorIiNS5_9allocatorIiEEEEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession15switchToOfflineERKNSt3__16vectorIiNS5_9allocatorIiEEEEPNS3_24CameraOfflineSessionInfoEPNS5_10shared_ptrINS3_21ICameraOfflineSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession19repeatingRequestEndEiRKNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BpCameraDeviceSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackE",
   "name" : "aidl::android::hardware::camera::device::ICameraDeviceCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraDeviceCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback6notifyERKNSt3__16vectorINS3_9NotifyMsgENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback20processCaptureResultERKNSt3__16vectorINS3_13CaptureResultENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback20requestStreamBuffersERKNSt3__16vectorINS3_13BufferRequestENS5_9allocatorIS7_EEEEPNS6_INS3_15StreamBufferRetENS8_ISD_EEEEPNS3_19BufferRequestStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback19returnStreamBuffersERKNSt3__16vectorINS3_12StreamBufferENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device21ICameraOfflineSessionE",
   "name" : "aidl::android::hardware::camera::device::ICameraOfflineSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraOfflineSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraOfflineSessionE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraOfflineSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device21ICameraOfflineSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSessionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession11setCallbackERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fmqSettingsSize",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "physicalCameraId",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "settings",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14CameraMetadataE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device21PhysicalCameraSettingE",
   "name" : "aidl::android::hardware::camera::device::PhysicalCameraSetting",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21PhysicalCameraSettingE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device21PhysicalCameraSettingE",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/PhysicalCameraSetting.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraDeviceCallbackE",
   "name" : "aidl::android::hardware::camera::device::BnCameraDeviceCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraDeviceCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraDeviceCallbackE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraDeviceCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback6notifyERKNSt3__16vectorINS3_9NotifyMsgENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback20processCaptureResultERKNSt3__16vectorINS3_13CaptureResultENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback20requestStreamBuffersERKNSt3__16vectorINS3_13BufferRequestENS5_9allocatorIS7_EEEEPNS6_INS3_15StreamBufferRetENS8_ISD_EEEEPNS3_19BufferRequestStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraDeviceCallback19returnStreamBuffersERKNSt3__16vectorINS3_12StreamBufferENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraDeviceCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraDeviceCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraDeviceCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraOfflineSessionE",
   "name" : "aidl::android::hardware::camera::device::BnCameraOfflineSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraOfflineSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraOfflineSessionE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraOfflineSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraOfflineSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraOfflineSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraOfflineSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21ICameraOfflineSession11setCallbackERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraOfflineSession19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraOfflineSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraOfflineSession12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device22BpCameraDeviceCallbackE",
   "name" : "aidl::android::hardware::camera::device::BpCameraDeviceCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device22BpCameraDeviceCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device22BpCameraDeviceCallbackE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BpCameraDeviceCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device22BpCameraDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraDeviceCallback6notifyERKNSt3__16vectorINS3_9NotifyMsgENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraDeviceCallback20processCaptureResultERKNSt3__16vectorINS3_13CaptureResultENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraDeviceCallback20requestStreamBuffersERKNSt3__16vectorINS3_13BufferRequestENS5_9allocatorIS7_EEEEPNS6_INS3_15StreamBufferRetENS8_ISD_EEEEPNS3_19BufferRequestStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraDeviceCallback19returnStreamBuffersERKNSt3__16vectorINS3_12StreamBufferENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraDeviceCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraDeviceCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device22BpCameraOfflineSessionE",
   "name" : "aidl::android::hardware::camera::device::BpCameraOfflineSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device22BpCameraOfflineSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device22BpCameraOfflineSessionE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BpCameraOfflineSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device22BpCameraOfflineSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraOfflineSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraOfflineSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraOfflineSession5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraOfflineSession29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraOfflineSession11setCallbackERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraOfflineSession19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BpCameraOfflineSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14BnCameraDeviceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware6camera6device13ICameraDeviceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device22ICameraDeviceDelegatorE",
   "name" : "aidl::android::hardware::camera::device::ICameraDeviceDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device22ICameraDeviceDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device22ICameraDeviceDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraDevice.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device22ICameraDeviceDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device13ICameraDeviceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegator24getCameraCharacteristicsEPNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegator32getPhysicalCameraCharacteristicsERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegator15getResourceCostEPNS2_6common18CameraResourceCostE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegator28isStreamCombinationSupportedERKNS3_19StreamConfigurationEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegator4openERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_20ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegator20openInjectionSessionERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEEPNS6_INS3_23ICameraInjectionSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegator12setTorchModeEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegator28turnOnTorchWithStrengthLevelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22ICameraDeviceDelegator21getTorchStrengthLevelEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BnCameraDevice19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BnCameraDevice16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device14BnCameraDevice12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fmqMetadataSize",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "physicalCameraId",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "metadata",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14CameraMetadataE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device22PhysicalCameraMetadataE",
   "name" : "aidl::android::hardware::camera::device::PhysicalCameraMetadata",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device22PhysicalCameraMetadataE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device22PhysicalCameraMetadataE",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/PhysicalCameraMetadata.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device23ICameraInjectionSessionE",
   "name" : "aidl::android::hardware::camera::device::ICameraInjectionSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device23ICameraInjectionSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device23ICameraInjectionSessionE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraInjectionSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device23ICameraInjectionSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSessionD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession25configureInjectionStreamsERKNS3_19StreamConfigurationERKNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession22getCameraDeviceSessionEPNSt3__110shared_ptrINS3_20ICameraDeviceSessionEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device24BnCameraInjectionSessionE",
   "name" : "aidl::android::hardware::camera::device::BnCameraInjectionSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device24BnCameraInjectionSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device24BnCameraInjectionSessionE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraInjectionSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device24BnCameraInjectionSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BnCameraInjectionSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BnCameraInjectionSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession25configureInjectionStreamsERKNS3_19StreamConfigurationERKNS3_14CameraMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device23ICameraInjectionSession22getCameraDeviceSessionEPNSt3__110shared_ptrINS3_20ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BnCameraInjectionSession19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BnCameraInjectionSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BnCameraInjectionSession12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device24BpCameraInjectionSessionE",
   "name" : "aidl::android::hardware::camera::device::BpCameraInjectionSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device24BpCameraInjectionSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device24BpCameraInjectionSessionE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BpCameraInjectionSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device24BpCameraInjectionSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BpCameraInjectionSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BpCameraInjectionSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BpCameraInjectionSession25configureInjectionStreamsERKNS3_19StreamConfigurationERKNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BpCameraInjectionSession22getCameraDeviceSessionEPNSt3__110shared_ptrINS3_20ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BpCameraInjectionSession19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BpCameraInjectionSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offlineStreams",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6device13OfflineStreamENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "offlineRequests",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6device14OfflineRequestENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device24CameraOfflineSessionInfoE",
   "name" : "aidl::android::hardware::camera::device::CameraOfflineSessionInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device24CameraOfflineSessionInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device24CameraOfflineSessionInfoE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/CameraOfflineSessionInfo.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device20ICameraDeviceSessionE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefaultE",
   "name" : "aidl::android::hardware::camera::device::ICameraDeviceSessionDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraDeviceSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault16configureStreamsERKNS3_19StreamConfigurationEPNSt3__16vectorINS3_9HalStreamENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault31constructDefaultRequestSettingsENS3_15RequestTemplateEPNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault5flushEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault30getCaptureRequestMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault25isReconfigurationRequiredERKNS3_14CameraMetadataES7_Pb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault21processCaptureRequestERKNSt3__16vectorINS3_14CaptureRequestENS5_9allocatorIS7_EEEERKNS6_INS3_11BufferCacheENS8_ISD_EEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault17signalStreamFlushERKNSt3__16vectorIiNS5_9allocatorIiEEEEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault15switchToOfflineERKNSt3__16vectorIiNS5_9allocatorIiEEEEPNS3_24CameraOfflineSessionInfoEPNS5_10shared_ptrINS3_21ICameraOfflineSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault19repeatingRequestEndEiRKNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device27ICameraDeviceSessionDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefaultE",
   "name" : "aidl::android::hardware::camera::device::ICameraDeviceCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraDeviceCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefault6notifyERKNSt3__16vectorINS3_9NotifyMsgENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefault20processCaptureResultERKNSt3__16vectorINS3_13CaptureResultENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefault20requestStreamBuffersERKNSt3__16vectorINS3_13BufferRequestENS5_9allocatorIS7_EEEEPNS6_INS3_15StreamBufferRetENS8_ISD_EEEEPNS3_19BufferRequestStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefault19returnStreamBuffersERKNSt3__16vectorINS3_12StreamBufferENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraDeviceCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21ICameraOfflineSessionE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefaultE",
   "name" : "aidl::android::hardware::camera::device::ICameraOfflineSessionDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraOfflineSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefault5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefault29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefault11setCallbackERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device28ICameraOfflineSessionDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device21BnCameraDeviceSessionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegatorE",
   "name" : "aidl::android::hardware::camera::device::ICameraDeviceSessionDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraDeviceSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device20ICameraDeviceSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator16configureStreamsERKNS3_19StreamConfigurationEPNSt3__16vectorINS3_9HalStreamENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator31constructDefaultRequestSettingsENS3_15RequestTemplateEPNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator5flushEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator30getCaptureRequestMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator25isReconfigurationRequiredERKNS3_14CameraMetadataES7_Pb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator21processCaptureRequestERKNSt3__16vectorINS3_14CaptureRequestENS5_9allocatorIS7_EEEERKNS6_INS3_11BufferCacheENS8_ISD_EEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator17signalStreamFlushERKNSt3__16vectorIiNS5_9allocatorIiEEEEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator15switchToOfflineERKNSt3__16vectorIiNS5_9allocatorIiEEEEPNS3_24CameraOfflineSessionInfoEPNS5_10shared_ptrINS3_21ICameraOfflineSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device29ICameraDeviceSessionDelegator19repeatingRequestEndEiRKNSt3__16vectorIiNS5_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BnCameraDeviceSession19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BnCameraDeviceSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device21BnCameraDeviceSession12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraDeviceCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegatorE",
   "name" : "aidl::android::hardware::camera::device::ICameraDeviceCallbackDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraDeviceCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraDeviceCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegator6notifyERKNSt3__16vectorINS3_9NotifyMsgENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegator20processCaptureResultERKNSt3__16vectorINS3_13CaptureResultENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegator20requestStreamBuffersERKNSt3__16vectorINS3_13BufferRequestENS5_9allocatorIS7_EEEEPNS6_INS3_15StreamBufferRetENS8_ISD_EEEEPNS3_19BufferRequestStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraDeviceCallbackDelegator19returnStreamBuffersERKNSt3__16vectorINS3_12StreamBufferENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraDeviceCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraDeviceCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraDeviceCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device23ICameraInjectionSessionE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefaultE",
   "name" : "aidl::android::hardware::camera::device::ICameraInjectionSessionDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ICameraInjectionSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefault25configureInjectionStreamsERKNS3_19StreamConfigurationERKNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefault22getCameraDeviceSessionEPNSt3__110shared_ptrINS3_20ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraInjectionSessionDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device22BnCameraOfflineSessionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device30ICameraOfflineSessionDelegatorE",
   "name" : "aidl::android::hardware::camera::device::ICameraOfflineSessionDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device30ICameraOfflineSessionDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device30ICameraOfflineSessionDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraOfflineSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device30ICameraOfflineSessionDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraOfflineSessionDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraOfflineSessionDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device21ICameraOfflineSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraOfflineSessionDelegator5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraOfflineSessionDelegator29getCaptureResultMetadataQueueEPNS1_6common3fmq12MQDescriptorIaNS6_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device30ICameraOfflineSessionDelegator11setCallbackERKNSt3__110shared_ptrINS3_21ICameraDeviceCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraOfflineSession19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraOfflineSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device22BnCameraOfflineSession12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device24BnCameraInjectionSessionE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device32ICameraInjectionSessionDelegatorE",
   "name" : "aidl::android::hardware::camera::device::ICameraInjectionSessionDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device32ICameraInjectionSessionDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device32ICameraInjectionSessionDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/BnCameraInjectionSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera6device32ICameraInjectionSessionDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device32ICameraInjectionSessionDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device32ICameraInjectionSessionDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera6device23ICameraInjectionSessionEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device32ICameraInjectionSessionDelegator25configureInjectionStreamsERKNS3_19StreamConfigurationERKNS3_14CameraMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device32ICameraInjectionSessionDelegator22getCameraDeviceSessionEPNSt3__110shared_ptrINS3_20ICameraDeviceSessionEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BnCameraInjectionSession19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BnCameraInjectionSession16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera6device24BnCameraInjectionSession12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "streamType",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device10StreamTypeE"
    },
    {
     "field_name" : "width",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PixelFormatE"
    },
    {
     "field_name" : "usage",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11BufferUsageE"
    },
    {
     "field_name" : "dataSpace",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9DataspaceE"
    },
    {
     "field_name" : "rotation",
     "field_offset" : 288,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device14StreamRotationE"
    },
    {
     "field_name" : "physicalCameraId",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "bufferSize",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "groupId",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sensorPixelModesUsed",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6camera8metadata15SensorPixelModeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "dynamicRangeProfile",
     "field_offset" : 768,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8metadata39RequestAvailableDynamicRangeProfilesMapE"
    },
    {
     "field_name" : "useCase",
     "field_offset" : 832,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8metadata29ScalerAvailableStreamUseCasesE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device6StreamE",
   "name" : "aidl::android::hardware::camera::device::Stream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device6StreamE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device6StreamE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/Stream.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "errorStreamId",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "errorCode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device9ErrorCodeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device8ErrorMsgE",
   "name" : "aidl::android::hardware::camera::device::ErrorMsg",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device8ErrorMsgE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device8ErrorMsgE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/ErrorMsg.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "overrideFormat",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11PixelFormatE"
    },
    {
     "field_name" : "producerUsage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11BufferUsageE"
    },
    {
     "field_name" : "consumerUsage",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common11BufferUsageE"
    },
    {
     "field_name" : "maxBuffers",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "overrideDataSpace",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN4aidl7android8hardware8graphics6common9DataspaceE"
    },
    {
     "field_name" : "physicalCameraId",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "supportOffline",
     "field_offset" : 448,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device9HalStreamE",
   "name" : "aidl::android::hardware::camera::device::HalStream",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device9HalStreamE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device9HalStreamE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/HalStream.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware6camera6device8ErrorMsgENS5_10ShutterMsgEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera6device9NotifyMsgE",
   "name" : "aidl::android::hardware::camera::device::NotifyMsg",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device9NotifyMsgE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera6device9NotifyMsgE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/device/aidl/android.hardware.camera.device-V1-ndk-source/gen/include/aidl/android/hardware/camera/device/NotifyMsg.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider15ICameraProviderE",
   "name" : "aidl::android::hardware::camera::provider::ICameraProvider",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider15ICameraProviderE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider15ICameraProviderE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/ICameraProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider15ICameraProviderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProviderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProviderD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider11setCallbackERKNSt3__110shared_ptrINS3_23ICameraProviderCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider13getVendorTagsEPNSt3__16vectorINS2_6common16VendorTagSectionENS5_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider15getCameraIdListEPNSt3__16vectorINS5_12basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENSA_ISC_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider24getCameraDeviceInterfaceERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS5_10shared_ptrINS2_6device13ICameraDeviceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider23notifyDeviceStateChangeEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider22getConcurrentCameraIdsEPNSt3__16vectorINS3_29ConcurrentCameraIdCombinationENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider38isConcurrentStreamCombinationSupportedERKNSt3__16vectorINS3_28CameraIdAndStreamCombinationENS5_9allocatorIS7_EEEEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider16BnCameraProviderE",
   "name" : "aidl::android::hardware::camera::provider::BnCameraProvider",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider16BnCameraProviderE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider16BnCameraProviderE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/BnCameraProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider16BnCameraProviderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BnCameraProviderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BnCameraProviderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider11setCallbackERKNSt3__110shared_ptrINS3_23ICameraProviderCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider13getVendorTagsEPNSt3__16vectorINS2_6common16VendorTagSectionENS5_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider15getCameraIdListEPNSt3__16vectorINS5_12basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENSA_ISC_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider24getCameraDeviceInterfaceERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS5_10shared_ptrINS2_6device13ICameraDeviceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider23notifyDeviceStateChangeEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider22getConcurrentCameraIdsEPNSt3__16vectorINS3_29ConcurrentCameraIdCombinationENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider15ICameraProvider38isConcurrentStreamCombinationSupportedERKNSt3__16vectorINS3_28CameraIdAndStreamCombinationENS5_9allocatorIS7_EEEEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BnCameraProvider19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BnCameraProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BnCameraProvider12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider16BpCameraProviderE",
   "name" : "aidl::android::hardware::camera::provider::BpCameraProvider",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider16BpCameraProviderE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider16BpCameraProviderE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/BpCameraProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider16BpCameraProviderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProviderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProviderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProvider11setCallbackERKNSt3__110shared_ptrINS3_23ICameraProviderCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProvider13getVendorTagsEPNSt3__16vectorINS2_6common16VendorTagSectionENS5_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProvider15getCameraIdListEPNSt3__16vectorINS5_12basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENSA_ISC_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProvider24getCameraDeviceInterfaceERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS5_10shared_ptrINS2_6device13ICameraDeviceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProvider23notifyDeviceStateChangeEl"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProvider22getConcurrentCameraIdsEPNSt3__16vectorINS3_29ConcurrentCameraIdCombinationENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProvider38isConcurrentStreamCombinationSupportedERKNSt3__16vectorINS3_28CameraIdAndStreamCombinationENS5_9allocatorIS7_EEEEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProvider19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BpCameraProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider15ICameraProviderE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider22ICameraProviderDefaultE",
   "name" : "aidl::android::hardware::camera::provider::ICameraProviderDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider22ICameraProviderDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider22ICameraProviderDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/ICameraProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider22ICameraProviderDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault11setCallbackERKNSt3__110shared_ptrINS3_23ICameraProviderCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault13getVendorTagsEPNSt3__16vectorINS2_6common16VendorTagSectionENS5_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault15getCameraIdListEPNSt3__16vectorINS5_12basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENSA_ISC_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault24getCameraDeviceInterfaceERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS5_10shared_ptrINS2_6device13ICameraDeviceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault23notifyDeviceStateChangeEl"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault22getConcurrentCameraIdsEPNSt3__16vectorINS3_29ConcurrentCameraIdCombinationENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault38isConcurrentStreamCombinationSupportedERKNSt3__16vectorINS3_28CameraIdAndStreamCombinationENS5_9allocatorIS7_EEEEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider22ICameraProviderDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackE",
   "name" : "aidl::android::hardware::camera::provider::ICameraProviderCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/ICameraProviderCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback24cameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common18CameraDeviceStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback21torchModeStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common15TorchModeStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback32physicalCameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_NS2_6common18CameraDeviceStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider24BnCameraProviderCallbackE",
   "name" : "aidl::android::hardware::camera::provider::BnCameraProviderCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider24BnCameraProviderCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider24BnCameraProviderCallbackE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/BnCameraProviderCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider24BnCameraProviderCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BnCameraProviderCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BnCameraProviderCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback24cameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common18CameraDeviceStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback21torchModeStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common15TorchModeStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider23ICameraProviderCallback32physicalCameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_NS2_6common18CameraDeviceStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BnCameraProviderCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BnCameraProviderCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BnCameraProviderCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider24BpCameraProviderCallbackE",
   "name" : "aidl::android::hardware::camera::provider::BpCameraProviderCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider24BpCameraProviderCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider24BpCameraProviderCallbackE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/BpCameraProviderCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider24BpCameraProviderCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BpCameraProviderCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BpCameraProviderCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BpCameraProviderCallback24cameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common18CameraDeviceStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BpCameraProviderCallback21torchModeStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common15TorchModeStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BpCameraProviderCallback32physicalCameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_NS2_6common18CameraDeviceStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BpCameraProviderCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BpCameraProviderCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider16BnCameraProviderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware6camera8provider15ICameraProviderEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider24ICameraProviderDelegatorE",
   "name" : "aidl::android::hardware::camera::provider::ICameraProviderDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider24ICameraProviderDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider24ICameraProviderDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/BnCameraProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider24ICameraProviderDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24ICameraProviderDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24ICameraProviderDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider15ICameraProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24ICameraProviderDelegator11setCallbackERKNSt3__110shared_ptrINS3_23ICameraProviderCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24ICameraProviderDelegator13getVendorTagsEPNSt3__16vectorINS2_6common16VendorTagSectionENS5_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24ICameraProviderDelegator15getCameraIdListEPNSt3__16vectorINS5_12basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENSA_ISC_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24ICameraProviderDelegator24getCameraDeviceInterfaceERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEEPNS5_10shared_ptrINS2_6device13ICameraDeviceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24ICameraProviderDelegator23notifyDeviceStateChangeEl"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24ICameraProviderDelegator22getConcurrentCameraIdsEPNSt3__16vectorINS3_29ConcurrentCameraIdCombinationENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24ICameraProviderDelegator38isConcurrentStreamCombinationSupportedERKNSt3__16vectorINS3_28CameraIdAndStreamCombinationENS5_9allocatorIS7_EEEEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BnCameraProvider19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BnCameraProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider16BnCameraProvider12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cameraId",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "streamConfiguration",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera6device19StreamConfigurationE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider28CameraIdAndStreamCombinationE",
   "name" : "aidl::android::hardware::camera::provider::CameraIdAndStreamCombination",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider28CameraIdAndStreamCombinationE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider28CameraIdAndStreamCombinationE",
   "size" : 88,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/CameraIdAndStreamCombination.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "combination",
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider29ConcurrentCameraIdCombinationE",
   "name" : "aidl::android::hardware::camera::provider::ConcurrentCameraIdCombination",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider29ConcurrentCameraIdCombinationE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider29ConcurrentCameraIdCombinationE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/ConcurrentCameraIdCombination.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefaultE",
   "name" : "aidl::android::hardware::camera::provider::ICameraProviderCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/ICameraProviderCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefault24cameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common18CameraDeviceStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefault21torchModeStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common15TorchModeStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefault32physicalCameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_NS2_6common18CameraDeviceStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider30ICameraProviderCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider24BnCameraProviderCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6camera8provider32ICameraProviderCallbackDelegatorE",
   "name" : "aidl::android::hardware::camera::provider::ICameraProviderCallbackDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6camera8provider32ICameraProviderCallbackDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware6camera8provider32ICameraProviderCallbackDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/camera/provider/aidl/android.hardware.camera.provider-V1-ndk-source/gen/include/aidl/android/hardware/camera/provider/BnCameraProviderCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6camera8provider32ICameraProviderCallbackDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider32ICameraProviderCallbackDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider32ICameraProviderCallbackDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6camera8provider23ICameraProviderCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider32ICameraProviderCallbackDelegator24cameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common18CameraDeviceStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider32ICameraProviderCallbackDelegator21torchModeStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_6common15TorchModeStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider32ICameraProviderCallbackDelegator32physicalCameraDeviceStatusChangeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_NS2_6common18CameraDeviceStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BnCameraProviderCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BnCameraProviderCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6camera8provider24BnCameraProviderCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds",
     "referenced_type" : "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE"
    },
    {
     "field_name" : "ints",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "name" : "aidl::android::hardware::common::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "self_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/aidl/android.hardware.common-V2-ndk-source/gen/include/aidl/android/hardware/common/NativeHandle.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fdIndex",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "extent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common3fmq17GrantorDescriptorE",
   "name" : "aidl::android::hardware::common::fmq::GrantorDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common3fmq17GrantorDescriptorE",
   "self_type" : "_ZTIN4aidl7android8hardware6common3fmq17GrantorDescriptorE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/fmq/aidl/android.hardware.common.fmq-V1-ndk-source/gen/include/aidl/android/hardware/common/fmq/GrantorDescriptor.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<ndk::ScopedFileDescriptor, std::allocator<ndk::ScopedFileDescriptor>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6camera6common9VendorTagENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::camera::common::VendorTag, std::allocator<aidl::android::hardware::camera::common::VendorTag>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6camera6common9VendorTagENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6camera6common9VendorTagENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6common9VendorTagENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6camera6device12StreamBufferENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::camera::device::StreamBuffer, std::allocator<aidl::android::hardware::camera::device::StreamBuffer>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6camera6device12StreamBufferENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6camera6device12StreamBufferENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware6camera6device12StreamBufferENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6camera6device13OfflineStreamENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::camera::device::OfflineStream, std::allocator<aidl::android::hardware::camera::device::OfflineStream>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6camera6device13OfflineStreamENS3_9allocatorISA_EEEEEE",
