{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {

   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long long, std::allocator<unsigned long long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/IRadioNetworkIndication.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network13IRadioNetworkE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::radio::network::IRadioNetwork>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio7network13IRadioNetworkE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork28getAllowedNetworkTypesBitmapEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork21getAvailableBandModesEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork20getAvailableNetworksEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork14getBarringInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24getCdmaRoamingPreferenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15getCellInfoListEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24getDataRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getImsRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getNetworkSelectionModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork11getOperatorEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork17getSignalStrengthEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26getSystemSelectionChannelsEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getVoiceRadioTechnologyEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork25getVoiceRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork27isNrDualConnectivityEnabledEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23responseAcknowledgementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork28setAllowedNetworkTypesBitmapEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork11setBandModeEiNS3_13RadioBandModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork18setBarringPasswordEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_SD_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24setCdmaRoamingPreferenceEiNS3_15CdmaRoamingTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19setCellInfoListRateEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19setIndicationFilterEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork32setLinkCapacityReportingCriteriaEiiiiRKNSt3__16vectorIiNS5_9allocatorIiEEEESB_NS2_13AccessNetworkE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork18setLocationUpdatesEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork32setNetworkSelectionModeAutomaticEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork29setNetworkSelectionModeManualEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_13AccessNetworkE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26setNrDualConnectivityStateEiNS3_23NrDualConnectivityStateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork20setResponseFunctionsERKNSt3__110shared_ptrINS3_21IRadioNetworkResponseEEERKNS6_INS3_23IRadioNetworkIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork34setSignalStrengthReportingCriteriaEiRKNSt3__16vectorINS3_19SignalThresholdInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork27setSuppServiceNotificationsEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26setSystemSelectionChannelsEibRKNSt3__16vectorINS3_20RadioAccessSpecifierENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork16startNetworkScanEiRKNS3_18NetworkScanRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15stopNetworkScanEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork30supplyNetworkDepersonalizationEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15setUsageSettingEiNS3_12UsageSettingE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15getUsageSettingEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network21IRadioNetworkResponseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::radio::network::IRadioNetworkResponse>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio7network21IRadioNetworkResponseE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse18acknowledgeRequestEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse36getAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse29getAvailableBandModesResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_13RadioBandModeENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse28getAvailableNetworksResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_12OperatorInfoENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse22getBarringInfoResponseERKNS2_17RadioResponseInfoERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENSB_9allocatorISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32getCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoENS3_15CdmaRoamingTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23getCellInfoListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_8CellInfoENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32getDataRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getImsRegistrationStateResponseERKNS2_17RadioResponseInfoEbNS2_21RadioTechnologyFamilyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getNetworkSelectionModeResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19getOperatorResponseERKNS2_17RadioResponseInfoERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEESG_SG_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse25getSignalStrengthResponseERKNS2_17RadioResponseInfoERKNS3_14SignalStrengthE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34getSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_20RadioAccessSpecifierENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getVoiceRadioTechnologyResponseERKNS2_17RadioResponseInfoENS2_15RadioTechnologyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse33getVoiceRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse35isNrDualConnectivityEnabledResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse36setAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19setBandModeResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse26setBarringPasswordResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32setCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse27setCellInfoListRateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse27setIndicationFilterResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse40setLinkCapacityReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse26setLocationUpdatesResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse40setNetworkSelectionModeAutomaticResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse37setNetworkSelectionModeManualResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34setNrDualConnectivityStateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse42setSignalStrengthReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse35setSuppServiceNotificationsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34setSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse24startNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23stopNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse38supplyNetworkDepersonalizationResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23setUsageSettingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23getUsageSettingResponseERKNS2_17RadioResponseInfoENS3_12UsageSettingE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::radio::network::IRadioNetworkIndication>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication18barringInfoChangedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENS9_9allocatorISB_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication14cdmaPrlChangedENS2_19RadioIndicationTypeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication12cellInfoListENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_8CellInfoENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication27currentLinkCapacityEstimateENS2_19RadioIndicationTypeERKNS3_20LinkCapacityEstimateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication29currentPhysicalChannelConfigsENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_21PhysicalChannelConfigENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication21currentSignalStrengthENS2_19RadioIndicationTypeERKNS3_14SignalStrengthE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication22imsNetworkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication17networkScanResultENS2_19RadioIndicationTypeERKNS3_17NetworkScanResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication19networkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication16nitzTimeReceivedENS2_19RadioIndicationTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEExx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication18registrationFailedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__112basic_stringIcNS9_11char_traitsIcEENS9_9allocatorIcEEEEiii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication22restrictedStateChangedENS2_19RadioIndicationTypeENS3_20PhoneRestrictedStateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication13suppSvcNotifyENS2_19RadioIndicationTypeERKNS3_19SuppSvcNotificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication21voiceRadioTechChangedENS2_19RadioIndicationTypeENS2_15RadioTechnologyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network13IRadioNetworkE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::radio::network::IRadioNetwork>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio7network13IRadioNetworkE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork28getAllowedNetworkTypesBitmapEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork21getAvailableBandModesEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork20getAvailableNetworksEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork14getBarringInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24getCdmaRoamingPreferenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15getCellInfoListEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24getDataRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getImsRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getNetworkSelectionModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork11getOperatorEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork17getSignalStrengthEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26getSystemSelectionChannelsEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getVoiceRadioTechnologyEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork25getVoiceRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork27isNrDualConnectivityEnabledEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23responseAcknowledgementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork28setAllowedNetworkTypesBitmapEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork11setBandModeEiNS3_13RadioBandModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork18setBarringPasswordEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_SD_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24setCdmaRoamingPreferenceEiNS3_15CdmaRoamingTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19setCellInfoListRateEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19setIndicationFilterEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork32setLinkCapacityReportingCriteriaEiiiiRKNSt3__16vectorIiNS5_9allocatorIiEEEESB_NS2_13AccessNetworkE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork18setLocationUpdatesEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork32setNetworkSelectionModeAutomaticEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork29setNetworkSelectionModeManualEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_13AccessNetworkE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26setNrDualConnectivityStateEiNS3_23NrDualConnectivityStateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork20setResponseFunctionsERKNSt3__110shared_ptrINS3_21IRadioNetworkResponseEEERKNS6_INS3_23IRadioNetworkIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork34setSignalStrengthReportingCriteriaEiRKNSt3__16vectorINS3_19SignalThresholdInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork27setSuppServiceNotificationsEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26setSystemSelectionChannelsEibRKNSt3__16vectorINS3_20RadioAccessSpecifierENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork16startNetworkScanEiRKNS3_18NetworkScanRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15stopNetworkScanEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork30supplyNetworkDepersonalizationEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15setUsageSettingEiNS3_12UsageSettingE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15getUsageSettingEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network21IRadioNetworkResponseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::radio::network::IRadioNetworkResponse>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio7network21IRadioNetworkResponseE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse18acknowledgeRequestEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse36getAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse29getAvailableBandModesResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_13RadioBandModeENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse28getAvailableNetworksResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_12OperatorInfoENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse22getBarringInfoResponseERKNS2_17RadioResponseInfoERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENSB_9allocatorISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32getCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoENS3_15CdmaRoamingTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23getCellInfoListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_8CellInfoENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32getDataRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getImsRegistrationStateResponseERKNS2_17RadioResponseInfoEbNS2_21RadioTechnologyFamilyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getNetworkSelectionModeResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19getOperatorResponseERKNS2_17RadioResponseInfoERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEESG_SG_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse25getSignalStrengthResponseERKNS2_17RadioResponseInfoERKNS3_14SignalStrengthE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34getSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_20RadioAccessSpecifierENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getVoiceRadioTechnologyResponseERKNS2_17RadioResponseInfoENS2_15RadioTechnologyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse33getVoiceRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse35isNrDualConnectivityEnabledResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse36setAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19setBandModeResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse26setBarringPasswordResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32setCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse27setCellInfoListRateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse27setIndicationFilterResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse40setLinkCapacityReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse26setLocationUpdatesResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse40setNetworkSelectionModeAutomaticResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse37setNetworkSelectionModeManualResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34setNrDualConnectivityStateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse42setSignalStrengthReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse35setSuppServiceNotificationsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34setSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse24startNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23stopNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse38supplyNetworkDepersonalizationResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23setUsageSettingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23getUsageSettingResponseERKNS2_17RadioResponseInfoENS3_12UsageSettingE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::radio::network::IRadioNetworkIndication>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication18barringInfoChangedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENS9_9allocatorISB_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication14cdmaPrlChangedENS2_19RadioIndicationTypeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication12cellInfoListENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_8CellInfoENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication27currentLinkCapacityEstimateENS2_19RadioIndicationTypeERKNS3_20LinkCapacityEstimateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication29currentPhysicalChannelConfigsENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_21PhysicalChannelConfigENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication21currentSignalStrengthENS2_19RadioIndicationTypeERKNS3_14SignalStrengthE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication22imsNetworkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication17networkScanResultENS2_19RadioIndicationTypeERKNS3_17NetworkScanResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication19networkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication16nitzTimeReceivedENS2_19RadioIndicationTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEExx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication18registrationFailedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__112basic_stringIcNS9_11char_traitsIcEENS9_9allocatorIcEEEEiii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication22restrictedStateChangedENS2_19RadioIndicationTypeENS3_20PhoneRestrictedStateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication13suppSvcNotifyENS2_19RadioIndicationTypeERKNS3_19SuppSvcNotificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication21voiceRadioTechChangedENS2_19RadioIndicationTypeENS2_15RadioTechnologyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio17RadioResponseTypeE"
    },
    {
     "field_name" : "serial",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "error",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio10RadioErrorE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio17RadioResponseInfoE",
   "name" : "aidl::android::hardware::radio::RadioResponseInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio17RadioResponseInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio17RadioResponseInfoE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio-V1-ndk-source/gen/include/aidl/android/hardware/radio/RadioResponseInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cellIdentityNr",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network14CellIdentityNrE"
    },
    {
     "field_name" : "signalStrengthNr",
     "field_offset" : 864,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network16NrSignalStrengthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network10CellInfoNrE",
   "name" : "aidl::android::hardware::radio::network::CellInfoNr",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network10CellInfoNrE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network10CellInfoNrE",
   "size" : 148,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellInfoNr.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "vopsSupported",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "emcSupported",
     "field_offset" : 8,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "emfSupported",
     "field_offset" : 16,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network10NrVopsInfoE",
   "name" : "aidl::android::hardware::radio::network::NrVopsInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network10NrVopsInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network10NrVopsInfoE",
   "size" : 3,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/NrVopsInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "serviceType",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "barringType",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "barringTypeSpecificInfo",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware5radio7network23BarringTypeSpecificInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network11BarringInfoE",
   "name" : "aidl::android::hardware::radio::network::BarringInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network11BarringInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network11BarringInfoE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BarringInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cellIdentityGsm",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network15CellIdentityGsmE"
    },
    {
     "field_name" : "signalStrengthGsm",
     "field_offset" : 736,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network17GsmSignalStrengthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network11CellInfoGsmE",
   "name" : "aidl::android::hardware::radio::network::CellInfoGsm",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network11CellInfoGsmE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network11CellInfoGsmE",
   "size" : 104,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellInfoGsm.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cellIdentityLte",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network15CellIdentityLteE"
    },
    {
     "field_name" : "signalStrengthLte",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network17LteSignalStrengthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network11CellInfoLteE",
   "name" : "aidl::android::hardware::radio::network::CellInfoLte",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network11CellInfoLteE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network11CellInfoLteE",
   "size" : 160,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellInfoLte.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lastHopCapacityKbps",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "confidenceLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "lceSuspended",
     "field_offset" : 40,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network11LceDataInfoE",
   "name" : "aidl::android::hardware::radio::network::LceDataInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network11LceDataInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network11LceDataInfoE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/LceDataInfo.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "isVopsSupported",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "isEmcBearerSupported",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network11LteVopsInfoE",
   "name" : "aidl::android::hardware::radio::network::LteVopsInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network11LteVopsInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network11LteVopsInfoE",
   "size" : 2,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/LteVopsInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbN4aidl7android8hardware5radio7network15CellIdentityGsmENS5_17CellIdentityWcdmaENS5_19CellIdentityTdscdmaENS5_16CellIdentityCdmaENS5_15CellIdentityLteENS5_14CellIdentityNrEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network12CellIdentityE",
   "name" : "aidl::android::hardware::radio::network::CellIdentity",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12CellIdentityE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network12CellIdentityE",
   "size" : 136,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellIdentity.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cellIdentityCdma",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network16CellIdentityCdmaE"
    },
    {
     "field_name" : "signalStrengthCdma",
     "field_offset" : 480,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network18CdmaSignalStrengthE"
    },
    {
     "field_name" : "signalStrengthEvdo",
     "field_offset" : 544,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network18EvdoSignalStrengthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network12CellInfoCdmaE",
   "name" : "aidl::android::hardware::radio::network::CellInfoCdma",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12CellInfoCdmaE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network12CellInfoCdmaE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellInfoCdma.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "isEndcAvailable",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "isDcNrRestricted",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "isNrAvailable",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network12NrIndicatorsE",
   "name" : "aidl::android::hardware::radio::network::NrIndicators",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12NrIndicatorsE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network12NrIndicatorsE",
   "size" : 3,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/NrIndicators.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alphaLong",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "alphaShort",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "operatorNumeric",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "status",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network12OperatorInfoE",
   "name" : "aidl::android::hardware::radio::network::OperatorInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12OperatorInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network12OperatorInfoE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/OperatorInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cellIdentityWcdma",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network17CellIdentityWcdmaE"
    },
    {
     "field_name" : "signalStrengthWcdma",
     "field_offset" : 928,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network19WcdmaSignalStrengthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network13CellInfoWcdmaE",
   "name" : "aidl::android::hardware::radio::network::CellInfoWcdma",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network13CellInfoWcdmaE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network13CellInfoWcdmaE",
   "size" : 132,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellInfoWcdma.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network13IRadioNetworkE",
   "name" : "aidl::android::hardware::radio::network::IRadioNetwork",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network13IRadioNetworkE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network13IRadioNetworkE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/IRadioNetwork.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network13IRadioNetworkE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetworkD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetworkD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork28getAllowedNetworkTypesBitmapEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork21getAvailableBandModesEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork20getAvailableNetworksEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork14getBarringInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24getCdmaRoamingPreferenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15getCellInfoListEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24getDataRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getImsRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getNetworkSelectionModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork11getOperatorEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork17getSignalStrengthEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26getSystemSelectionChannelsEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getVoiceRadioTechnologyEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork25getVoiceRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork27isNrDualConnectivityEnabledEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23responseAcknowledgementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork28setAllowedNetworkTypesBitmapEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork11setBandModeEiNS3_13RadioBandModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork18setBarringPasswordEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_SD_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24setCdmaRoamingPreferenceEiNS3_15CdmaRoamingTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19setCellInfoListRateEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19setIndicationFilterEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork32setLinkCapacityReportingCriteriaEiiiiRKNSt3__16vectorIiNS5_9allocatorIiEEEESB_NS2_13AccessNetworkE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork18setLocationUpdatesEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork32setNetworkSelectionModeAutomaticEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork29setNetworkSelectionModeManualEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_13AccessNetworkE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26setNrDualConnectivityStateEiNS3_23NrDualConnectivityStateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork20setResponseFunctionsERKNSt3__110shared_ptrINS3_21IRadioNetworkResponseEEERKNS6_INS3_23IRadioNetworkIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork34setSignalStrengthReportingCriteriaEiRKNSt3__16vectorINS3_19SignalThresholdInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork27setSuppServiceNotificationsEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26setSystemSelectionChannelsEibRKNSt3__16vectorINS3_20RadioAccessSpecifierENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork16startNetworkScanEiRKNS3_18NetworkScanRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15stopNetworkScanEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork30supplyNetworkDepersonalizationEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15setUsageSettingEiNS3_12UsageSettingE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15getUsageSettingEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network14BnRadioNetworkE",
   "name" : "aidl::android::hardware::radio::network::BnRadioNetwork",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network14BnRadioNetworkE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network14BnRadioNetworkE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BnRadioNetwork.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network14BnRadioNetworkE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BnRadioNetworkD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BnRadioNetworkD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork28getAllowedNetworkTypesBitmapEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork21getAvailableBandModesEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork20getAvailableNetworksEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork14getBarringInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24getCdmaRoamingPreferenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15getCellInfoListEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24getDataRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getImsRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getNetworkSelectionModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork11getOperatorEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork17getSignalStrengthEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26getSystemSelectionChannelsEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23getVoiceRadioTechnologyEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork25getVoiceRegistrationStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork27isNrDualConnectivityEnabledEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork23responseAcknowledgementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork28setAllowedNetworkTypesBitmapEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork11setBandModeEiNS3_13RadioBandModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork18setBarringPasswordEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_SD_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork24setCdmaRoamingPreferenceEiNS3_15CdmaRoamingTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19setCellInfoListRateEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork19setIndicationFilterEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork32setLinkCapacityReportingCriteriaEiiiiRKNSt3__16vectorIiNS5_9allocatorIiEEEESB_NS2_13AccessNetworkE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork18setLocationUpdatesEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork32setNetworkSelectionModeAutomaticEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork29setNetworkSelectionModeManualEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_13AccessNetworkE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26setNrDualConnectivityStateEiNS3_23NrDualConnectivityStateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork20setResponseFunctionsERKNSt3__110shared_ptrINS3_21IRadioNetworkResponseEEERKNS6_INS3_23IRadioNetworkIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork34setSignalStrengthReportingCriteriaEiRKNSt3__16vectorINS3_19SignalThresholdInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork27setSuppServiceNotificationsEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork26setSystemSelectionChannelsEibRKNSt3__16vectorINS3_20RadioAccessSpecifierENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork16startNetworkScanEiRKNS3_18NetworkScanRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15stopNetworkScanEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork30supplyNetworkDepersonalizationEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15setUsageSettingEiNS3_12UsageSettingE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network13IRadioNetwork15getUsageSettingEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BnRadioNetwork19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BnRadioNetwork16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BnRadioNetwork12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network14BpRadioNetworkE",
   "name" : "aidl::android::hardware::radio::network::BpRadioNetwork",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network14BpRadioNetworkE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network14BpRadioNetworkE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BpRadioNetwork.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network14BpRadioNetworkE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetworkD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetworkD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork28getAllowedNetworkTypesBitmapEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork21getAvailableBandModesEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork20getAvailableNetworksEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork14getBarringInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork24getCdmaRoamingPreferenceEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork15getCellInfoListEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork24getDataRegistrationStateEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork23getImsRegistrationStateEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork23getNetworkSelectionModeEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork11getOperatorEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork17getSignalStrengthEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork26getSystemSelectionChannelsEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork23getVoiceRadioTechnologyEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork25getVoiceRegistrationStateEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork27isNrDualConnectivityEnabledEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork23responseAcknowledgementEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork28setAllowedNetworkTypesBitmapEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork11setBandModeEiNS3_13RadioBandModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork18setBarringPasswordEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_SD_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork24setCdmaRoamingPreferenceEiNS3_15CdmaRoamingTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork19setCellInfoListRateEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork19setIndicationFilterEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork32setLinkCapacityReportingCriteriaEiiiiRKNSt3__16vectorIiNS5_9allocatorIiEEEESB_NS2_13AccessNetworkE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork18setLocationUpdatesEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork32setNetworkSelectionModeAutomaticEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork29setNetworkSelectionModeManualEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_13AccessNetworkE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork26setNrDualConnectivityStateEiNS3_23NrDualConnectivityStateE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork20setResponseFunctionsERKNSt3__110shared_ptrINS3_21IRadioNetworkResponseEEERKNS6_INS3_23IRadioNetworkIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork34setSignalStrengthReportingCriteriaEiRKNSt3__16vectorINS3_19SignalThresholdInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork27setSuppServiceNotificationsEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork26setSystemSelectionChannelsEibRKNSt3__16vectorINS3_20RadioAccessSpecifierENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork16startNetworkScanEiRKNS3_18NetworkScanRequestE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork15stopNetworkScanEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork30supplyNetworkDepersonalizationEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork15setUsageSettingEiNS3_12UsageSettingE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork15getUsageSettingEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BpRadioNetwork16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mcc",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "mnc",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "nci",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "pci",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tac",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nrarfcn",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "operatorNames",
     "field_offset" : 352,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12OperatorInfoE"
    },
    {
     "field_name" : "additionalPlmns",
     "field_offset" : 672,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "field_name" : "bands",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio7network10NgranBandsENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network14CellIdentityNrE",
   "name" : "aidl::android::hardware::radio::network::CellIdentityNr",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network14CellIdentityNrE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network14CellIdentityNrE",
   "size" : 108,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellIdentityNr.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regState",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network8RegStateE"
    },
    {
     "field_name" : "rat",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio15RadioTechnologyE"
    },
    {
     "field_name" : "reasonForDenial",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network21RegistrationFailCauseE"
    },
    {
     "field_name" : "cellIdentity",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12CellIdentityE"
    },
    {
     "field_name" : "registeredPlmn",
     "field_offset" : 1184,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "accessTechnologySpecificInfo",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network28AccessTechnologySpecificInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network14RegStateResultE",
   "name" : "aidl::android::hardware::radio::network::RegStateResult",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network14RegStateResultE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network14RegStateResultE",
   "size" : 180,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/RegStateResult.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gsm",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network17GsmSignalStrengthE"
    },
    {
     "field_name" : "cdma",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network18CdmaSignalStrengthE"
    },
    {
     "field_name" : "evdo",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network18EvdoSignalStrengthE"
    },
    {
     "field_name" : "lte",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network17LteSignalStrengthE"
    },
    {
     "field_name" : "tdscdma",
     "field_offset" : 480,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network21TdscdmaSignalStrengthE"
    },
    {
     "field_name" : "wcdma",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network19WcdmaSignalStrengthE"
    },
    {
     "field_name" : "nr",
     "field_offset" : 704,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network16NrSignalStrengthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network14SignalStrengthE",
   "name" : "aidl::android::hardware::radio::network::SignalStrength",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network14SignalStrengthE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network14SignalStrengthE",
   "size" : 128,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/SignalStrength.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mcc",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "mnc",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "lac",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "arfcn",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bsic",
     "field_offset" : 288,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "operatorNames",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12OperatorInfoE"
    },
    {
     "field_name" : "additionalPlmns",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network15CellIdentityGsmE",
   "name" : "aidl::android::hardware::radio::network::CellIdentityGsm",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network15CellIdentityGsmE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network15CellIdentityGsmE",
   "size" : 92,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellIdentityGsm.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mcc",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "mnc",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "ci",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pci",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tac",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "earfcn",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "operatorNames",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12OperatorInfoE"
    },
    {
     "field_name" : "bandwidth",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "additionalPlmns",
     "field_offset" : 672,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "field_name" : "csgInfo",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware5radio7network25ClosedSubscriberGroupInfoEEE"
    },
    {
     "field_name" : "bands",
     "field_offset" : 960,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio7network11EutranBandsENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network15CellIdentityLteE",
   "name" : "aidl::android::hardware::radio::network::CellIdentityLte",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network15CellIdentityLteE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network15CellIdentityLteE",
   "size" : 132,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellIdentityLte.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cellIdentityTdscdma",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network19CellIdentityTdscdmaE"
    },
    {
     "field_name" : "signalStrengthTdscdma",
     "field_offset" : 928,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network21TdscdmaSignalStrengthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network15CellInfoTdscdmaE",
   "name" : "aidl::android::hardware::radio::network::CellInfoTdscdma",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network15CellInfoTdscdmaE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network15CellInfoTdscdmaE",
   "size" : 128,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellInfoTdscdma.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "networkId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "systemId",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "baseStationId",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "longitude",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "latitude",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "operatorNames",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12OperatorInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network16CellIdentityCdmaE",
   "name" : "aidl::android::hardware::radio::network::CellIdentityCdma",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network16CellIdentityCdmaE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network16CellIdentityCdmaE",
   "size" : 60,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellIdentityCdma.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ssRsrp",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssRsrq",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssSinr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "csiRsrp",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "csiRsrq",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "csiSinr",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "csiCqiTableIndex",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "csiCqiReport",
     "field_offset" : 224,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network16NrSignalStrengthE",
   "name" : "aidl::android::hardware::radio::network::NrSignalStrength",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network16NrSignalStrengthE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network16NrSignalStrengthE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/NrSignalStrength.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mcc",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "mnc",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "lac",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "psc",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uarfcn",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "operatorNames",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12OperatorInfoE"
    },
    {
     "field_name" : "additionalPlmns",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "field_name" : "csgInfo",
     "field_offset" : 736,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware5radio7network25ClosedSubscriberGroupInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network17CellIdentityWcdmaE",
   "name" : "aidl::android::hardware::radio::network::CellIdentityWcdma",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network17CellIdentityWcdmaE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network17CellIdentityWcdmaE",
   "size" : 116,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellIdentityWcdma.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "signalStrength",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bitErrorRate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timingAdvance",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network17GsmSignalStrengthE",
   "name" : "aidl::android::hardware::radio::network::GsmSignalStrength",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network17GsmSignalStrengthE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network17GsmSignalStrengthE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/GsmSignalStrength.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "signalStrength",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rsrp",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rsrq",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rssnr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cqi",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timingAdvance",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cqiTableIndex",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network17LteSignalStrengthE",
   "name" : "aidl::android::hardware::radio::network::LteSignalStrength",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network17LteSignalStrengthE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network17LteSignalStrengthE",
   "size" : 28,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/LteSignalStrength.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "status",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "error",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio10RadioErrorE"
    },
    {
     "field_name" : "networkInfos",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio7network8CellInfoENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network17NetworkScanResultE",
   "name" : "aidl::android::hardware::radio::network::NetworkScanResult",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network17NetworkScanResultE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network17NetworkScanResultE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/NetworkScanResult.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dbm",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ecio",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network18CdmaSignalStrengthE",
   "name" : "aidl::android::hardware::radio::network::CdmaSignalStrength",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network18CdmaSignalStrengthE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network18CdmaSignalStrengthE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CdmaSignalStrength.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dbm",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ecio",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "signalNoiseRatio",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network18EvdoSignalStrengthE",
   "name" : "aidl::android::hardware::radio::network::EvdoSignalStrength",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network18EvdoSignalStrengthE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network18EvdoSignalStrengthE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/EvdoSignalStrength.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "interval",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "specifiers",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio7network20RadioAccessSpecifierENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "maxSearchTime",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "incrementalResults",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "incrementalResultsPeriodicity",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mccMncs",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network18NetworkScanRequestE",
   "name" : "aidl::android::hardware::radio::network::NetworkScanRequest",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network18NetworkScanRequestE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network18NetworkScanRequestE",
   "size" : 44,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/NetworkScanRequest.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mcc",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "mnc",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "lac",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cpid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uarfcn",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "operatorNames",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12OperatorInfoE"
    },
    {
     "field_name" : "additionalPlmns",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "field_name" : "csgInfo",
     "field_offset" : 736,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware5radio7network25ClosedSubscriberGroupInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network19CellIdentityTdscdmaE",
   "name" : "aidl::android::hardware::radio::network::CellIdentityTdscdma",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network19CellIdentityTdscdmaE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network19CellIdentityTdscdmaE",
   "size" : 116,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellIdentityTdscdma.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "signalMeasurement",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "hysteresisMs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "hysteresisDb",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "thresholds",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "isEnabled",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "ran",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio13AccessNetworkE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network19SignalThresholdInfoE",
   "name" : "aidl::android::hardware::radio::network::SignalThresholdInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network19SignalThresholdInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network19SignalThresholdInfoE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/SignalThresholdInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "isMT",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "index",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "number",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network19SuppSvcNotificationE",
   "name" : "aidl::android::hardware::radio::network::SuppSvcNotification",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network19SuppSvcNotificationE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network19SuppSvcNotificationE",
   "size" : 28,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/SuppSvcNotification.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "signalStrength",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bitErrorRate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rscp",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ecno",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network19WcdmaSignalStrengthE",
   "name" : "aidl::android::hardware::radio::network::WcdmaSignalStrength",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network19WcdmaSignalStrengthE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network19WcdmaSignalStrengthE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/WcdmaSignalStrength.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network13IRadioNetworkE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network20IRadioNetworkDefaultE",
   "name" : "aidl::android::hardware::radio::network::IRadioNetworkDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network20IRadioNetworkDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network20IRadioNetworkDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/IRadioNetwork.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network20IRadioNetworkDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault28getAllowedNetworkTypesBitmapEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault21getAvailableBandModesEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault20getAvailableNetworksEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault14getBarringInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault24getCdmaRoamingPreferenceEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault15getCellInfoListEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault24getDataRegistrationStateEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault23getImsRegistrationStateEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault23getNetworkSelectionModeEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault11getOperatorEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault17getSignalStrengthEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault26getSystemSelectionChannelsEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault23getVoiceRadioTechnologyEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault25getVoiceRegistrationStateEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault27isNrDualConnectivityEnabledEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault23responseAcknowledgementEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault28setAllowedNetworkTypesBitmapEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault11setBandModeEiNS3_13RadioBandModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault18setBarringPasswordEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_SD_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault24setCdmaRoamingPreferenceEiNS3_15CdmaRoamingTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault19setCellInfoListRateEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault19setIndicationFilterEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault32setLinkCapacityReportingCriteriaEiiiiRKNSt3__16vectorIiNS5_9allocatorIiEEEESB_NS2_13AccessNetworkE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault18setLocationUpdatesEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault32setNetworkSelectionModeAutomaticEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault29setNetworkSelectionModeManualEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_13AccessNetworkE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault26setNrDualConnectivityStateEiNS3_23NrDualConnectivityStateE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault20setResponseFunctionsERKNSt3__110shared_ptrINS3_21IRadioNetworkResponseEEERKNS6_INS3_23IRadioNetworkIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault34setSignalStrengthReportingCriteriaEiRKNSt3__16vectorINS3_19SignalThresholdInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault27setSuppServiceNotificationsEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault26setSystemSelectionChannelsEibRKNSt3__16vectorINS3_20RadioAccessSpecifierENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault16startNetworkScanEiRKNS3_18NetworkScanRequestE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault15stopNetworkScanEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault30supplyNetworkDepersonalizationEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault15setUsageSettingEiNS3_12UsageSettingE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault15getUsageSettingEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network20IRadioNetworkDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "downlinkCapacityKbps",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uplinkCapacityKbps",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "secondaryDownlinkCapacityKbps",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "secondaryUplinkCapacityKbps",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network20LinkCapacityEstimateE",
   "name" : "aidl::android::hardware::radio::network::LinkCapacityEstimate",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network20LinkCapacityEstimateE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network20LinkCapacityEstimateE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/LinkCapacityEstimate.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "accessNetwork",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio13AccessNetworkE"
    },
    {
     "field_name" : "bands",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network25RadioAccessSpecifierBandsE"
    },
    {
     "field_name" : "channels",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network20RadioAccessSpecifierE",
   "name" : "aidl::android::hardware::radio::network::RadioAccessSpecifier",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network20RadioAccessSpecifierE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network20RadioAccessSpecifierE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/RadioAccessSpecifier.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network21IRadioNetworkResponseE",
   "name" : "aidl::android::hardware::radio::network::IRadioNetworkResponse",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network21IRadioNetworkResponseE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network21IRadioNetworkResponseE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/IRadioNetworkResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network21IRadioNetworkResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponseD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse18acknowledgeRequestEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse36getAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse29getAvailableBandModesResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_13RadioBandModeENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse28getAvailableNetworksResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_12OperatorInfoENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse22getBarringInfoResponseERKNS2_17RadioResponseInfoERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENSB_9allocatorISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32getCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoENS3_15CdmaRoamingTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23getCellInfoListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_8CellInfoENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32getDataRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getImsRegistrationStateResponseERKNS2_17RadioResponseInfoEbNS2_21RadioTechnologyFamilyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getNetworkSelectionModeResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19getOperatorResponseERKNS2_17RadioResponseInfoERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEESG_SG_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse25getSignalStrengthResponseERKNS2_17RadioResponseInfoERKNS3_14SignalStrengthE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34getSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_20RadioAccessSpecifierENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getVoiceRadioTechnologyResponseERKNS2_17RadioResponseInfoENS2_15RadioTechnologyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse33getVoiceRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse35isNrDualConnectivityEnabledResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse36setAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19setBandModeResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse26setBarringPasswordResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32setCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse27setCellInfoListRateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse27setIndicationFilterResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse40setLinkCapacityReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse26setLocationUpdatesResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse40setNetworkSelectionModeAutomaticResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse37setNetworkSelectionModeManualResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34setNrDualConnectivityStateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse42setSignalStrengthReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse35setSuppServiceNotificationsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34setSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse24startNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23stopNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse38supplyNetworkDepersonalizationResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23setUsageSettingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23getUsageSettingResponseERKNS2_17RadioResponseInfoENS3_12UsageSettingE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "status",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network20CellConnectionStatusE"
    },
    {
     "field_name" : "rat",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio15RadioTechnologyE"
    },
    {
     "field_name" : "downlinkChannelNumber",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uplinkChannelNumber",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cellBandwidthDownlinkKhz",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cellBandwidthUplinkKhz",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "contextIds",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "physicalCellId",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "band",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network25PhysicalChannelConfigBandE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network21PhysicalChannelConfigE",
   "name" : "aidl::android::hardware::radio::network::PhysicalChannelConfig",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network21PhysicalChannelConfigE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network21PhysicalChannelConfigE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/PhysicalChannelConfig.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "signalStrength",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bitErrorRate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rscp",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network21TdscdmaSignalStrengthE",
   "name" : "aidl::android::hardware::radio::network::TdscdmaSignalStrength",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network21TdscdmaSignalStrengthE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network21TdscdmaSignalStrengthE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/TdscdmaSignalStrength.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network22BnRadioNetworkResponseE",
   "name" : "aidl::android::hardware::radio::network::BnRadioNetworkResponse",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network22BnRadioNetworkResponseE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network22BnRadioNetworkResponseE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BnRadioNetworkResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network22BnRadioNetworkResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BnRadioNetworkResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BnRadioNetworkResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse18acknowledgeRequestEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse36getAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse29getAvailableBandModesResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_13RadioBandModeENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse28getAvailableNetworksResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_12OperatorInfoENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse22getBarringInfoResponseERKNS2_17RadioResponseInfoERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENSB_9allocatorISD_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32getCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoENS3_15CdmaRoamingTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23getCellInfoListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_8CellInfoENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32getDataRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getImsRegistrationStateResponseERKNS2_17RadioResponseInfoEbNS2_21RadioTechnologyFamilyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getNetworkSelectionModeResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19getOperatorResponseERKNS2_17RadioResponseInfoERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEESG_SG_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse25getSignalStrengthResponseERKNS2_17RadioResponseInfoERKNS3_14SignalStrengthE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34getSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_20RadioAccessSpecifierENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse31getVoiceRadioTechnologyResponseERKNS2_17RadioResponseInfoENS2_15RadioTechnologyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse33getVoiceRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse35isNrDualConnectivityEnabledResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse36setAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse19setBandModeResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse26setBarringPasswordResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse32setCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse27setCellInfoListRateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse27setIndicationFilterResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse40setLinkCapacityReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse26setLocationUpdatesResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse40setNetworkSelectionModeAutomaticResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse37setNetworkSelectionModeManualResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34setNrDualConnectivityStateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse42setSignalStrengthReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse35setSuppServiceNotificationsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse34setSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse24startNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23stopNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse38supplyNetworkDepersonalizationResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23setUsageSettingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network21IRadioNetworkResponse23getUsageSettingResponseERKNS2_17RadioResponseInfoENS3_12UsageSettingE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BnRadioNetworkResponse19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BnRadioNetworkResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BnRadioNetworkResponse12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network22BpRadioNetworkResponseE",
   "name" : "aidl::android::hardware::radio::network::BpRadioNetworkResponse",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network22BpRadioNetworkResponseE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network22BpRadioNetworkResponseE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BpRadioNetworkResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network22BpRadioNetworkResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse18acknowledgeRequestEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse36getAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse29getAvailableBandModesResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_13RadioBandModeENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse28getAvailableNetworksResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_12OperatorInfoENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse22getBarringInfoResponseERKNS2_17RadioResponseInfoERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENSB_9allocatorISD_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse32getCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoENS3_15CdmaRoamingTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse23getCellInfoListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_8CellInfoENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse32getDataRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse31getImsRegistrationStateResponseERKNS2_17RadioResponseInfoEbNS2_21RadioTechnologyFamilyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse31getNetworkSelectionModeResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse19getOperatorResponseERKNS2_17RadioResponseInfoERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEESG_SG_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse25getSignalStrengthResponseERKNS2_17RadioResponseInfoERKNS3_14SignalStrengthE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse34getSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_20RadioAccessSpecifierENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse31getVoiceRadioTechnologyResponseERKNS2_17RadioResponseInfoENS2_15RadioTechnologyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse33getVoiceRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse35isNrDualConnectivityEnabledResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse36setAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse19setBandModeResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse26setBarringPasswordResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse32setCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse27setCellInfoListRateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse27setIndicationFilterResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse40setLinkCapacityReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse26setLocationUpdatesResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse40setNetworkSelectionModeAutomaticResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse37setNetworkSelectionModeManualResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse34setNrDualConnectivityStateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse42setSignalStrengthReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse35setSuppServiceNotificationsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse34setSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse24startNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse23stopNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse38supplyNetworkDepersonalizationResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse23setUsageSettingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse23getUsageSettingResponseERKNS2_17RadioResponseInfoENS3_12UsageSettingE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BpRadioNetworkResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lteVopsInfo",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network11LteVopsInfoE"
    },
    {
     "field_name" : "nrIndicators",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network12NrIndicatorsE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network22EutranRegistrationInfoE",
   "name" : "aidl::android::hardware::radio::network::EutranRegistrationInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network22EutranRegistrationInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network22EutranRegistrationInfoE",
   "size" : 5,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/EutranRegistrationInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network14BnRadioNetworkE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware5radio7network13IRadioNetworkEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network22IRadioNetworkDelegatorE",
   "name" : "aidl::android::hardware::radio::network::IRadioNetworkDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network22IRadioNetworkDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network22IRadioNetworkDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BnRadioNetwork.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network22IRadioNetworkDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network13IRadioNetworkEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator28getAllowedNetworkTypesBitmapEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator21getAvailableBandModesEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator20getAvailableNetworksEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator14getBarringInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator24getCdmaRoamingPreferenceEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator15getCellInfoListEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator24getDataRegistrationStateEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator23getImsRegistrationStateEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator23getNetworkSelectionModeEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator11getOperatorEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator17getSignalStrengthEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator26getSystemSelectionChannelsEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator23getVoiceRadioTechnologyEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator25getVoiceRegistrationStateEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator27isNrDualConnectivityEnabledEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator23responseAcknowledgementEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator28setAllowedNetworkTypesBitmapEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator11setBandModeEiNS3_13RadioBandModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator18setBarringPasswordEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_SD_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator24setCdmaRoamingPreferenceEiNS3_15CdmaRoamingTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator19setCellInfoListRateEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator19setIndicationFilterEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator32setLinkCapacityReportingCriteriaEiiiiRKNSt3__16vectorIiNS5_9allocatorIiEEEESB_NS2_13AccessNetworkE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator18setLocationUpdatesEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator32setNetworkSelectionModeAutomaticEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator29setNetworkSelectionModeManualEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENS2_13AccessNetworkE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator26setNrDualConnectivityStateEiNS3_23NrDualConnectivityStateE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator20setResponseFunctionsERKNSt3__110shared_ptrINS3_21IRadioNetworkResponseEEERKNS6_INS3_23IRadioNetworkIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator34setSignalStrengthReportingCriteriaEiRKNSt3__16vectorINS3_19SignalThresholdInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator27setSuppServiceNotificationsEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator26setSystemSelectionChannelsEibRKNSt3__16vectorINS3_20RadioAccessSpecifierENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator16startNetworkScanEiRKNS3_18NetworkScanRequestE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator15stopNetworkScanEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator30supplyNetworkDepersonalizationEiRKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator15setUsageSettingEiNS3_12UsageSettingE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22IRadioNetworkDelegator15getUsageSettingEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BnRadioNetwork19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BnRadioNetwork16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network14BnRadioNetwork12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "factor",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timeSeconds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "isBarred",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network23BarringTypeSpecificInfoE",
   "name" : "aidl::android::hardware::radio::network::BarringTypeSpecificInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network23BarringTypeSpecificInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network23BarringTypeSpecificInfoE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BarringTypeSpecificInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware5radio7network11CellInfoGsmENS5_13CellInfoWcdmaENS5_15CellInfoTdscdmaENS5_11CellInfoLteENS5_10CellInfoNrENS5_12CellInfoCdmaEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network23CellInfoRatSpecificInfoE",
   "name" : "aidl::android::hardware::radio::network::CellInfoRatSpecificInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network23CellInfoRatSpecificInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network23CellInfoRatSpecificInfoE",
   "size" : 164,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellInfoRatSpecificInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationE",
   "name" : "aidl::android::hardware::radio::network::IRadioNetworkIndication",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/IRadioNetworkIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndicationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndicationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication18barringInfoChangedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENS9_9allocatorISB_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication14cdmaPrlChangedENS2_19RadioIndicationTypeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication12cellInfoListENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_8CellInfoENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication27currentLinkCapacityEstimateENS2_19RadioIndicationTypeERKNS3_20LinkCapacityEstimateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication29currentPhysicalChannelConfigsENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_21PhysicalChannelConfigENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication21currentSignalStrengthENS2_19RadioIndicationTypeERKNS3_14SignalStrengthE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication22imsNetworkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication17networkScanResultENS2_19RadioIndicationTypeERKNS3_17NetworkScanResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication19networkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication16nitzTimeReceivedENS2_19RadioIndicationTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEExx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication18registrationFailedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__112basic_stringIcNS9_11char_traitsIcEENS9_9allocatorIcEEEEiii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication22restrictedStateChangedENS2_19RadioIndicationTypeENS3_20PhoneRestrictedStateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication13suppSvcNotifyENS2_19RadioIndicationTypeERKNS3_19SuppSvcNotificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication21voiceRadioTechChangedENS2_19RadioIndicationTypeENS2_15RadioTechnologyE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network24BnRadioNetworkIndicationE",
   "name" : "aidl::android::hardware::radio::network::BnRadioNetworkIndication",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network24BnRadioNetworkIndicationE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network24BnRadioNetworkIndicationE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BnRadioNetworkIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network24BnRadioNetworkIndicationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BnRadioNetworkIndicationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BnRadioNetworkIndicationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication18barringInfoChangedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENS9_9allocatorISB_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication14cdmaPrlChangedENS2_19RadioIndicationTypeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication12cellInfoListENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_8CellInfoENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication27currentLinkCapacityEstimateENS2_19RadioIndicationTypeERKNS3_20LinkCapacityEstimateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication29currentPhysicalChannelConfigsENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_21PhysicalChannelConfigENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication21currentSignalStrengthENS2_19RadioIndicationTypeERKNS3_14SignalStrengthE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication22imsNetworkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication17networkScanResultENS2_19RadioIndicationTypeERKNS3_17NetworkScanResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication19networkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication16nitzTimeReceivedENS2_19RadioIndicationTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEExx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication18registrationFailedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__112basic_stringIcNS9_11char_traitsIcEENS9_9allocatorIcEEEEiii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication22restrictedStateChangedENS2_19RadioIndicationTypeENS3_20PhoneRestrictedStateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication13suppSvcNotifyENS2_19RadioIndicationTypeERKNS3_19SuppSvcNotificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network23IRadioNetworkIndication21voiceRadioTechChangedENS2_19RadioIndicationTypeENS2_15RadioTechnologyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BnRadioNetworkIndication19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BnRadioNetworkIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BnRadioNetworkIndication12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network24BpRadioNetworkIndicationE",
   "name" : "aidl::android::hardware::radio::network::BpRadioNetworkIndication",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network24BpRadioNetworkIndicationE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network24BpRadioNetworkIndicationE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BpRadioNetworkIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network24BpRadioNetworkIndicationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndicationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndicationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication18barringInfoChangedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENS9_9allocatorISB_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication14cdmaPrlChangedENS2_19RadioIndicationTypeEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication12cellInfoListENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_8CellInfoENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication27currentLinkCapacityEstimateENS2_19RadioIndicationTypeERKNS3_20LinkCapacityEstimateE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication29currentPhysicalChannelConfigsENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_21PhysicalChannelConfigENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication21currentSignalStrengthENS2_19RadioIndicationTypeERKNS3_14SignalStrengthE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication22imsNetworkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication17networkScanResultENS2_19RadioIndicationTypeERKNS3_17NetworkScanResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication19networkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication16nitzTimeReceivedENS2_19RadioIndicationTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEExx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication18registrationFailedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__112basic_stringIcNS9_11char_traitsIcEENS9_9allocatorIcEEEEiii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication22restrictedStateChangedENS2_19RadioIndicationTypeENS3_20PhoneRestrictedStateE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication13suppSvcNotifyENS2_19RadioIndicationTypeERKNS3_19SuppSvcNotificationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication21voiceRadioTechChangedENS2_19RadioIndicationTypeENS2_15RadioTechnologyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BpRadioNetworkIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cssSupported",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "roamingIndicator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "systemIsInPrl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "defaultRoamingIndicator",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network24Cdma2000RegistrationInfoE",
   "name" : "aidl::android::hardware::radio::network::Cdma2000RegistrationInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network24Cdma2000RegistrationInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network24Cdma2000RegistrationInfoE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/Cdma2000RegistrationInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "csgIndication",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "homeNodebName",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "csgIdentity",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network25ClosedSubscriberGroupInfoE",
   "name" : "aidl::android::hardware::radio::network::ClosedSubscriberGroupInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network25ClosedSubscriberGroupInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network25ClosedSubscriberGroupInfoE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/ClosedSubscriberGroupInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbN4aidl7android8hardware5radio7network10GeranBandsENS5_10UtranBandsENS5_11EutranBandsENS5_10NgranBandsEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network25PhysicalChannelConfigBandE",
   "name" : "aidl::android::hardware::radio::network::PhysicalChannelConfigBand",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network25PhysicalChannelConfigBandE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network25PhysicalChannelConfigBandE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/PhysicalChannelConfigBand.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbNS_6vectorIN4aidl7android8hardware5radio7network10GeranBandsENS_9allocatorIS7_EEEENS1_INS6_10UtranBandsENS8_ISB_EEEENS1_INS6_11EutranBandsENS8_ISE_EEEENS1_INS6_10NgranBandsENS8_ISH_EEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network25RadioAccessSpecifierBandsE",
   "name" : "aidl::android::hardware::radio::network::RadioAccessSpecifierBands",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network25RadioAccessSpecifierBandsE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network25RadioAccessSpecifierBandsE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/RadioAccessSpecifierBands.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbN4aidl7android8hardware5radio7network24Cdma2000RegistrationInfoENS5_22EutranRegistrationInfoENS5_10NrVopsInfoEbEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network28AccessTechnologySpecificInfoE",
   "name" : "aidl::android::hardware::radio::network::AccessTechnologySpecificInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network28AccessTechnologySpecificInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network28AccessTechnologySpecificInfoE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/AccessTechnologySpecificInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network21IRadioNetworkResponseE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefaultE",
   "name" : "aidl::android::hardware::radio::network::IRadioNetworkResponseDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/IRadioNetworkResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault18acknowledgeRequestEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault36getAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault29getAvailableBandModesResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_13RadioBandModeENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault28getAvailableNetworksResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_12OperatorInfoENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault22getBarringInfoResponseERKNS2_17RadioResponseInfoERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENSB_9allocatorISD_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault32getCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoENS3_15CdmaRoamingTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault23getCellInfoListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_8CellInfoENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault32getDataRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault31getImsRegistrationStateResponseERKNS2_17RadioResponseInfoEbNS2_21RadioTechnologyFamilyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault31getNetworkSelectionModeResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault19getOperatorResponseERKNS2_17RadioResponseInfoERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEESG_SG_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault25getSignalStrengthResponseERKNS2_17RadioResponseInfoERKNS3_14SignalStrengthE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault34getSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_20RadioAccessSpecifierENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault31getVoiceRadioTechnologyResponseERKNS2_17RadioResponseInfoENS2_15RadioTechnologyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault33getVoiceRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault35isNrDualConnectivityEnabledResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault36setAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault19setBandModeResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault26setBarringPasswordResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault32setCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault27setCellInfoListRateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault27setIndicationFilterResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault40setLinkCapacityReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault26setLocationUpdatesResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault40setNetworkSelectionModeAutomaticResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault37setNetworkSelectionModeManualResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault34setNrDualConnectivityStateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault42setSignalStrengthReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault35setSuppServiceNotificationsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault34setSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault24startNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault23stopNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault38supplyNetworkDepersonalizationResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault23setUsageSettingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault23getUsageSettingResponseERKNS2_17RadioResponseInfoENS3_12UsageSettingE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network28IRadioNetworkResponseDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefaultE",
   "name" : "aidl::android::hardware::radio::network::IRadioNetworkIndicationDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/IRadioNetworkIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault18barringInfoChangedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENS9_9allocatorISB_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault14cdmaPrlChangedENS2_19RadioIndicationTypeEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault12cellInfoListENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_8CellInfoENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault27currentLinkCapacityEstimateENS2_19RadioIndicationTypeERKNS3_20LinkCapacityEstimateE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault29currentPhysicalChannelConfigsENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_21PhysicalChannelConfigENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault21currentSignalStrengthENS2_19RadioIndicationTypeERKNS3_14SignalStrengthE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault22imsNetworkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault17networkScanResultENS2_19RadioIndicationTypeERKNS3_17NetworkScanResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault19networkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault16nitzTimeReceivedENS2_19RadioIndicationTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEExx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault18registrationFailedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__112basic_stringIcNS9_11char_traitsIcEENS9_9allocatorIcEEEEiii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault22restrictedStateChangedENS2_19RadioIndicationTypeENS3_20PhoneRestrictedStateE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault13suppSvcNotifyENS2_19RadioIndicationTypeERKNS3_19SuppSvcNotificationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault21voiceRadioTechChangedENS2_19RadioIndicationTypeENS2_15RadioTechnologyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkIndicationDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network22BnRadioNetworkResponseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegatorE",
   "name" : "aidl::android::hardware::radio::network::IRadioNetworkResponseDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BnRadioNetworkResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network21IRadioNetworkResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator18acknowledgeRequestEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator36getAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator29getAvailableBandModesResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_13RadioBandModeENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator28getAvailableNetworksResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_12OperatorInfoENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator22getBarringInfoResponseERKNS2_17RadioResponseInfoERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENSB_9allocatorISD_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator32getCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoENS3_15CdmaRoamingTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator23getCellInfoListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_8CellInfoENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator32getDataRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator31getImsRegistrationStateResponseERKNS2_17RadioResponseInfoEbNS2_21RadioTechnologyFamilyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator31getNetworkSelectionModeResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator19getOperatorResponseERKNS2_17RadioResponseInfoERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEESG_SG_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator25getSignalStrengthResponseERKNS2_17RadioResponseInfoERKNS3_14SignalStrengthE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator34getSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_20RadioAccessSpecifierENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator31getVoiceRadioTechnologyResponseERKNS2_17RadioResponseInfoENS2_15RadioTechnologyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator33getVoiceRegistrationStateResponseERKNS2_17RadioResponseInfoERKNS3_14RegStateResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator35isNrDualConnectivityEnabledResponseERKNS2_17RadioResponseInfoEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator36setAllowedNetworkTypesBitmapResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator19setBandModeResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator26setBarringPasswordResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator32setCdmaRoamingPreferenceResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator27setCellInfoListRateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator27setIndicationFilterResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator40setLinkCapacityReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator26setLocationUpdatesResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator40setNetworkSelectionModeAutomaticResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator37setNetworkSelectionModeManualResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator34setNrDualConnectivityStateResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator42setSignalStrengthReportingCriteriaResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator35setSuppServiceNotificationsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator34setSystemSelectionChannelsResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator24startNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator23stopNetworkScanResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator38supplyNetworkDepersonalizationResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator23setUsageSettingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network30IRadioNetworkResponseDelegator23getUsageSettingResponseERKNS2_17RadioResponseInfoENS3_12UsageSettingE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BnRadioNetworkResponse19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BnRadioNetworkResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network22BnRadioNetworkResponse12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network24BnRadioNetworkIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegatorE",
   "name" : "aidl::android::hardware::radio::network::IRadioNetworkIndicationDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/BnRadioNetworkIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio7network23IRadioNetworkIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator18barringInfoChangedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__16vectorINS3_11BarringInfoENS9_9allocatorISB_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator14cdmaPrlChangedENS2_19RadioIndicationTypeEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator12cellInfoListENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_8CellInfoENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator27currentLinkCapacityEstimateENS2_19RadioIndicationTypeERKNS3_20LinkCapacityEstimateE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator29currentPhysicalChannelConfigsENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_21PhysicalChannelConfigENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator21currentSignalStrengthENS2_19RadioIndicationTypeERKNS3_14SignalStrengthE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator22imsNetworkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator17networkScanResultENS2_19RadioIndicationTypeERKNS3_17NetworkScanResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator19networkStateChangedENS2_19RadioIndicationTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator16nitzTimeReceivedENS2_19RadioIndicationTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEExx"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator18registrationFailedENS2_19RadioIndicationTypeERKNS3_12CellIdentityERKNSt3__112basic_stringIcNS9_11char_traitsIcEENS9_9allocatorIcEEEEiii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator22restrictedStateChangedENS2_19RadioIndicationTypeENS3_20PhoneRestrictedStateE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator13suppSvcNotifyENS2_19RadioIndicationTypeERKNS3_19SuppSvcNotificationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network32IRadioNetworkIndicationDelegator21voiceRadioTechChangedENS2_19RadioIndicationTypeENS2_15RadioTechnologyE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BnRadioNetworkIndication19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BnRadioNetworkIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio7network24BnRadioNetworkIndication12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "registered",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "connectionStatus",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network20CellConnectionStatusE"
    },
    {
     "field_name" : "ratSpecificInfo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network23CellInfoRatSpecificInfoE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio7network8CellInfoE",
   "name" : "aidl::android::hardware::radio::network::CellInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio7network8CellInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio7network8CellInfoE",
   "size" : 172,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.network-V1-ndk-source/gen/include/aidl/android/hardware/radio/network/CellInfo.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network10GeranBandsENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::radio::network::GeranBands, std::allocator<aidl::android::hardware::radio::network::GeranBands>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network10GeranBandsENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network10GeranBandsENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware5radio7network10GeranBandsENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network10NgranBandsENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::radio::network::NgranBands, std::allocator<aidl::android::hardware::radio::network::NgranBands>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network10NgranBandsENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network10NgranBandsENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware5radio7network10NgranBandsENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network10UtranBandsENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::radio::network::UtranBands, std::allocator<aidl::android::hardware::radio::network::UtranBands>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network10UtranBandsENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network10UtranBandsENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware5radio7network10UtranBandsENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio7network11EutranBandsENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::radio::network::EutranBands, std::allocator<aidl::android::hardware::radio::network::EutranBands>>>",
   "record_kind" : "class",
