{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int[0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA100_A2_c",
   "name" : "char[100][2]",
   "referenced_type" : "_ZTIA2_c",
   "self_type" : "_ZTIA100_A2_c",
   "size" : 200,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1024_c",
   "name" : "char[1024]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1024_c",
   "size" : 1024,
   "source_file" : "system/libbase/include/android-base/file.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA10_c",
   "name" : "char[10]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA10_c",
   "size" : 10,
   "source_file" : "frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_j",
   "name" : "unsigned int[10]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA10_j",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA11_N3fmt2v76detail19divtest_table_entryIjEE",
   "name" : "fmt::detail::divtest_table_entry<unsigned int>[11]",
   "referenced_type" : "_ZTIN3fmt2v76detail19divtest_table_entryIjEE",

   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_typeE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBaseE",
   "name" : "android::RefBase *const",
   "referenced_type" : "_ZTIPN7android7RefBaseE",
   "self_type" : "_ZTIKPN7android7RefBaseE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPc",
   "name" : "char *const",
   "referenced_type" : "_ZTIPc",
   "self_type" : "_ZTIKPc",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIKPv",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKe",
   "name" : "const long double",
   "referenced_type" : "_ZTIe",
   "self_type" : "_ZTIKe",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "self_type" : "_ZTIKw",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVb",
   "name" : "volatile bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIVb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVi",
   "name" : "volatile int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIVi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/include/binder/BpBinder.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "path",
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_dir_and_contents_",
     "field_offset" : 8192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI12TemporaryDir",
   "name" : "TemporaryDir",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12TemporaryDir",
   "self_type" : "_ZTI12TemporaryDir",
   "size" : 1025,
   "source_file" : "system/libbase/include/android-base/file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "temp_file_",
     "referenced_type" : "_ZTI13TemporaryFile"
    },
    {
     "access" : "private",
     "field_name" : "std_fd_",
     "field_offset" : 8256,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "old_fd_",
     "field_offset" : 8288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI13CapturedStdFd",
   "name" : "CapturedStdFd",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13CapturedStdFd",
   "self_type" : "_ZTI13CapturedStdFd",
   "size" : 1040,
   "source_file" : "system/libbase/include/android-base/test_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "path",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_file_",
     "field_offset" : 8224,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI13TemporaryFile",
   "name" : "TemporaryFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13TemporaryFile",
   "self_type" : "_ZTI13TemporaryFile",
   "size" : 1032,
   "source_file" : "system/libbase/include/android-base/file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 56,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI13CapturedStdFd"
    }
   ],
   "linker_set_key" : "_ZTI14CapturedStderr",
   "name" : "CapturedStderr",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14CapturedStderr",
   "self_type" : "_ZTI14CapturedStderr",
   "size" : 1040,
   "source_file" : "system/libbase/include/android-base/test_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI13CapturedStdFd"
    }
   ],
   "linker_set_key" : "_ZTI14CapturedStdout",
   "name" : "CapturedStdout",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14CapturedStdout",
   "self_type" : "_ZTI14CapturedStdout",
   "size" : 1040,
   "source_file" : "system/libbase/include/android-base/test_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 32,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 12,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIA22_c"
    },
    {
     "access" : "private",
     "field_name" : "str_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v710format_intE",
   "name" : "fmt::format_int",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v710format_intE",
   "self_type" : "_ZTIN3fmt2v710format_intE",
   "size" : 28,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v711format_argsE",
   "name" : "fmt::format_args",
   "referenced_type" : "_ZTIN3fmt2v711format_argsE",
   "self_type" : "_ZTIN3fmt2v711format_argsE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt13runtime_error"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v712format_errorE",
   "name" : "fmt::format_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v712format_errorE",
   "self_type" : "_ZTIN3fmt2v712format_errorE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v712format_errorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt2v712format_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt2v712format_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt13runtime_error"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "error_code_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v712system_errorE",
   "name" : "fmt::system_error",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v712system_errorE",
   "self_type" : "_ZTIN3fmt2v712system_errorE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v712system_errorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt2v712system_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt2v712system_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIwEEwEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v712wformat_argsE",
   "name" : "fmt::wformat_args",
   "referenced_type" : "_ZTIN3fmt2v712wformat_argsE",
   "self_type" : "_ZTIN3fmt2v712wformat_argsE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v713is_contiguousINS0_6detail6bufferIcEEEE",
   "name" : "fmt::is_contiguous<fmt::detail::buffer<char>>",
   "referenced_type" : "_ZTIN3fmt2v713is_contiguousINS0_6detail6bufferIcEEEE",
   "self_type" : "_ZTIN3fmt2v713is_contiguousINS0_6detail6bufferIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail6bufferIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v713is_contiguousINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "name" : "fmt::is_contiguous<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "referenced_type" : "_ZTIN3fmt2v713is_contiguousINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "self_type" : "_ZTIN3fmt2v713is_contiguousINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v713type_identityIcEE",
   "name" : "fmt::type_identity<char>",
   "referenced_type" : "_ZTIN3fmt2v713type_identityIcEE",
   "self_type" : "_ZTIN3fmt2v713type_identityIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v714compile_stringE",
   "name" : "fmt::compile_string",
   "referenced_type" : "_ZTIN3fmt2v714compile_stringE",
   "self_type" : "_ZTIN3fmt2v714compile_stringE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "custom_",
     "referenced_type" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEE6handleE",
   "name" : "fmt::basic_format_arg<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>::handle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEE6handleE",
   "self_type" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEE6handleE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "type_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt2v76detail4typeE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE",
   "name" : "fmt::basic_format_arg<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE",
   "self_type" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "custom_",
     "referenced_type" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEE6handleE",
   "name" : "fmt::basic_format_arg<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>::handle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEE6handleE",
   "self_type" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEE6handleE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "type_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt2v76detail4typeE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE",
   "name" : "fmt::basic_format_arg<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj2ELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJA7_KciEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>, const char[7], int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJA7_KciEEE",
   "self_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJA7_KciEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj2ELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJNS0_17basic_string_viewIcEEA3_KcEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>, basic_string_view<char>, const char[3]>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJNS0_17basic_string_viewIcEEA3_KcEEE",
   "self_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJNS0_17basic_string_viewIcEEA3_KcEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj2ELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJNS0_17basic_string_viewIcEEPcEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>, basic_string_view<char>, char *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJNS0_17basic_string_viewIcEEPcEEE",
   "self_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJNS0_17basic_string_viewIcEEPcEEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj1ELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJiEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>, int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJiEEE",
   "self_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJiEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj1ELj0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJjEEE",
   "name" : "fmt::format_arg_store<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJjEEE",
   "self_type" : "_ZTIN3fmt2v716format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEJjEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "desc_",
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values_",
     "referenced_type" : "_ZTIPKN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
    },
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIPKN3fmt2v716basic_format_argINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEUt_E",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>::(anonymous union at external/fmtlib/include/fmt/core.h:1839:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEUt_E",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEUt_E",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "desc_",
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIwEEwEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIwEEwEEEE",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<fmt::detail::buffer_appender<wchar_t>, wchar_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIwEEwEEEE",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIwEEwEEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIwEEwEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values_",
     "referenced_type" : "_ZTIPKN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIwEEwEEEE"
    },
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIPKN3fmt2v716basic_format_argINS0_20basic_format_contextINS0_6detail15buffer_appenderIwEEwEEEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIwEEwEEEUt_E",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<fmt::detail::buffer_appender<wchar_t>, wchar_t>>::(anonymous union at external/fmtlib/include/fmt/core.h:1839:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIwEEwEEEUt_E",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIwEEwEEEUt_E",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "desc_",
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values_",
     "referenced_type" : "_ZTIPKN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE"
    },
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIPKN3fmt2v716basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEUt_E",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>::(anonymous union at external/fmtlib/include/fmt/core.h:1839:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEUt_E",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEUt_E",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "desc_",
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEcEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEcEEEE",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<std::back_insert_iterator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEcEEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS2_12basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEEcEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values_",
     "referenced_type" : "_ZTIPKN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS4_12basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEcEEEE"
    },
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIPKN3fmt2v716basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEcEEEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEcEEEUt_E",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<std::back_insert_iterator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, char>>::(anonymous union at external/fmtlib/include/fmt/core.h:1839:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEcEEEUt_E",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEcEEEUt_E",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "desc_",
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextIPccEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextIPccEEEE",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<char *, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextIPccEEEE",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextIPccEEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextIPccEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values_",
     "referenced_type" : "_ZTIPKN3fmt2v76detail5valueINS0_20basic_format_contextIPccEEEE"
    },
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIPKN3fmt2v716basic_format_argINS0_20basic_format_contextIPccEEEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextIPccEEEUt_E",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<char *, char>>::(anonymous union at external/fmtlib/include/fmt/core.h:1839:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextIPccEEEUt_E",
   "self_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextIPccEEEUt_E",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKN3fmt2v76detail10char8_typeE"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717basic_string_viewINS0_6detail10char8_typeEEE",
   "name" : "fmt::basic_string_view<fmt::detail::char8_type>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v717basic_string_viewINS0_6detail10char8_typeEEE",
   "self_type" : "_ZTIN3fmt2v717basic_string_viewINS0_6detail10char8_typeEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail10char8_typeE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717basic_string_viewIcEE",
   "name" : "fmt::basic_string_view<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v717basic_string_viewIcEE",
   "self_type" : "_ZTIN3fmt2v717basic_string_viewIcEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKw"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717basic_string_viewIwEE",
   "name" : "fmt::basic_string_view<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v717basic_string_viewIwEE",
   "self_type" : "_ZTIN3fmt2v717basic_string_viewIwEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEA3_cEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIA3_cEE",
   "name" : "fmt::is_compile_string<char[3]>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIA3_cEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIA3_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEA4_cEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIA4_cEE",
   "name" : "fmt::is_compile_string<char[4]>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIA4_cEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIA4_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA4_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEA5_cEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIA5_cEE",
   "name" : "fmt::is_compile_string<char[5]>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIA5_cEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIA5_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA5_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEA7_cEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIA7_cEE",
   "name" : "fmt::is_compile_string<char[7]>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIA7_cEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIA7_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringENS2_17basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::is_compile_string<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v717basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringENS2_9monostateEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringINS0_9monostateEEE",
   "name" : "fmt::is_compile_string<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v79monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEPKcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIPKcEE",
   "name" : "fmt::is_compile_string<const char *>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIPKcEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEPKvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIPKvEE",
   "name" : "fmt::is_compile_string<const void *>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIPKvEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEPcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIPcEE",
   "name" : "fmt::is_compile_string<char *>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIPcEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIPcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEbEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIbEE",
   "name" : "fmt::is_compile_string<bool>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIbEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIcEE",
   "name" : "fmt::is_compile_string<char>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIcEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEdEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIdEE",
   "name" : "fmt::is_compile_string<double>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIdEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEeEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIeEE",
   "name" : "fmt::is_compile_string<long double>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIeEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEfEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIfEE",
   "name" : "fmt::is_compile_string<float>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIfEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEiEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIiEE",
   "name" : "fmt::is_compile_string<int>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIiEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIjEE",
   "name" : "fmt::is_compile_string<unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIjEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringExEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIxEE",
   "name" : "fmt::is_compile_string<long long>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIxEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__110is_base_ofIN3fmt2v714compile_stringEyEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v717is_compile_stringIyEE",
   "name" : "fmt::is_compile_string<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v717is_compile_stringIyEE",
   "self_type" : "_ZTIN3fmt2v717is_compile_stringIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "precision",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "align",
     "field_offset" : 72,
     "referenced_type" : "_ZTIN3fmt2v75align4typeE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 76,
     "referenced_type" : "_ZTIN3fmt2v74sign4typeE"
    },
    {
     "field_name" : "alt",
     "field_offset" : 79,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "fill",
     "field_offset" : 80,
     "referenced_type" : "_ZTIN3fmt2v76detail6fill_tIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v718basic_format_specsIcEE",
   "name" : "fmt::basic_format_specs<char>",
   "referenced_type" : "_ZTIN3fmt2v718basic_format_specsIcEE",
   "self_type" : "_ZTIN3fmt2v718basic_format_specsIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail6bufferIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA500_c"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "field_offset" : 4128,
     "referenced_type" : "_ZTINSt3__19allocatorIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v719basic_memory_bufferIcLj500ENSt3__19allocatorIcEEEE",
   "name" : "fmt::basic_memory_buffer<char, 500U, std::allocator<char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v719basic_memory_bufferIcLj500ENSt3__19allocatorIcEEEE",
   "self_type" : "_ZTIN3fmt2v719basic_memory_bufferIcLj500ENSt3__19allocatorIcEEEE",
   "size" : 520,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTINSt3__19allocatorIcEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v719basic_memory_bufferIcLj500ENSt3__19allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt2v719basic_memory_bufferIcLj500ENSt3__19allocatorIcEEE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail6bufferIjEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTINSt3__19allocatorIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v719basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE",
   "name" : "fmt::basic_memory_buffer<unsigned int, 32U, std::allocator<unsigned int>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v719basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE",
   "self_type" : "_ZTIN3fmt2v719basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE",
   "size" : 148,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTINSt3__19allocatorIjEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v719basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt2v719basic_memory_bufferIjLj32ENSt3__19allocatorIjEEE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail6bufferIwEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA500_w"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "field_offset" : 16128,
     "referenced_type" : "_ZTINSt3__19allocatorIwEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v719basic_memory_bufferIwLj500ENSt3__19allocatorIwEEEE",
   "name" : "fmt::basic_memory_buffer<wchar_t, 500U, std::allocator<wchar_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v719basic_memory_bufferIwLj500ENSt3__19allocatorIwEEEE",
   "self_type" : "_ZTIN3fmt2v719basic_memory_bufferIwLj500ENSt3__19allocatorIwEEEE",
   "size" : 2020,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIw",
    "_ZTINSt3__19allocatorIwEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v719basic_memory_bufferIwLj500ENSt3__19allocatorIwEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt2v719basic_memory_bufferIwLj500ENSt3__19allocatorIwEEE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "out_",
     "referenced_type" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE"
    },
    {
     "access" : "private",
     "field_name" : "args_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "loc_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE",
   "name" : "fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE",
   "self_type" : "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "out_",
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "args_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "loc_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE",
   "name" : "fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE",
   "self_type" : "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "out_",
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "args_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEEEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "loc_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS2_12basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEEcEE",
   "name" : "fmt::basic_format_context<std::back_insert_iterator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS2_12basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEEcEE",
   "self_type" : "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS2_12basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEEcEE",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "out_",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "args_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextIPccEEEE"
    },
    {
     "access" : "private",
     "field_name" : "loc_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v720basic_format_contextIPccEE",
   "name" : "fmt::basic_format_context<char *, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v720basic_format_contextIPccEE",
   "self_type" : "_ZTIN3fmt2v720basic_format_contextIPccEE",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTINSt3__16vectorIN3fmt2v716basic_format_argINS2_20basic_format_contextINS2_6detail15buffer_appenderIcEEcEEEENS_9allocatorIS9_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "named_info_",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16vectorIN3fmt2v76detail14named_arg_infoIcEENS_9allocatorIS5_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "dynamic_args_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN3fmt2v76detail16dynamic_arg_listE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v724dynamic_format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE",
   "name" : "fmt::dynamic_format_arg_store<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v724dynamic_format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE",
   "self_type" : "_ZTIN3fmt2v724dynamic_format_arg_storeINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE",
   "size" : 28,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTINSt3__16vectorIN3fmt2v716basic_format_argINS2_20basic_format_contextINS_20back_insert_iteratorINS2_6detail6bufferIcEEEEcEEEENS_9allocatorISB_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "named_info_",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__16vectorIN3fmt2v76detail14named_arg_infoIcEENS_9allocatorIS5_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "dynamic_args_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN3fmt2v76detail16dynamic_arg_listE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v724dynamic_format_arg_storeINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE",
   "name" : "fmt::dynamic_format_arg_store<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v724dynamic_format_arg_storeINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v724dynamic_format_arg_storeINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE",
   "size" : 28,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN3fmt2v76detail13error_handlerE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "format_str_",
     "referenced_type" : "_ZTIN3fmt2v717basic_string_viewIcEE"
    },
    {
     "access" : "private",
     "field_name" : "next_arg_id_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE",
   "name" : "fmt::basic_format_parse_context<char, fmt::detail::error_handler>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE",
   "self_type" : "_ZTIN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIN3fmt2v76detail13error_handlerE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt2v717basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v75bytesE",
   "name" : "fmt::bytes",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v75bytesE",
   "self_type" : "_ZTIN3fmt2v75bytesE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "name" : "fmt::detail::arg_mapper<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "name" : "fmt::detail::arg_mapper<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextINSt3__120back_insert_iteratorINS4_12basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEcEEEE",
   "name" : "fmt::detail::arg_mapper<fmt::basic_format_context<std::back_insert_iterator<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextINSt3__120back_insert_iteratorINS4_12basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextINSt3__120back_insert_iteratorINS4_12basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEEEEcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS2_12basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEEEcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextIPccEEEE",
   "name" : "fmt::detail::arg_mapper<fmt::basic_format_context<char *, char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextIPccEEEE",
   "self_type" : "_ZTIN3fmt2v76detail10arg_mapperINS0_20basic_format_contextIPccEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextIPccEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail10basic_dataIvEE",
   "name" : "fmt::detail::basic_data<>",
   "referenced_type" : "_ZTIN3fmt2v76detail10basic_dataIvEE",
   "self_type" : "_ZTIN3fmt2v76detail10basic_dataIvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lower",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "upper",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail10boundariesE",
   "name" : "fmt::detail::boundaries",
   "referenced_type" : "_ZTIN3fmt2v76detail10boundariesE",
   "self_type" : "_ZTIN3fmt2v76detail10boundariesE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt2v76detail14format_handlerINS1_15buffer_appenderIcEEcNS0_20basic_format_contextIS4_cEEEE"
    },
    {
     "field_name" : "arg_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail10id_adapterIRNS1_14format_handlerINS1_15buffer_appenderIcEEcNS0_20basic_format_contextIS5_cEEEEcEE",
   "name" : "fmt::detail::id_adapter<fmt::detail::format_handler<fmt::detail::buffer_appender<char>, char, fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>> &, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail10id_adapterIRNS1_14format_handlerINS1_15buffer_appenderIcEEcNS0_20basic_format_contextIS5_cEEEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail10id_adapterIRNS1_14format_handlerINS1_15buffer_appenderIcEEcNS0_20basic_format_contextIS5_cEEEEcEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIRN3fmt2v76detail14format_handlerINS1_15buffer_appenderIcEEcNS0_20basic_format_contextIS4_cEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt2v76detail14format_handlerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS0_20basic_format_contextIS7_cEEEE"
    },
    {
     "field_name" : "arg_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail10id_adapterIRNS1_14format_handlerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS0_20basic_format_contextIS8_cEEEEcEE",
   "name" : "fmt::detail::id_adapter<fmt::detail::format_handler<std::back_insert_iterator<fmt::detail::buffer<char>>, char, fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>> &, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail10id_adapterIRNS1_14format_handlerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS0_20basic_format_contextIS8_cEEEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail10id_adapterIRNS1_14format_handlerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS0_20basic_format_contextIS8_cEEEEcEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIRN3fmt2v76detail14format_handlerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS0_20basic_format_contextIS7_cEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "out",
     "referenced_type" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE"
    },
    {
     "field_name" : "locale",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    },
    {
     "field_name" : "specs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRKN3fmt2v718basic_format_specsIcEE"
    },
    {
     "field_name" : "abs_value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "prefix_size",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail10int_writerINS1_15buffer_appenderIcEEcjEE",
   "name" : "fmt::detail::int_writer<fmt::detail::buffer_appender<char>, char, unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v76detail10int_writerINS1_15buffer_appenderIcEEcjEE",
   "self_type" : "_ZTIN3fmt2v76detail10int_writerINS1_15buffer_appenderIcEEcjEE",
   "size" : 24,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
    "_ZTIc",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "out",
     "referenced_type" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE"
    },
    {
     "field_name" : "locale",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    },
    {
     "field_name" : "specs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRKN3fmt2v718basic_format_specsIcEE"
    },
    {
     "field_name" : "abs_value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "prefix_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail10int_writerINS1_15buffer_appenderIcEEcyEE",
   "name" : "fmt::detail::int_writer<fmt::detail::buffer_appender<char>, char, unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail10int_writerINS1_15buffer_appenderIcEEcyEE",
   "self_type" : "_ZTIN3fmt2v76detail10int_writerINS1_15buffer_appenderIcEEcyEE",
   "size" : 28,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
    "_ZTIc",
    "_ZTIy"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "out",
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
    },
    {
     "field_name" : "locale",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    },
    {
     "field_name" : "specs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRKN3fmt2v718basic_format_specsIcEE"
    },
    {
     "field_name" : "abs_value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "prefix_size",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail10int_writerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcjEE",
   "name" : "fmt::detail::int_writer<std::back_insert_iterator<fmt::detail::buffer<char>>, char, unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v76detail10int_writerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcjEE",
   "self_type" : "_ZTIN3fmt2v76detail10int_writerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcjEE",
   "size" : 24,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE",
    "_ZTIc",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "out",
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
    },
    {
     "field_name" : "locale",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    },
    {
     "field_name" : "specs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRKN3fmt2v718basic_format_specsIcEE"
    },
    {
     "field_name" : "abs_value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "prefix",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "prefix_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail10int_writerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcyEE",
   "name" : "fmt::detail::int_writer<std::back_insert_iterator<fmt::detail::buffer<char>>, char, unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail10int_writerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcyEE",
   "self_type" : "_ZTIN3fmt2v76detail10int_writerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcyEE",
   "size" : 28,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE",
    "_ZTIc",
    "_ZTIy"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "locale_",
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail10locale_refE",
   "name" : "fmt::detail::locale_ref",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE",
   "self_type" : "_ZTIN3fmt2v76detail10locale_refE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lower",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "upper",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11accumulatorE",
   "name" : "fmt::detail::accumulator",
   "referenced_type" : "_ZTIN3fmt2v76detail11accumulatorE",
   "self_type" : "_ZTIN3fmt2v76detail11accumulatorE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail11char_t_implIA4_cvEE",
   "name" : "fmt::detail::char_t_impl<char[4]>",
   "referenced_type" : "_ZTIN3fmt2v76detail11char_t_implIA4_cvEE",
   "self_type" : "_ZTIN3fmt2v76detail11char_t_implIA4_cvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA4_c",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail11char_t_implIA5_cvEE",
   "name" : "fmt::detail::char_t_impl<char[5]>",
   "referenced_type" : "_ZTIN3fmt2v76detail11char_t_implIA5_cvEE",
   "self_type" : "_ZTIN3fmt2v76detail11char_t_implIA5_cvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA5_c",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail11char_t_implIA7_cvEE",
   "name" : "fmt::detail::char_t_impl<char[7]>",
   "referenced_type" : "_ZTIN3fmt2v76detail11char_t_implIA7_cvEE",
   "self_type" : "_ZTIN3fmt2v76detail11char_t_implIA7_cvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail11char_t_implINS0_17basic_string_viewIcEEvEE",
   "name" : "fmt::detail::char_t_impl<fmt::basic_string_view<char>, void>",
   "referenced_type" : "_ZTIN3fmt2v76detail11char_t_implINS0_17basic_string_viewIcEEvEE",
   "self_type" : "_ZTIN3fmt2v76detail11char_t_implINS0_17basic_string_viewIcEEvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v717basic_string_viewIcEE",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "precision",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail12float_formatE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 40,
     "referenced_type" : "_ZTIN3fmt2v74sign4typeE"
    },
    {
     "field_name" : "upper",
     "field_offset" : 48,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "locale",
     "field_offset" : 49,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "binary32",
     "field_offset" : 50,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "use_grisu",
     "field_offset" : 51,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "showpoint",
     "field_offset" : 52,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11float_specsE",
   "name" : "fmt::detail::float_specs",
   "referenced_type" : "_ZTIN3fmt2v76detail11float_specsE",
   "self_type" : "_ZTIN3fmt2v76detail11float_specsE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail11int_checkerILb1EEE",
   "name" : "fmt::detail::int_checker<true>",
   "referenced_type" : "_ZTIN3fmt2v76detail11int_checkerILb1EEE",
   "self_type" : "_ZTIN3fmt2v76detail11int_checkerILb1EEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/printf.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIN3fmt2v716basic_format_argINS2_20basic_format_contextINS2_6detail15buffer_appenderIcEEcEEE6handleEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralINS0_16basic_format_argINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEE6handleEEE",
   "name" : "fmt::detail::is_integral<fmt::basic_format_arg<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>::handle>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralINS0_16basic_format_argINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEE6handleEEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralINS0_16basic_format_argINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEE6handleEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEE6handleE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIN3fmt2v716basic_format_argINS2_20basic_format_contextINS_20back_insert_iteratorINS2_6detail6bufferIcEEEEcEEE6handleEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralINS0_16basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEE6handleEEE",
   "name" : "fmt::detail::is_integral<fmt::basic_format_arg<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>::handle>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralINS0_16basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEE6handleEEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralINS0_16basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEE6handleEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v716basic_format_argINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEE6handleE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIN3fmt2v717basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::is_integral<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v717basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIN3fmt2v79monostateEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralINS0_9monostateEEE",
   "name" : "fmt::detail::is_integral<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v79monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralINS1_8int128_tEEE",
   "name" : "fmt::detail::is_integral<fmt::detail::int128_t>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralINS1_8int128_tEEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralINS1_8int128_tEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail8int128_tE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralINS1_9uint128_tEEE",
   "name" : "fmt::detail::is_integral<fmt::detail::uint128_t>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralINS1_9uint128_tEEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralINS1_9uint128_tEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail9uint128_tE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIPKcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIPKcEE",
   "name" : "fmt::detail::is_integral<const char *>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIPKcEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIPKvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIPKvEE",
   "name" : "fmt::detail::is_integral<const void *>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIPKvEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIbEE",
   "name" : "fmt::detail::is_integral<bool>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIbEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIcEE",
   "name" : "fmt::detail::is_integral<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIcEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIdEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIdEE",
   "name" : "fmt::detail::is_integral<double>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIdEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIeEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIeEE",
   "name" : "fmt::detail::is_integral<long double>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIeEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIfEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIfEE",
   "name" : "fmt::detail::is_integral<float>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIfEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIiEE",
   "name" : "fmt::detail::is_integral<int>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIiEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIjEE",
   "name" : "fmt::detail::is_integral<unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIjEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIxEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIxEE",
   "name" : "fmt::detail::is_integral<long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIxEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIyEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_integralIyEE",
   "name" : "fmt::detail::is_integral<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_integralIyEE",
   "self_type" : "_ZTIN3fmt2v76detail11is_integralIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail11is_zero_intE",
   "name" : "fmt::detail::is_zero_int",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail11is_zero_intE",
   "self_type" : "_ZTIN3fmt2v76detail11is_zero_intE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/printf.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail11stringifierE",
   "name" : "fmt::detail::stringifier",
   "referenced_type" : "_ZTIN3fmt2v76detail11stringifierE",
   "self_type" : "_ZTIN3fmt2v76detail11stringifierE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail11void_t_implIJEEE",
   "name" : "fmt::detail::void_t_impl<>",
   "referenced_type" : "_ZTIN3fmt2v76detail11void_t_implIJEEE",
   "self_type" : "_ZTIN3fmt2v76detail11void_t_implIJEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail11void_t_implIJNSt3__119output_iterator_tagERNS3_20back_insert_iteratorINS1_6bufferIcEEEEEEE",
   "name" : "fmt::detail::void_t_impl<output_iterator_tag, back_insert_iterator<buffer<char>> &>",
   "referenced_type" : "_ZTIN3fmt2v76detail11void_t_implIJNSt3__119output_iterator_tagERNS3_20back_insert_iteratorINS1_6bufferIcEEEEEEE",
   "self_type" : "_ZTIN3fmt2v76detail11void_t_implIJNSt3__119output_iterator_tagERNS3_20back_insert_iteratorINS1_6bufferIcEEEEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPKvRN3fmt2v726basic_format_parse_contextIcNS2_6detail13error_handlerEEERNS2_20basic_format_contextINS4_15buffer_appenderIcEEcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "name" : "fmt::detail::custom_value<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPKvRN3fmt2v726basic_format_parse_contextIcNS2_6detail13error_handlerEEERNS2_20basic_format_contextINSt3__120back_insert_iteratorINS4_6bufferIcEEEEcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "name" : "fmt::detail::custom_value<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12is_named_argIA3_KcEE",
   "name" : "fmt::detail::is_named_arg<const char[3]>",
   "referenced_type" : "_ZTIN3fmt2v76detail12is_named_argIA3_KcEE",
   "self_type" : "_ZTIN3fmt2v76detail12is_named_argIA3_KcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_Kc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12is_named_argIA7_KcEE",
   "name" : "fmt::detail::is_named_arg<const char[7]>",
   "referenced_type" : "_ZTIN3fmt2v76detail12is_named_argIA7_KcEE",
   "self_type" : "_ZTIN3fmt2v76detail12is_named_argIA7_KcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_Kc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12is_named_argINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::is_named_arg<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail12is_named_argINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail12is_named_argINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v717basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12is_named_argIPcEE",
   "name" : "fmt::detail::is_named_arg<char *>",
   "referenced_type" : "_ZTIN3fmt2v76detail12is_named_argIPcEE",
   "self_type" : "_ZTIN3fmt2v76detail12is_named_argIPcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12is_named_argIiEE",
   "name" : "fmt::detail::is_named_arg<int>",
   "referenced_type" : "_ZTIN3fmt2v76detail12is_named_argIiEE",
   "self_type" : "_ZTIN3fmt2v76detail12is_named_argIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12is_named_argIjEE",
   "name" : "fmt::detail::is_named_arg<unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v76detail12is_named_argIjEE",
   "self_type" : "_ZTIN3fmt2v76detail12is_named_argIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIRN3fmt2v718basic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12specs_setterIcEE",
   "name" : "fmt::detail::specs_setter<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail12specs_setterIcEE",
   "self_type" : "_ZTIN3fmt2v76detail12specs_setterIcEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail12string_valueIcEE",
   "name" : "fmt::detail::string_value<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail12string_valueIcEE",
   "self_type" : "_ZTIN3fmt2v76detail12string_valueIcEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIRN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
    },
    {
     "access" : "private",
     "field_name" : "parse_ctx_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE"
    },
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13arg_formatterINS1_15buffer_appenderIcEEcEE",
   "name" : "fmt::detail::arg_formatter<fmt::detail::buffer_appender<char>, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail13arg_formatterINS1_15buffer_appenderIcEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail13arg_formatterINS1_15buffer_appenderIcEEcEE",
   "size" : 24,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIRN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
    },
    {
     "access" : "private",
     "field_name" : "parse_ctx_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE"
    },
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13arg_formatterINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEE",
   "name" : "fmt::detail::arg_formatter<std::back_insert_iterator<fmt::detail::buffer<char>>, char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail13arg_formatterINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail13arg_formatterINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEE",
   "size" : 24,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail13buffer_traitsE",
   "name" : "fmt::detail::buffer_traits",
   "referenced_type" : "_ZTIN3fmt2v76detail13buffer_traitsE",
   "self_type" : "_ZTIN3fmt2v76detail13buffer_traitsE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail13error_handlerE",
   "name" : "fmt::detail::error_handler",
   "referenced_type" : "_ZTIN3fmt2v76detail13error_handlerE",
   "self_type" : "_ZTIN3fmt2v76detail13error_handlerE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "precision",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "exp10",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fixed",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13fixed_handlerE",
   "name" : "fmt::detail::fixed_handler",
   "referenced_type" : "_ZTIN3fmt2v76detail13fixed_handlerE",
   "self_type" : "_ZTIN3fmt2v76detail13fixed_handlerE",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "checker_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN3fmt2v76detail21numeric_specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE",
   "name" : "fmt::detail::specs_checker<fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE",
   "self_type" : "_ZTIN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "checker_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN3fmt2v76detail21numeric_specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE",
   "name" : "fmt::detail::specs_checker<fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE",
   "self_type" : "_ZTIN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail12specs_setterIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "parse_context_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIRN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "name" : "fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE",
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail12specs_setterIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "parse_context_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIRN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "name" : "fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE",
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_15EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIA3_ccEE",
   "name" : "fmt::detail::type_constant<char[3], char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIA3_ccEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIA3_ccEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_15EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIA7_ccEE",
   "name" : "fmt::detail::type_constant<char[7], char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIA7_ccEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIA7_ccEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_13EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantINS0_17basic_string_viewIcEEcEE",
   "name" : "fmt::detail::type_constant<fmt::basic_string_view<char>, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantINS0_17basic_string_viewIcEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantINS0_17basic_string_viewIcEEcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v717basic_string_viewIcEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_15EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantINS0_9monostateEcEE",
   "name" : "fmt::detail::type_constant<fmt::monostate, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantINS0_9monostateEcEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantINS0_9monostateEcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v79monostateE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_15EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantINS1_13unformattableEcEE",
   "name" : "fmt::detail::type_constant<fmt::detail::unformattable, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantINS1_13unformattableEcEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantINS1_13unformattableEcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail13unformattableE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_12EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIPKccEE",
   "name" : "fmt::detail::type_constant<const char *, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIPKccEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIPKccEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_14EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIPKvcEE",
   "name" : "fmt::detail::type_constant<const void *, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIPKvcEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIPKvcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_15EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIPccEE",
   "name" : "fmt::detail::type_constant<char *, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIPccEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIPccEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_7EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIbcEE",
   "name" : "fmt::detail::type_constant<bool, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIbcEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIbcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIccEE",
   "name" : "fmt::detail::type_constant<char, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIccEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIccEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_10EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIdcEE",
   "name" : "fmt::detail::type_constant<double, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIdcEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIdcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_11EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIecEE",
   "name" : "fmt::detail::type_constant<long double, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIecEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIecEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_9EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIfcEE",
   "name" : "fmt::detail::type_constant<float, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIfcEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIfcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIicEE",
   "name" : "fmt::detail::type_constant<int, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIicEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIicEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIjcEE",
   "name" : "fmt::detail::type_constant<unsigned int, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIjcEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIjcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_3EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIxcEE",
   "name" : "fmt::detail::type_constant<long long, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIxcEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIxcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt2v76detail4typeELS4_4EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13type_constantIycEE",
   "name" : "fmt::detail::type_constant<unsigned long long, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13type_constantIycEE",
   "self_type" : "_ZTIN3fmt2v76detail13type_constantIycEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail13unformattableE",
   "name" : "fmt::detail::unformattable",
   "referenced_type" : "_ZTIN3fmt2v76detail13unformattableE",
   "self_type" : "_ZTIN3fmt2v76detail13unformattableE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIN3fmt2v719basic_memory_bufferIwLj500ENSt3__19allocatorIwEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13utf8_to_utf16E",
   "name" : "fmt::detail::utf8_to_utf16",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail13utf8_to_utf16E",
   "self_type" : "_ZTIN3fmt2v76detail13utf8_to_utf16E",
   "size" : 2020,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13width_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEEcEE",
   "name" : "fmt::detail::width_adapter<fmt::detail::specs_checker<fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>> &, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13width_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail13width_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEEcEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIRN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13width_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEEcEE",
   "name" : "fmt::detail::width_adapter<fmt::detail::specs_checker<fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>> &, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail13width_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail13width_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEEcEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIRN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRN3fmt2v76detail13error_handlerE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail13width_checkerINS1_13error_handlerEEE",
   "name" : "fmt::detail::width_checker<fmt::detail::error_handler>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail13width_checkerINS1_13error_handlerEEE",
   "self_type" : "_ZTIN3fmt2v76detail13width_checkerINS1_13error_handlerEEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail13error_handlerE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "significand_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail14big_decimal_fpE",
   "name" : "fmt::detail::big_decimal_fp",
   "referenced_type" : "_ZTIN3fmt2v76detail14big_decimal_fpE",
   "self_type" : "_ZTIN3fmt2v76detail14big_decimal_fpE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail13error_handlerE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "parse_context",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE"
    },
    {
     "field_name" : "context",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail14format_handlerINS1_15buffer_appenderIcEEcNS0_20basic_format_contextIS4_cEEEE",
   "name" : "fmt::detail::format_handler<fmt::detail::buffer_appender<char>, char, fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail14format_handlerINS1_15buffer_appenderIcEEcNS0_20basic_format_contextIS4_cEEEE",
   "self_type" : "_ZTIN3fmt2v76detail14format_handlerINS1_15buffer_appenderIcEEcNS0_20basic_format_contextIS4_cEEEE",
   "size" : 36,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
    "_ZTIc",
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail13error_handlerE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "parse_context",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE"
    },
    {
     "field_name" : "context",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail14format_handlerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS0_20basic_format_contextIS7_cEEEE",
   "name" : "fmt::detail::format_handler<std::back_insert_iterator<fmt::detail::buffer<char>>, char, fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail14format_handlerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS0_20basic_format_contextIS7_cEEEE",
   "self_type" : "_ZTIN3fmt2v76detail14format_handlerINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS0_20basic_format_contextIS7_cEEEE",
   "size" : 36,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE",
    "_ZTIc",
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail14named_arg_infoIcEE",
   "name" : "fmt::detail::named_arg_info<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail14named_arg_infoIcEE",
   "self_type" : "_ZTIN3fmt2v76detail14named_arg_infoIcEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "padding",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail14write_int_dataIcEE",
   "name" : "fmt::detail::write_int_data<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail14write_int_dataIcEE",
   "self_type" : "_ZTIN3fmt2v76detail14write_int_dataIcEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
   "name" : "fmt::detail::buffer_appender<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
   "self_type" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail6bufferIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "access" : "private",
     "field_name" : "count_",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail15counting_bufferIcEE",
   "name" : "fmt::detail::counting_buffer<>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail15counting_bufferIcEE",
   "self_type" : "_ZTIN3fmt2v76detail15counting_bufferIcEE",
   "size" : 276,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v76detail15counting_bufferIcEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt2v76detail15counting_bufferIcE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKN3fmt2v76detail14named_arg_infoIcEE"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail15named_arg_valueIcEE",
   "name" : "fmt::detail::named_arg_value<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail15named_arg_valueIcEE",
   "self_type" : "_ZTIN3fmt2v76detail15named_arg_valueIcEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "high_",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "low_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail15uint128_wrapperE",
   "name" : "fmt::detail::uint128_wrapper",
   "referenced_type" : "_ZTIN3fmt2v76detail15uint128_wrapperE",
   "self_type" : "_ZTIN3fmt2v76detail15uint128_wrapperE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "parse_ctx_",
     "referenced_type" : "_ZTIRN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE"
    },
    {
     "access" : "private",
     "field_name" : "ctx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIRN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail16custom_formatterINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "name" : "fmt::detail::custom_formatter<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail16custom_formatterINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail16custom_formatterINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "parse_ctx_",
     "referenced_type" : "_ZTIRN3fmt2v726basic_format_parse_contextIcNS0_6detail13error_handlerEEE"
    },
    {
     "access" : "private",
     "field_name" : "ctx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIRN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail16custom_formatterINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "name" : "fmt::detail::custom_formatter<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail16custom_formatterINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail16custom_formatterINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN3fmt2v76detail16dynamic_arg_list4nodeIvEENS_14default_deleteIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail16dynamic_arg_list4nodeIvEE",
   "name" : "fmt::detail::dynamic_arg_list::node<>",
   "referenced_type" : "_ZTIN3fmt2v76detail16dynamic_arg_list4nodeIvEE",
   "self_type" : "_ZTIN3fmt2v76detail16dynamic_arg_list4nodeIvEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIv"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v76detail16dynamic_arg_list4nodeIvEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt2v76detail16dynamic_arg_list4nodeIvED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt2v76detail16dynamic_arg_list4nodeIvED0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "head_",
     "referenced_type" : "_ZTINSt3__110unique_ptrIN3fmt2v76detail16dynamic_arg_list4nodeIvEENS_14default_deleteIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail16dynamic_arg_listE",
   "name" : "fmt::detail::dynamic_arg_list",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail16dynamic_arg_listE",
   "self_type" : "_ZTIN3fmt2v76detail16dynamic_arg_listE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail16fallback_uintptrE",
   "name" : "fmt::detail::fallback_uintptr",
   "referenced_type" : "_ZTIN3fmt2v76detail16fallback_uintptrE",
   "self_type" : "_ZTIN3fmt2v76detail16fallback_uintptrE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail17counting_iterator10value_typeE",
   "name" : "fmt::detail::counting_iterator::value_type",
   "referenced_type" : "_ZTIN3fmt2v76detail17counting_iterator10value_typeE",
   "self_type" : "_ZTIN3fmt2v76detail17counting_iterator10value_typeE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail17counting_iteratorE",
   "name" : "fmt::detail::counting_iterator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail17counting_iteratorE",
   "self_type" : "_ZTIN3fmt2v76detail17counting_iteratorE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail17precision_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEEcEE",
   "name" : "fmt::detail::precision_adapter<fmt::detail::specs_checker<fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>> &, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail17precision_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail17precision_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEEcEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIRN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "handler",
     "referenced_type" : "_ZTIRN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail17precision_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEEcEE",
   "name" : "fmt::detail::precision_adapter<fmt::detail::specs_checker<fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>> &, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail17precision_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail17precision_adapterIRNS1_13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEEcEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIRN3fmt2v76detail13specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "handler_",
     "referenced_type" : "_ZTIRN3fmt2v76detail13error_handlerE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail17precision_checkerINS1_13error_handlerEEE",
   "name" : "fmt::detail::precision_checker<fmt::detail::error_handler>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail17precision_checkerINS1_13error_handlerEEE",
   "self_type" : "_ZTIN3fmt2v76detail17precision_checkerINS1_13error_handlerEEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail13error_handlerE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail13error_handlerE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "formatter",
     "referenced_type" : "_ZTIRN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEEE"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEE17char_spec_handlerE",
   "name" : "fmt::detail::arg_formatter_base<fmt::detail::buffer_appender<char>, char, fmt::detail::error_handler>::char_spec_handler",
   "referenced_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEE17char_spec_handlerE",
   "self_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEE17char_spec_handlerE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail13error_handlerE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "formatter",
     "referenced_type" : "_ZTIRN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEEE"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEE20cstring_spec_handlerE",
   "name" : "fmt::detail::arg_formatter_base<fmt::detail::buffer_appender<char>, char, fmt::detail::error_handler>::cstring_spec_handler",
   "referenced_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEE20cstring_spec_handlerE",
   "self_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEE20cstring_spec_handlerE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "out_",
     "referenced_type" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE"
    },
    {
     "access" : "private",
     "field_name" : "locale_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    },
    {
     "access" : "private",
     "field_name" : "specs_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN3fmt2v718basic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEEE",
   "name" : "fmt::detail::arg_formatter_base<fmt::detail::buffer_appender<char>, char, fmt::detail::error_handler>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEEE",
   "self_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINS1_15buffer_appenderIcEEcNS1_13error_handlerEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
    "_ZTIc",
    "_ZTIN3fmt2v76detail13error_handlerE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail13error_handlerE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "formatter",
     "referenced_type" : "_ZTIRN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEEE"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEE17char_spec_handlerE",
   "name" : "fmt::detail::arg_formatter_base<std::back_insert_iterator<fmt::detail::buffer<char>>, char, fmt::detail::error_handler>::char_spec_handler",
   "referenced_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEE17char_spec_handlerE",
   "self_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEE17char_spec_handlerE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail13error_handlerE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "formatter",
     "referenced_type" : "_ZTIRN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEEE"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEE20cstring_spec_handlerE",
   "name" : "fmt::detail::arg_formatter_base<std::back_insert_iterator<fmt::detail::buffer<char>>, char, fmt::detail::error_handler>::cstring_spec_handler",
   "referenced_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEE20cstring_spec_handlerE",
   "self_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEE20cstring_spec_handlerE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "out_",
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "locale_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    },
    {
     "access" : "private",
     "field_name" : "specs_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN3fmt2v718basic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEEE",
   "name" : "fmt::detail::arg_formatter_base<std::back_insert_iterator<fmt::detail::buffer<char>>, char, fmt::detail::error_handler>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEEE",
   "self_type" : "_ZTIN3fmt2v76detail18arg_formatter_baseINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcNS1_13error_handlerEEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE",
    "_ZTIc",
    "_ZTIN3fmt2v76detail13error_handlerE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIA3_ccvEE",
   "name" : "fmt::detail::fallback_formatter<char[3]>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIA3_ccvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIA3_ccvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIA7_ccvEE",
   "name" : "fmt::detail::fallback_formatter<char[7]>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIA7_ccvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIA7_ccvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterINS0_17basic_string_viewIcEEcvEE",
   "name" : "fmt::detail::fallback_formatter<fmt::basic_string_view<char>, char, void>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterINS0_17basic_string_viewIcEEcvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterINS0_17basic_string_viewIcEEcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v717basic_string_viewIcEE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterINS0_9monostateEcvEE",
   "name" : "fmt::detail::fallback_formatter<fmt::monostate, char, void>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterINS0_9monostateEcvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterINS0_9monostateEcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v79monostateE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIPKccvEE",
   "name" : "fmt::detail::fallback_formatter<const char *>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIPKccvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIPKccvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIPKvcvEE",
   "name" : "fmt::detail::fallback_formatter<const void *>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIPKvcvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIPKvcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIPccvEE",
   "name" : "fmt::detail::fallback_formatter<char *>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIPccvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIPccvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPc",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIbcvEE",
   "name" : "fmt::detail::fallback_formatter<bool>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIbcvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIbcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIccvEE",
   "name" : "fmt::detail::fallback_formatter<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIccvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIccvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIdcvEE",
   "name" : "fmt::detail::fallback_formatter<double>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIdcvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIdcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIecvEE",
   "name" : "fmt::detail::fallback_formatter<long double>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIecvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIecvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIfcvEE",
   "name" : "fmt::detail::fallback_formatter<float>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIfcvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIfcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIicvEE",
   "name" : "fmt::detail::fallback_formatter<int>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIicvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIicvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIjcvEE",
   "name" : "fmt::detail::fallback_formatter<unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIjcvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIjcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIxcvEE",
   "name" : "fmt::detail::fallback_formatter<long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIxcvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIxcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail18fallback_formatterIycvEE",
   "name" : "fmt::detail::fallback_formatter<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail18fallback_formatterIycvEE",
   "self_type" : "_ZTIN3fmt2v76detail18fallback_formatterIycvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail18is_output_iteratorINS1_15buffer_appenderIcEEcvEE",
   "name" : "fmt::detail::is_output_iterator<fmt::detail::buffer_appender<char>, char, void>",
   "referenced_type" : "_ZTIN3fmt2v76detail18is_output_iteratorINS1_15buffer_appenderIcEEcvEE",
   "self_type" : "_ZTIN3fmt2v76detail18is_output_iteratorINS1_15buffer_appenderIcEEcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mod_inv",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_quotient",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail19divtest_table_entryIjEE",
   "name" : "fmt::detail::divtest_table_entry<unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v76detail19divtest_table_entryIjEE",
   "self_type" : "_ZTIN3fmt2v76detail19divtest_table_entryIjEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mod_inv",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "max_quotient",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail19divtest_table_entryIyEE",
   "name" : "fmt::detail::divtest_table_entry<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail19divtest_table_entryIyEE",
   "self_type" : "_ZTIN3fmt2v76detail19divtest_table_entryIyEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail19fixed_buffer_traitsE",
   "name" : "fmt::detail::fixed_buffer_traits",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail19fixed_buffer_traitsE",
   "self_type" : "_ZTIN3fmt2v76detail19fixed_buffer_traitsE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v718basic_format_specsIcEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "width_ref",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt2v76detail7arg_refIcEE"
    },
    {
     "field_name" : "precision_ref",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN3fmt2v76detail7arg_refIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE",
   "name" : "fmt::detail::dynamic_format_specs<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE",
   "self_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail21chrono_format_checkerE",
   "name" : "fmt::detail::chrono_format_checker",
   "referenced_type" : "_ZTIN3fmt2v76detail21chrono_format_checkerE",
   "self_type" : "_ZTIN3fmt2v76detail21chrono_format_checkerE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "out",
     "referenced_type" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE"
    },
    {
     "field_name" : "args",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINS0_6detail15buffer_appenderIcEEcEEEE"
    },
    {
     "field_name" : "loc",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail21default_arg_formatterINS1_15buffer_appenderIcEEcEE",
   "name" : "fmt::detail::default_arg_formatter<fmt::detail::buffer_appender<char>, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail21default_arg_formatterINS1_15buffer_appenderIcEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail21default_arg_formatterINS1_15buffer_appenderIcEEcEE",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "out",
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
    },
    {
     "field_name" : "args",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v717basic_format_argsINS0_20basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEEEE"
    },
    {
     "field_name" : "loc",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt2v76detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail21default_arg_formatterINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEE",
   "name" : "fmt::detail::default_arg_formatter<std::back_insert_iterator<fmt::detail::buffer<char>>, char>",
   "referenced_type" : "_ZTIN3fmt2v76detail21default_arg_formatterINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEE",
   "self_type" : "_ZTIN3fmt2v76detail21default_arg_formatterINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEE",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "begin",
     "referenced_type" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE"
    },
    {
     "field_name" : "end",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail15buffer_appenderIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail21format_decimal_resultINS1_15buffer_appenderIcEEEE",
   "name" : "fmt::detail::format_decimal_result<fmt::detail::buffer_appender<char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail21format_decimal_resultINS1_15buffer_appenderIcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail21format_decimal_resultINS1_15buffer_appenderIcEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "begin",
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
    },
    {
     "field_name" : "end",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail21format_decimal_resultINSt3__120back_insert_iteratorINS1_6bufferIcEEEEEE",
   "name" : "fmt::detail::format_decimal_result<std::back_insert_iterator<fmt::detail::buffer<char>>>",
   "referenced_type" : "_ZTIN3fmt2v76detail21format_decimal_resultINSt3__120back_insert_iteratorINS1_6bufferIcEEEEEE",
   "self_type" : "_ZTIN3fmt2v76detail21format_decimal_resultINSt3__120back_insert_iteratorINS1_6bufferIcEEEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "begin",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "end",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail21format_decimal_resultIPcEE",
   "name" : "fmt::detail::format_decimal_result<char *>",
   "referenced_type" : "_ZTIN3fmt2v76detail21format_decimal_resultIPcEE",
   "self_type" : "_ZTIN3fmt2v76detail21format_decimal_resultIPcEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail21make_unsigned_or_boolIbEE",
   "name" : "fmt::detail::make_unsigned_or_bool<bool>",
   "referenced_type" : "_ZTIN3fmt2v76detail21make_unsigned_or_boolIbEE",
   "self_type" : "_ZTIN3fmt2v76detail21make_unsigned_or_boolIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/printf.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "error_handler_",
     "referenced_type" : "_ZTIRN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "arg_type_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail4typeE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail21numeric_specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE",
   "name" : "fmt::detail::numeric_specs_checker<fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail21numeric_specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE",
   "self_type" : "_ZTIN3fmt2v76detail21numeric_specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "error_handler_",
     "referenced_type" : "_ZTIRN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "arg_type_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail4typeE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail21numeric_specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE",
   "name" : "fmt::detail::numeric_specs_checker<fmt::detail::specs_handler<fmt::basic_format_parse_context<char, fmt::detail::error_handler>, fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail21numeric_specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE",
   "self_type" : "_ZTIN3fmt2v76detail21numeric_specs_checkerINS1_13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail13specs_handlerINS0_26basic_format_parse_contextIcNS1_13error_handlerEEENS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail23is_back_insert_iteratorINS1_15buffer_appenderIcEEEE",
   "name" : "fmt::detail::is_back_insert_iterator<fmt::detail::buffer_appender<char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail23is_back_insert_iteratorINS1_15buffer_appenderIcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail23is_back_insert_iteratorINS1_15buffer_appenderIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail15buffer_appenderIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail23is_back_insert_iteratorINSt3__120back_insert_iteratorINS1_6bufferIcEEEEEE",
   "name" : "fmt::detail::is_back_insert_iterator<std::back_insert_iterator<fmt::detail::buffer<char>>>",
   "referenced_type" : "_ZTIN3fmt2v76detail23is_back_insert_iteratorINSt3__120back_insert_iteratorINS1_6bufferIcEEEEEE",
   "self_type" : "_ZTIN3fmt2v76detail23is_back_insert_iteratorINSt3__120back_insert_iteratorINS1_6bufferIcEEEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTINSt3__120back_insert_iteratorIN3fmt2v76detail6bufferIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail24printf_precision_handlerE",
   "name" : "fmt::detail::printf_precision_handler",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail24printf_precision_handlerE",
   "self_type" : "_ZTIN3fmt2v76detail24printf_precision_handlerE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/printf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "e",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail2fpE",
   "name" : "fmt::detail::fp",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail2fpE",
   "self_type" : "_ZTIN3fmt2v76detail2fpE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail4bitsIdEE",
   "name" : "fmt::detail::bits<double>",
   "referenced_type" : "_ZTIN3fmt2v76detail4bitsIdEE",
   "self_type" : "_ZTIN3fmt2v76detail4bitsIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail4bitsIeEE",
   "name" : "fmt::detail::bits<long double>",
   "referenced_type" : "_ZTIN3fmt2v76detail4bitsIeEE",
   "self_type" : "_ZTIN3fmt2v76detail4bitsIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail4bitsIfEE",
   "name" : "fmt::detail::bits<float>",
   "referenced_type" : "_ZTIN3fmt2v76detail4bitsIfEE",
   "self_type" : "_ZTIN3fmt2v76detail4bitsIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail4bitsIjEE",
   "name" : "fmt::detail::bits<unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v76detail4bitsIjEE",
   "self_type" : "_ZTIN3fmt2v76detail4bitsIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail4bitsIyEE",
   "name" : "fmt::detail::bits<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail4bitsIyEE",
   "self_type" : "_ZTIN3fmt2v76detail4bitsIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail10basic_dataIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail4dataE",
   "name" : "fmt::detail::data",
   "referenced_type" : "_ZTIN3fmt2v76detail4dataE",
   "self_type" : "_ZTIN3fmt2v76detail4dataE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail4nullIvEE",
   "name" : "fmt::detail::null<>",
   "referenced_type" : "_ZTIN3fmt2v76detail4nullIvEE",
   "self_type" : "_ZTIN3fmt2v76detail4nullIvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail4viewE",
   "name" : "fmt::detail::view",
   "referenced_type" : "_ZTIN3fmt2v76detail4viewE",
   "self_type" : "_ZTIN3fmt2v76detail4viewE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "name" : "fmt::detail::value<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINS0_6detail15buffer_appenderIcEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "int_value",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uint_value",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "long_long_value",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "ulong_long_value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "int128_value",
     "referenced_type" : "_ZTIN3fmt2v76detail8int128_tE"
    },
    {
     "field_name" : "uint128_value",
     "referenced_type" : "_ZTIN3fmt2v76detail9uint128_tE"
    },
    {
     "field_name" : "bool_value",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "char_value",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "float_value",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "double_value",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "long_double_value",
     "referenced_type" : "_ZTIe"
    },
    {
     "field_name" : "pointer",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "string",
     "referenced_type" : "_ZTIN3fmt2v76detail12string_valueIcEE"
    },
    {
     "field_name" : "custom",
     "referenced_type" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
    },
    {
     "field_name" : "named_args",
     "referenced_type" : "_ZTIN3fmt2v76detail15named_arg_valueIcEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEUt_E",
   "name" : "fmt::detail::value<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>::(anonymous union at external/fmtlib/include/fmt/core.h:1053:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEUt_E",
   "self_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEUt_E",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "name" : "fmt::detail::value<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v720basic_format_contextINSt3__120back_insert_iteratorINS0_6detail6bufferIcEEEEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "int_value",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uint_value",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "long_long_value",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "ulong_long_value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "int128_value",
     "referenced_type" : "_ZTIN3fmt2v76detail8int128_tE"
    },
    {
     "field_name" : "uint128_value",
     "referenced_type" : "_ZTIN3fmt2v76detail9uint128_tE"
    },
    {
     "field_name" : "bool_value",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "char_value",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "float_value",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "double_value",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "long_double_value",
     "referenced_type" : "_ZTIe"
    },
    {
     "field_name" : "pointer",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "string",
     "referenced_type" : "_ZTIN3fmt2v76detail12string_valueIcEE"
    },
    {
     "field_name" : "custom",
     "referenced_type" : "_ZTIN3fmt2v76detail12custom_valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEE"
    },
    {
     "field_name" : "named_args",
     "referenced_type" : "_ZTIN3fmt2v76detail15named_arg_valueIcEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEUt_E",
   "name" : "fmt::detail::value<fmt::basic_format_context<std::back_insert_iterator<fmt::detail::buffer<char>>, char>>::(anonymous union at external/fmtlib/include/fmt/core.h:1053:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEUt_E",
   "self_type" : "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINSt3__120back_insert_iteratorINS1_6bufferIcEEEEcEEEUt_E",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "bigits_",
     "referenced_type" : "_ZTIN3fmt2v719basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE"
    },
    {
     "access" : "private",
     "field_name" : "exp_",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail6bigintE",
   "name" : "fmt::detail::bigint",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail6bigintE",
   "self_type" : "_ZTIN3fmt2v76detail6bigintE",
   "size" : 152,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail6bufferIcEE",
   "name" : "fmt::detail::buffer<char>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail6bufferIcEE",
   "self_type" : "_ZTIN3fmt2v76detail6bufferIcEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v76detail6bufferIcEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt2v76detail6bufferIcE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPj"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail6bufferIjEE",
   "name" : "fmt::detail::buffer<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail6bufferIjEE",
   "self_type" : "_ZTIN3fmt2v76detail6bufferIjEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v76detail6bufferIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt2v76detail6bufferIjE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPw"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail6bufferIwEE",
   "name" : "fmt::detail::buffer<wchar_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3fmt2v76detail6bufferIwEE",
   "self_type" : "_ZTIN3fmt2v76detail6bufferIwEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIw"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt2v76detail6bufferIwEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt2v76detail6bufferIwE4growEj"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail6fill_tIcEE",
   "name" : "fmt::detail::fill_t<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail6fill_tIcEE",
   "self_type" : "_ZTIN3fmt2v76detail6fill_tIcEE",
   "size" : 5,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIN3fmt2v717basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail7arg_refIcE5valueE",
   "name" : "fmt::detail::arg_ref<char>::value",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN3fmt2v76detail7arg_refIcE5valueE",
   "self_type" : "_ZTIN3fmt2v76detail7arg_refIcE5valueE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "_ZTIN3fmt2v76detail11arg_id_kindE"
    },
    {
     "field_name" : "val",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt2v76detail7arg_refIcE5valueE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail7arg_refIcEE",
   "name" : "fmt::detail::arg_ref<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail7arg_refIcEE",
   "self_type" : "_ZTIN3fmt2v76detail7arg_refIcEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail7auto_idE",
   "name" : "fmt::detail::auto_id",
   "referenced_type" : "_ZTIN3fmt2v76detail7auto_idE",
   "self_type" : "_ZTIN3fmt2v76detail7auto_idE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "str",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail7udl_argIcEE",
   "name" : "fmt::detail::udl_arg<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail7udl_argIcEE",
   "self_type" : "_ZTIN3fmt2v76detail7udl_argIcEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "str",
     "referenced_type" : "_ZTIPKw"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail7udl_argIwEE",
   "name" : "fmt::detail::udl_arg<wchar_t>",
   "referenced_type" : "_ZTIN3fmt2v76detail7udl_argIwEE",
   "self_type" : "_ZTIN3fmt2v76detail7udl_argIwEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIA1_N3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj1ELj0EEE",
   "name" : "fmt::detail::arg_data<fmt::detail::value<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>, char, 1U, 0U>",
   "referenced_type" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj1ELj0EEE",
   "self_type" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj1ELj0EEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIA2_N3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj2ELj0EEE",
   "name" : "fmt::detail::arg_data<fmt::detail::value<fmt::basic_format_context<fmt::detail::buffer_appender<char>, char>>, char, 2U, 0U>",
   "referenced_type" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj2ELj0EEE",
   "self_type" : "_ZTIN3fmt2v76detail8arg_dataINS1_5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEEcLj2ELj0EEE",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail5valueINS0_20basic_format_contextINS1_15buffer_appenderIcEEcEEEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail8int128_tE",
   "name" : "fmt::detail::int128_t",
   "referenced_type" : "_ZTIN3fmt2v76detail8int128_tE",
   "self_type" : "_ZTIN3fmt2v76detail8int128_tE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail9converterE",
   "name" : "fmt::detail::converter",
   "referenced_type" : "_ZTIN3fmt2v76detail9converterE",
   "self_type" : "_ZTIN3fmt2v76detail9converterE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/ostream.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9dragonbox10decimal_fpIdEE",
   "name" : "fmt::detail::dragonbox::decimal_fp<double>",
   "referenced_type" : "_ZTIN3fmt2v76detail9dragonbox10decimal_fpIdEE",
   "self_type" : "_ZTIN3fmt2v76detail9dragonbox10decimal_fpIdEE",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9dragonbox10decimal_fpIfEE",
   "name" : "fmt::detail::dragonbox::decimal_fp<float>",
   "referenced_type" : "_ZTIN3fmt2v76detail9dragonbox10decimal_fpIfEE",
   "self_type" : "_ZTIN3fmt2v76detail9dragonbox10decimal_fpIfEE",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail9dragonbox10float_infoIdEE",
   "name" : "fmt::detail::dragonbox::float_info<double>",
   "referenced_type" : "_ZTIN3fmt2v76detail9dragonbox10float_infoIdEE",
   "self_type" : "_ZTIN3fmt2v76detail9dragonbox10float_infoIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail9dragonbox10float_infoIfEE",
   "name" : "fmt::detail::dragonbox::float_info<float>",
   "referenced_type" : "_ZTIN3fmt2v76detail9dragonbox10float_infoIfEE",
   "self_type" : "_ZTIN3fmt2v76detail9dragonbox10float_infoIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail9dragonbox14cache_accessorIdEE",
   "name" : "fmt::detail::dragonbox::cache_accessor<double>",
   "referenced_type" : "_ZTIN3fmt2v76detail9dragonbox14cache_accessorIdEE",
   "self_type" : "_ZTIN3fmt2v76detail9dragonbox14cache_accessorIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail9dragonbox14cache_accessorIfEE",
   "name" : "fmt::detail::dragonbox::cache_accessor<float>",
   "referenced_type" : "_ZTIN3fmt2v76detail9dragonbox14cache_accessorIfEE",
   "self_type" : "_ZTIN3fmt2v76detail9dragonbox14cache_accessorIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt2v717basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIA3_cEE",
   "name" : "fmt::detail::is_string<char[3]>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIA3_cEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIA3_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt2v717basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIA4_cEE",
   "name" : "fmt::detail::is_string<char[4]>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIA4_cEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIA4_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA4_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt2v717basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIA5_cEE",
   "name" : "fmt::detail::is_string<char[5]>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIA5_cEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIA5_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA5_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt2v717basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIA7_cEE",
   "name" : "fmt::detail::is_string<char[7]>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIA7_cEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIA7_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt2v717basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::is_string<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v717basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringINS0_9monostateEEE",
   "name" : "fmt::detail::is_string<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v79monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt2v717basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIPKcEE",
   "name" : "fmt::detail::is_string<const char *>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIPKcEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIPKvEE",
   "name" : "fmt::detail::is_string<const void *>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIPKvEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIN3fmt2v717basic_string_viewIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIPcEE",
   "name" : "fmt::detail::is_string<char *>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIPcEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIPcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIbEE",
   "name" : "fmt::detail::is_string<bool>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIbEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIcEE",
   "name" : "fmt::detail::is_string<char>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIcEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIdEE",
   "name" : "fmt::detail::is_string<double>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIdEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIeEE",
   "name" : "fmt::detail::is_string<long double>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIeEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIfEE",
   "name" : "fmt::detail::is_string<float>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIfEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIiEE",
   "name" : "fmt::detail::is_string<int>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIiEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIjEE",
   "name" : "fmt::detail::is_string<unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIjEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIxEE",
   "name" : "fmt::detail::is_string<long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIxEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__18is_classIvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v76detail9is_stringIyEE",
   "name" : "fmt::detail::is_string<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v76detail9is_stringIyEE",
   "self_type" : "_ZTIN3fmt2v76detail9is_stringIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v76detail9uint128_tE",
   "name" : "fmt::detail::uint128_t",
   "referenced_type" : "_ZTIN3fmt2v76detail9uint128_tE",
   "self_type" : "_ZTIN3fmt2v76detail9uint128_tE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIA3_cEE",
   "name" : "fmt::is_char<char[3]>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIA3_cEE",
   "self_type" : "_ZTIN3fmt2v77is_charIA3_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA3_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIA7_cEE",
   "name" : "fmt::is_char<char[7]>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIA7_cEE",
   "self_type" : "_ZTIN3fmt2v77is_charIA7_cEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIA7_c"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIDiEE",
   "name" : "fmt::is_char<char32_t>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIDiEE",
   "self_type" : "_ZTIN3fmt2v77is_charIDiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIDsEE",
   "name" : "fmt::is_char<char16_t>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIDsEE",
   "self_type" : "_ZTIN3fmt2v77is_charIDsEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIDs"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::is_char<fmt::basic_string_view<char>>",
   "referenced_type" : "_ZTIN3fmt2v77is_charINS0_17basic_string_viewIcEEEE",
   "self_type" : "_ZTIN3fmt2v77is_charINS0_17basic_string_viewIcEEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v717basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charINS0_6detail10char8_typeEEE",
   "name" : "fmt::is_char<fmt::detail::char8_type>",
   "referenced_type" : "_ZTIN3fmt2v77is_charINS0_6detail10char8_typeEEE",
   "self_type" : "_ZTIN3fmt2v77is_charINS0_6detail10char8_typeEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail10char8_typeE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charINS0_9monostateEEE",
   "name" : "fmt::is_char<fmt::monostate>",
   "referenced_type" : "_ZTIN3fmt2v77is_charINS0_9monostateEEE",
   "self_type" : "_ZTIN3fmt2v77is_charINS0_9monostateEEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v79monostateE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIPKcEE",
   "name" : "fmt::is_char<const char *>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIPKcEE",
   "self_type" : "_ZTIN3fmt2v77is_charIPKcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIPKvEE",
   "name" : "fmt::is_char<const void *>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIPKvEE",
   "self_type" : "_ZTIN3fmt2v77is_charIPKvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIPcEE",
   "name" : "fmt::is_char<char *>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIPcEE",
   "self_type" : "_ZTIN3fmt2v77is_charIPcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIbEE",
   "name" : "fmt::is_char<bool>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIbEE",
   "self_type" : "_ZTIN3fmt2v77is_charIbEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIcEE",
   "name" : "fmt::is_char<char>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIcEE",
   "self_type" : "_ZTIN3fmt2v77is_charIcEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIdEE",
   "name" : "fmt::is_char<double>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIdEE",
   "self_type" : "_ZTIN3fmt2v77is_charIdEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIeEE",
   "name" : "fmt::is_char<long double>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIeEE",
   "self_type" : "_ZTIN3fmt2v77is_charIeEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIfEE",
   "name" : "fmt::is_char<float>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIfEE",
   "self_type" : "_ZTIN3fmt2v77is_charIfEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIiEE",
   "name" : "fmt::is_char<int>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIiEE",
   "self_type" : "_ZTIN3fmt2v77is_charIiEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIjEE",
   "name" : "fmt::is_char<unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIjEE",
   "self_type" : "_ZTIN3fmt2v77is_charIjEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIvEE",
   "name" : "fmt::is_char<void>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIvEE",
   "self_type" : "_ZTIN3fmt2v77is_charIvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIwEE",
   "name" : "fmt::is_char<wchar_t>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIwEE",
   "self_type" : "_ZTIN3fmt2v77is_charIwEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIxEE",
   "name" : "fmt::is_char<long long>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIxEE",
   "self_type" : "_ZTIN3fmt2v77is_charIxEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v77is_charIyEE",
   "name" : "fmt::is_char<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v77is_charIyEE",
   "self_type" : "_ZTIN3fmt2v77is_charIyEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v79formatterINS0_17basic_string_viewIcEEcvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIA3_ccvEE",
   "name" : "fmt::formatter<char[3]>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIA3_ccvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIA3_ccvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIA3_c",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v79formatterINS0_17basic_string_viewIcEEcvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIA7_ccvEE",
   "name" : "fmt::formatter<char[7]>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIA7_ccvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIA7_ccvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIA7_c",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterINS0_17basic_string_viewIcEEcvEE",
   "name" : "fmt::formatter<fmt::basic_string_view<char>, char, void>",
   "referenced_type" : "_ZTIN3fmt2v79formatterINS0_17basic_string_viewIcEEcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterINS0_17basic_string_viewIcEEcvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v717basic_string_viewIcEE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterINS0_5bytesEcvEE",
   "name" : "fmt::formatter<fmt::bytes, char, void>",
   "referenced_type" : "_ZTIN3fmt2v79formatterINS0_5bytesEcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterINS0_5bytesEcvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt2v75bytesE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v79formatterINS0_6detail6bigintEcvEE",
   "name" : "fmt::formatter<fmt::detail::bigint, char, void>",
   "referenced_type" : "_ZTIN3fmt2v79formatterINS0_6detail6bigintEcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterINS0_6detail6bigintEcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format-inl.h",
   "template_args" :
   [
    "_ZTIN3fmt2v76detail6bigintE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v79formatterINS0_9monostateEcvEE",
   "name" : "fmt::formatter<fmt::monostate, char, void>",
   "referenced_type" : "_ZTIN3fmt2v79formatterINS0_9monostateEcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterINS0_9monostateEcvEE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt2v79monostateE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIPKccvEE",
   "name" : "fmt::formatter<const char *>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIPKccvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIPKccvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPKc",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIPKvcvEE",
   "name" : "fmt::formatter<const void *>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIPKvcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIPKvcvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt2v79formatterIPKccvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIPccvEE",
   "name" : "fmt::formatter<char *>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIPccvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIPccvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPc",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIbcvEE",
   "name" : "fmt::formatter<bool>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIbcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIbcvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIb",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIccvEE",
   "name" : "fmt::formatter<char>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIccvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIccvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIdcvEE",
   "name" : "fmt::formatter<double>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIdcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIdcvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIecvEE",
   "name" : "fmt::formatter<long double>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIecvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIecvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIe",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIfcvEE",
   "name" : "fmt::formatter<float>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIfcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIfcvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIicvEE",
   "name" : "fmt::formatter<int>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIicvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIicvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIjcvEE",
   "name" : "fmt::formatter<unsigned int>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIjcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIjcvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIxcvEE",
   "name" : "fmt::formatter<long long>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIxcvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIxcvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt2v76detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt2v79formatterIycvEE",
   "name" : "fmt::formatter<unsigned long long>",
   "referenced_type" : "_ZTIN3fmt2v79formatterIycvEE",
   "self_type" : "_ZTIN3fmt2v79formatterIycvEE",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIy",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt2v79monostateE",
   "name" : "fmt::monostate",
   "referenced_type" : "_ZTIN3fmt2v79monostateE",
   "self_type" : "_ZTIN3fmt2v79monostateE",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10IInterfaceE",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10IInterfaceE",
   "self_type" : "_ZTIN7android10IInterfaceE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8BnMemoryE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOffset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mHeap",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android2spINS_11IMemoryHeapEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10MemoryBaseE",
   "name" : "android::MemoryBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10MemoryBaseE",
   "self_type" : "_ZTIN7android10MemoryBaseE",
   "size" : 36,
   "source_file" : "frameworks/native/libs/binder/include/binder/MemoryBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 28,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10MemoryBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10MemoryBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10MemoryBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android10MemoryBase9getMemoryEPiPj"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10MemoryBaseE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10MemoryBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android10MemoryBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8BnMemory10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10MemoryBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10MemoryBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10MemoryBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android10ParcelableE",
   "name" : "android::Parcelable",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10ParcelableE",
   "self_type" : "_ZTIN7android10ParcelableE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/include/binder/Parcelable.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10ParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZNK7android10Parcelable12getStabilityEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mWaitingThreads",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mOutgoingOffset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mOutgoing",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2spINS1_10RpcSession13RpcConnectionEEENS_9allocatorIS5_EEEE"
    },
    {
     "field_name" : "mMaxIncoming",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mIncoming",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN7android2spINS1_10RpcSession13RpcConnectionEEENS_9allocatorIS5_EEEE"
    },
    {
     "field_name" : "mThreads",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__13mapINS_11__thread_idENS_6threadENS_4lessIS1_EENS_9allocatorINS_4pairIKS1_S2_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10RpcSession11ThreadStateE",
   "name" : "android::RpcSession::ThreadState",
   "referenced_type" : "_ZTIN7android10RpcSession11ThreadStateE",
   "self_type" : "_ZTIN7android10RpcSession11ThreadStateE",
   "size" : 48,
   "source_file" : "frameworks/native/libs/binder/include/binder/RpcSession.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10RpcSession13EventListenerE",
   "name" : "android::RpcSession::EventListener",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10RpcSession13EventListenerE",
   "self_type" : "_ZTIN7android10RpcSession13EventListenerE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/include/binder/RpcSession.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10RpcSession13EventListenerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10RpcSession13EventListener32onSessionAllIncomingThreadsEndedERKNS_2spIS0_EE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10RpcSession13EventListener28onSessionIncomingThreadEndedEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10RpcSession13EventListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10RpcSession13EventListenerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10RpcSession13EventListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10RpcSession13EventListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10RpcSession13EventListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "rpcTransport",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android12RpcTransportENS_14default_deleteIS2_EEEE"
    },
    {
     "field_name" : "exclusiveTid",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__18optionalIiEE"
    },
    {
     "field_name" : "allowNested",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android10RpcSession13RpcConnectionE",
   "name" : "android::RpcSession::RpcConnection",
   "referenced_type" : "_ZTIN7android10RpcSession13RpcConnectionE",
   "self_type" : "_ZTIN7android10RpcSession13RpcConnectionE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/RpcSession.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10RpcSession13RpcConnectionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10RpcSession13RpcConnectionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10RpcSession13RpcConnectionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "connection",
     "referenced_type" : "_ZTIN7android2spINS_10RpcSession13RpcConnectionEEE"
    },
    {
     "field_name" : "status",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android10RpcSession18PreJoinSetupResultE",
   "name" : "android::RpcSession::PreJoinSetupResult",
   "referenced_type" : "_ZTIN7android10RpcSession18PreJoinSetupResultE",
   "self_type" : "_ZTIN7android10RpcSession18PreJoinSetupResultE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/include/binder/RpcSession.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSession",
     "referenced_type" : "_ZTIN7android2spINS_10RpcSessionEEE"
    },
    {
     "access" : "private",
     "field_name" : "mConnection",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN7android2spINS_10RpcSession13RpcConnectionEEE"
    },
    {
     "access" : "private",
     "field_name" : "mReentrant",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android10RpcSession19ExclusiveConnectionE",
   "name" : "android::RpcSession::ExclusiveConnection",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10RpcSession19ExclusiveConnectionE",
   "self_type" : "_ZTIN7android10RpcSession19ExclusiveConnectionE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/include/binder/RpcSession.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10RpcSession13EventListenerE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCv",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__118condition_variableE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10RpcSession23WaitForShutdownListenerE",
   "name" : "android::RpcSession::WaitForShutdownListener",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10RpcSession23WaitForShutdownListenerE",
   "self_type" : "_ZTIN7android10RpcSession23WaitForShutdownListenerE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/include/binder/RpcSession.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10RpcSession23WaitForShutdownListenerE"
    },
    {
     "mangled_component_name" : "_ZN7android10RpcSession23WaitForShutdownListener32onSessionAllIncomingThreadsEndedERKNS_2spIS0_EE"
    },
    {
     "mangled_component_name" : "_ZN7android10RpcSession23WaitForShutdownListener28onSessionIncomingThreadEndedEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10RpcSession23WaitForShutdownListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10RpcSession23WaitForShutdownListenerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10RpcSession23WaitForShutdownListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10RpcSession23WaitForShutdownListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10RpcSession23WaitForShutdownListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCtx",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android15RpcTransportCtxENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mForServer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android2wpINS_9RpcServerEEE"
    },
    {
     "access" : "private",
     "field_name" : "mShutdownListener",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android2spINS_10RpcSession23WaitForShutdownListenerEEE"
    },
    {
     "access" : "private",
     "field_name" : "mEventListener",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN7android2wpINS_10RpcSession13EventListenerEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSessionSpecificRootObject",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN7android2spINS_7IBinderEEE"
    },
    {
     "access" : "private",
     "field_name" : "mId",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mShutdownTrigger",
     "field_offset" : 352,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android9FdTriggerENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mRpcBinderState",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN7android8RpcStateENS_14default_deleteIS2_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 416,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mMaxIncomingThreads",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mMaxOutgoingThreads",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mProtocolVersion",
     "field_offset" : 512,
     "referenced_type" : "_ZTINSt3__18optionalIjEE"
    },
    {
     "access" : "private",
     "field_name" : "mAvailableConnectionCv",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__118condition_variableE"
    },
    {
     "access" : "private",
     "field_name" : "mConnections",
     "field_offset" : 608,
     "referenced_type" : "_ZTIN7android10RpcSession11ThreadStateE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10RpcSessionE",
   "name" : "android::RpcSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10RpcSessionE",
   "self_type" : "_ZTIN7android10RpcSessionE",
   "size" : 132,
   "source_file" : "frameworks/native/libs/binder/include/binder/RpcSession.h",
   "vtable_components" :
   [
    {
     "component_value" : 124,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10RpcSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10RpcSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10RpcSessionD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -124,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -124,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10RpcSessionE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10RpcSessionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android10RpcSessionD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTO",
     "referenced_type" : "_ZTIRN7android10TextOutputE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.33_x86_x86_64_shared/obj/frameworks/native/libs/binder/BufferedTextOutput.sdump"
    }
   ],
   "linker_set_key" : "_ZTIN7android10TextOutput6BundleE",
   "name" : "android::TextOutput::Bundle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10TextOutput6BundleE",
   "self_type" : "_ZTIN7android10TextOutput6BundleE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/include/binder/TextOutput.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android10TextOutputE",
   "name" : "android::TextOutput",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10TextOutputE",
   "self_type" : "_ZTIN7android10TextOutputE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/include/binder/TextOutput.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10TextOutputE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10TextOutputD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10TextOutputD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput5printEPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput10moveIndentEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput10pushBundleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10TextOutput9popBundleEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10VectorImplE",
   "self_type" : "_ZTIN7android10VectorImplE",
   "size" : 20,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "name" : "android::BnInterface<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android11IMemoryHeapE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android14IShellCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_14IShellCallbackEEE",
   "name" : "android::BnInterface<android::IShellCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_14IShellCallbackEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_14IShellCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android14IShellCallbackE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_14IShellCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IShellCallback8openFileERKNS_8String16ES3_S3_"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IShellCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_14IShellCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_14IShellCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_14IShellCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android15IResultReceiverE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_15IResultReceiverEEE",
   "name" : "android::BnInterface<android::IResultReceiver>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_15IResultReceiverEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_15IResultReceiverEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android15IResultReceiverE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_15IResultReceiverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IResultReceiver4sendEi"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IResultReceiverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IResultReceiverEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_15IResultReceiverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_15IResultReceiverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2os15IClientCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_2os15IClientCallbackEEE",
   "name" : "android::BnInterface<android::os::IClientCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_2os15IClientCallbackEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_2os15IClientCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android2os15IClientCallbackE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_2os15IClientCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os15IClientCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os15IClientCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os15IClientCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_2os15IClientCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IClientCallback9onClientsERKNS_2spINS_7IBinderEEEb"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os15IClientCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_2os15IClientCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_2os15IClientCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_2os15IClientCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_2os15IClientCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_2os15IClientCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_2os15IClientCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_2os15IClientCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_2os15IClientCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2os15IServiceManagerE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_2os15IServiceManagerEEE",
   "name" : "android::BnInterface<android::os::IServiceManager>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_2os15IServiceManagerEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_2os15IServiceManagerEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android2os15IServiceManagerE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_2os15IServiceManagerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os15IServiceManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os15IServiceManagerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os15IServiceManagerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_2os15IServiceManagerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager10getServiceERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEPNS_2spINS_7IBinderEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager12checkServiceERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEPNS_2spINS_7IBinderEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager10addServiceERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEERKNS_2spINS_7IBinderEEEbi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager12listServicesEiPNSt3__16vectorINS2_12basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS7_IS9_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager24registerForNotificationsERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEERKNS_2spINS0_16IServiceCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager26unregisterForNotificationsERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEERKNS_2spINS0_16IServiceCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager10isDeclaredERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager20getDeclaredInstancesERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEPNS2_6vectorIS8_NS6_IS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager16updatableViaApexERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEPNS2_8optionalIS8_EE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager17getConnectionInfoERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEEPNS2_8optionalINS0_14ConnectionInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager22registerClientCallbackERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEERKNS_2spINS_7IBinderEEERKNSB_INS0_15IClientCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager20tryUnregisterServiceERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEERKNS_2spINS_7IBinderEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IServiceManager19getServiceDebugInfoEPNSt3__16vectorINS0_16ServiceDebugInfoENS2_9allocatorIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os15IServiceManagerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_2os15IServiceManagerEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_2os15IServiceManagerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_2os15IServiceManagerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_2os15IServiceManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_2os15IServiceManagerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_2os15IServiceManagerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_2os15IServiceManagerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_2os15IServiceManagerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2os16IServiceCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_2os16IServiceCallbackEEE",
   "name" : "android::BnInterface<android::os::IServiceCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_2os16IServiceCallbackEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_2os16IServiceCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android2os16IServiceCallbackE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_2os16IServiceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os16IServiceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os16IServiceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os16IServiceCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_2os16IServiceCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os16IServiceCallback14onRegistrationERKNSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEERKNS_2spINS_7IBinderEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_2os16IServiceCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_2os16IServiceCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_2os16IServiceCallbackEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_2os16IServiceCallbackEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_2os16IServiceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_2os16IServiceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_2os16IServiceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_2os16IServiceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_2os16IServiceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7IMemoryE"
    },
    {
     "referenced_type" : "_ZTIN7android7BBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "name" : "android::BnInterface<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "self_type" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android7IMemoryE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPiPj"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "referenced_type" : "_ZTIN7android9BpRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BpInterfaceINS_11IMemoryHeapEEE",
   "name" : "android::BpInterface<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BpInterfaceINS_11IMemoryHeapEEE",
   "self_type" : "_ZTIN7android11BpInterfaceINS_11IMemoryHeapEEE",
   "size" : 28,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android11IMemoryHeapE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11IMemoryHeap22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android14IShellCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android9BpRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BpInterfaceINS_14IShellCallbackEEE",
   "name" : "android::BpInterface<android::IShellCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BpInterfaceINS_14IShellCallbackEEE",
   "self_type" : "_ZTIN7android11BpInterfaceINS_14IShellCallbackEEE",
   "size" : 28,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android14IShellCallbackE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_14IShellCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14IShellCallback22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IShellCallback8openFileERKNS_8String16ES3_S3_"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_14IShellCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_14IShellCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_14IShellCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android15IResultReceiverE"
    },
    {
     "referenced_type" : "_ZTIN7android9BpRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BpInterfaceINS_15IResultReceiverEEE",
   "name" : "android::BpInterface<android::IResultReceiver>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BpInterfaceINS_15IResultReceiverEEE",
   "self_type" : "_ZTIN7android11BpInterfaceINS_15IResultReceiverEEE",
   "size" : 28,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android15IResultReceiverE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_15IResultReceiverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android15IResultReceiver22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IResultReceiver4sendEi"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_15IResultReceiverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_15IResultReceiverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11BpInterfaceINS_15IResultReceiverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android2os15IClientCallbackE"
    },
    {
     "referenced_type" : "_ZTIN7android9BpRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BpInterfaceINS_2os15IClientCallbackEEE",
   "name" : "android::BpInterface<android::os::IClientCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11BpInterfaceINS_2os15IClientCallbackEEE",
   "self_type" : "_ZTIN7android11BpInterfaceINS_2os15IClientCallbackEEE",
   "size" : 28,
   "source_file" : "frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" :
   [
    "_ZTIN7android2os15IClientCallbackE"
   ],
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_2os15IClientCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_2os15IClientCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_2os15IClientCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BpInterfaceINS_2os15IClientCallbackEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android2os15IClientCallback22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android2os15IClientCallback9onClientsERKNS_2spINS_7IBinderEEEb"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BpInterfaceINS_2os15IClientCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_2os15IClientCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android11BpInterfaceINS_2os15IClientCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android9BpRefBase20onIncStrongAttemptedEjPKv"
    },
    {
