{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",

   "name" : "const std::optional<std::vector<long, std::allocator<long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long, std::allocator<unsigned long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/ISoundTriggerHwCallback.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::soundtrigger3::ISoundTriggerHw>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw13getPropertiesEPNS0_5media12soundtrigger10PropertiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw22registerGlobalCallbackERKNSt3__110shared_ptrINS2_29ISoundTriggerHwGlobalCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw14loadSoundModelERKNS0_5media12soundtrigger10SoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw20loadPhraseSoundModelERKNS0_5media12soundtrigger16PhraseSoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16unloadSoundModelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16startRecognitionEiiiRKNS0_5media12soundtrigger17RecognitionConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw15stopRecognitionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw21forceRecognitionEventEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw14queryParameterEiNS0_5media12soundtrigger14ModelParameterEPNSt3__18optionalINS5_19ModelParameterRangeEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw12getParameterEiNS0_5media12soundtrigger14ModelParameterEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw12setParameterEiNS0_5media12soundtrigger14ModelParameterEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::soundtrigger3::ISoundTriggerHwCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback13modelUnloadedEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback25phraseRecognitionCallbackEiRKNS0_5media12soundtrigger22PhraseRecognitionEventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback19recognitionCallbackEiRKNS0_5media12soundtrigger16RecognitionEventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::soundtrigger3::ISoundTriggerHwGlobalCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback20onResourcesAvailableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::soundtrigger3::ISoundTriggerHw>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw13getPropertiesEPNS0_5media12soundtrigger10PropertiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw22registerGlobalCallbackERKNSt3__110shared_ptrINS2_29ISoundTriggerHwGlobalCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw14loadSoundModelERKNS0_5media12soundtrigger10SoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw20loadPhraseSoundModelERKNS0_5media12soundtrigger16PhraseSoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16unloadSoundModelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16startRecognitionEiiiRKNS0_5media12soundtrigger17RecognitionConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw15stopRecognitionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw21forceRecognitionEventEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw14queryParameterEiNS0_5media12soundtrigger14ModelParameterEPNSt3__18optionalINS5_19ModelParameterRangeEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw12getParameterEiNS0_5media12soundtrigger14ModelParameterEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw12setParameterEiNS0_5media12soundtrigger14ModelParameterEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::soundtrigger3::ISoundTriggerHwCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback13modelUnloadedEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback25phraseRecognitionCallbackEiRKNS0_5media12soundtrigger22PhraseRecognitionEventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback19recognitionCallbackEiRKNS0_5media12soundtrigger16RecognitionEventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::soundtrigger3::ISoundTriggerHwGlobalCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback20onResourcesAvailableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "implementor",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "description",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "version",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uuid",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "supportedModelArch",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "maxSoundModels",
     "field_offset" : 832,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxKeyPhrases",
     "field_offset" : 864,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxUsers",
     "field_offset" : 896,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "recognitionModes",
     "field_offset" : 928,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "captureTransition",
     "field_offset" : 960,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "maxBufferMs",
     "field_offset" : 992,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "concurrentCapture",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "triggerInEvent",
     "field_offset" : 1032,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "powerConsumptionMw",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "audioCapabilities",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger10PropertiesE",
   "name" : "aidl::android::media::soundtrigger::Properties",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger10PropertiesE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger10PropertiesE",
   "size" : 144,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/Properties.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger14SoundModelTypeE"
    },
    {
     "field_name" : "uuid",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "vendorUuid",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "data",
     "field_offset" : 448,
     "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE"
    },
    {
     "field_name" : "dataSize",
     "field_offset" : 480,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger10SoundModelE",
   "name" : "aidl::android::media::soundtrigger::SoundModel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger10SoundModelE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger10SoundModelE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/SoundModel.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "userId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "levelPercent",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger15ConfidenceLevelE",
   "name" : "aidl::android::media::soundtrigger::ConfidenceLevel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger15ConfidenceLevelE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger15ConfidenceLevelE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/ConfidenceLevel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger10SoundModelE"
    },
    {
     "field_name" : "phrases",
     "field_offset" : 512,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android5media12soundtrigger6PhraseENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger16PhraseSoundModelE",
   "name" : "aidl::android::media::soundtrigger::PhraseSoundModel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger16PhraseSoundModelE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger16PhraseSoundModelE",
   "size" : 88,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/PhraseSoundModel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "status",
     "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger17RecognitionStatusE"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger14SoundModelTypeE"
    },
    {
     "field_name" : "captureAvailable",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "captureDelayMs",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "capturePreambleMs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "triggerInData",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "audioConfig",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android5media5audio6common11AudioConfigEEE"
    },
    {
     "field_name" : "data",
     "field_offset" : 1472,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "recognitionStillActive",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger16RecognitionEventE",
   "name" : "aidl::android::media::soundtrigger::RecognitionEvent",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger16RecognitionEventE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger16RecognitionEventE",
   "size" : 216,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/RecognitionEvent.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "captureRequested",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "phraseRecognitionExtras",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android5media12soundtrigger22PhraseRecognitionExtraENS_9allocatorIS5_EEEE"
    },
    {
     "field_name" : "audioCapabilities",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger17RecognitionConfigE",
   "name" : "aidl::android::media::soundtrigger::RecognitionConfig",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger17RecognitionConfigE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger17RecognitionConfigE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/RecognitionConfig.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "minInclusive",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxInclusive",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger19ModelParameterRangeE",
   "name" : "aidl::android::media::soundtrigger::ModelParameterRange",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger19ModelParameterRangeE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger19ModelParameterRangeE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/ModelParameterRange.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger16RecognitionEventE"
    },
    {
     "field_name" : "phraseExtras",
     "field_offset" : 1728,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android5media12soundtrigger22PhraseRecognitionExtraENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger22PhraseRecognitionEventE",
   "name" : "aidl::android::media::soundtrigger::PhraseRecognitionEvent",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger22PhraseRecognitionEventE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger22PhraseRecognitionEventE",
   "size" : 240,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/PhraseRecognitionEvent.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "recognitionModes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "confidenceLevel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "levels",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android5media12soundtrigger15ConfidenceLevelENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger22PhraseRecognitionExtraE",
   "name" : "aidl::android::media::soundtrigger::PhraseRecognitionExtra",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger22PhraseRecognitionExtraE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger22PhraseRecognitionExtraE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/PhraseRecognitionExtra.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "recognitionModes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "users",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "locale",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "text",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media12soundtrigger6PhraseE",
   "name" : "aidl::android::media::soundtrigger::Phrase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media12soundtrigger6PhraseE",
   "self_type" : "_ZTIN4aidl7android5media12soundtrigger6PhraseE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.soundtrigger.types-V1-ndk-source/gen/include/aidl/android/media/soundtrigger/Phrase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE"
    },
    {
     "field_name" : "offloadInfo",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common16AudioOffloadInfoE"
    },
    {
     "field_name" : "frameCount",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common11AudioConfigE",
   "name" : "aidl::android::media::audio::common::AudioConfig",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common11AudioConfigE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common11AudioConfigE",
   "size" : 152,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioConfig.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampleRate",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioFormatDescriptionE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE",
   "name" : "aidl::android::media::audio::common::AudioConfigBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioConfigBase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE"
    },
    {
     "field_name" : "streamType",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioStreamTypeE"
    },
    {
     "field_name" : "bitRatePerSecond",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "durationUs",
     "field_offset" : 448,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "hasVideo",
     "field_offset" : 512,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "isStreaming",
     "field_offset" : 520,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "bitWidth",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offloadBufferSize",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usage",
     "field_offset" : 608,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common10AudioUsageE"
    },
    {
     "field_name" : "encapsulationMode",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioEncapsulationModeE"
    },
    {
     "field_name" : "contentId",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "syncId",
     "field_offset" : 704,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common16AudioOffloadInfoE",
   "name" : "aidl::android::media::audio::common::AudioOffloadInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common16AudioOffloadInfoE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common16AudioOffloadInfoE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioOffloadInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJiiiiiEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE",
   "name" : "aidl::android::media::audio::common::AudioChannelLayout",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioChannelLayout.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioFormatTypeE"
    },
    {
     "field_name" : "pcm",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common7PcmTypeE"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common22AudioFormatDescriptionE",
   "name" : "aidl::android::media::audio::common::AudioFormatDescription",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioFormatDescriptionE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common22AudioFormatDescriptionE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioFormatDescription.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwE",
   "name" : "aidl::android::hardware::soundtrigger3::ISoundTriggerHw",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/ISoundTriggerHw.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHwD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHwD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw13getPropertiesEPNS0_5media12soundtrigger10PropertiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw22registerGlobalCallbackERKNSt3__110shared_ptrINS2_29ISoundTriggerHwGlobalCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw14loadSoundModelERKNS0_5media12soundtrigger10SoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw20loadPhraseSoundModelERKNS0_5media12soundtrigger16PhraseSoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16unloadSoundModelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16startRecognitionEiiiRKNS0_5media12soundtrigger17RecognitionConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw15stopRecognitionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw21forceRecognitionEventEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw14queryParameterEiNS0_5media12soundtrigger14ModelParameterEPNSt3__18optionalINS5_19ModelParameterRangeEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw12getParameterEiNS0_5media12soundtrigger14ModelParameterEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw12setParameterEiNS0_5media12soundtrigger14ModelParameterEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger316BnSoundTriggerHwE",
   "name" : "aidl::android::hardware::soundtrigger3::BnSoundTriggerHw",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger316BnSoundTriggerHwE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger316BnSoundTriggerHwE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/BnSoundTriggerHw.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger316BnSoundTriggerHwE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BnSoundTriggerHwD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BnSoundTriggerHwD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw13getPropertiesEPNS0_5media12soundtrigger10PropertiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw22registerGlobalCallbackERKNSt3__110shared_ptrINS2_29ISoundTriggerHwGlobalCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw14loadSoundModelERKNS0_5media12soundtrigger10SoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw20loadPhraseSoundModelERKNS0_5media12soundtrigger16PhraseSoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16unloadSoundModelEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw16startRecognitionEiiiRKNS0_5media12soundtrigger17RecognitionConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw15stopRecognitionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw21forceRecognitionEventEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw14queryParameterEiNS0_5media12soundtrigger14ModelParameterEPNSt3__18optionalINS5_19ModelParameterRangeEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw12getParameterEiNS0_5media12soundtrigger14ModelParameterEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger315ISoundTriggerHw12setParameterEiNS0_5media12soundtrigger14ModelParameterEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BnSoundTriggerHw19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BnSoundTriggerHw16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BnSoundTriggerHw12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger316BpSoundTriggerHwE",
   "name" : "aidl::android::hardware::soundtrigger3::BpSoundTriggerHw",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger316BpSoundTriggerHwE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger316BpSoundTriggerHwE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/BpSoundTriggerHw.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger316BpSoundTriggerHwE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHwD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHwD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw13getPropertiesEPNS0_5media12soundtrigger10PropertiesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw22registerGlobalCallbackERKNSt3__110shared_ptrINS2_29ISoundTriggerHwGlobalCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw14loadSoundModelERKNS0_5media12soundtrigger10SoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw20loadPhraseSoundModelERKNS0_5media12soundtrigger16PhraseSoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw16unloadSoundModelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw16startRecognitionEiiiRKNS0_5media12soundtrigger17RecognitionConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw15stopRecognitionEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw21forceRecognitionEventEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw14queryParameterEiNS0_5media12soundtrigger14ModelParameterEPNSt3__18optionalINS5_19ModelParameterRangeEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw12getParameterEiNS0_5media12soundtrigger14ModelParameterEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw12setParameterEiNS0_5media12soundtrigger14ModelParameterEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BpSoundTriggerHw16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefaultE",
   "name" : "aidl::android::hardware::soundtrigger3::ISoundTriggerHwDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/ISoundTriggerHw.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault13getPropertiesEPNS0_5media12soundtrigger10PropertiesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault22registerGlobalCallbackERKNSt3__110shared_ptrINS2_29ISoundTriggerHwGlobalCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault14loadSoundModelERKNS0_5media12soundtrigger10SoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault20loadPhraseSoundModelERKNS0_5media12soundtrigger16PhraseSoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault16unloadSoundModelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault16startRecognitionEiiiRKNS0_5media12soundtrigger17RecognitionConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault15stopRecognitionEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault21forceRecognitionEventEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault14queryParameterEiNS0_5media12soundtrigger14ModelParameterEPNSt3__18optionalINS5_19ModelParameterRangeEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault12getParameterEiNS0_5media12soundtrigger14ModelParameterEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault12setParameterEiNS0_5media12soundtrigger14ModelParameterEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger322ISoundTriggerHwDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackE",
   "name" : "aidl::android::hardware::soundtrigger3::ISoundTriggerHwCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/ISoundTriggerHwCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback13modelUnloadedEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback25phraseRecognitionCallbackEiRKNS0_5media12soundtrigger22PhraseRecognitionEventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback19recognitionCallbackEiRKNS0_5media12soundtrigger16RecognitionEventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallbackE",
   "name" : "aidl::android::hardware::soundtrigger3::BnSoundTriggerHwCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallbackE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/BnSoundTriggerHwCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback13modelUnloadedEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback25phraseRecognitionCallbackEiRKNS0_5media12soundtrigger22PhraseRecognitionEventE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallback19recognitionCallbackEiRKNS0_5media12soundtrigger16RecognitionEventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallbackE",
   "name" : "aidl::android::hardware::soundtrigger3::BpSoundTriggerHwCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallbackE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/BpSoundTriggerHwCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallback13modelUnloadedEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallback25phraseRecognitionCallbackEiRKNS0_5media12soundtrigger22PhraseRecognitionEventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallback19recognitionCallbackEiRKNS0_5media12soundtrigger16RecognitionEventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BpSoundTriggerHwCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger316BnSoundTriggerHwE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegatorE",
   "name" : "aidl::android::hardware::soundtrigger3::ISoundTriggerHwDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/BnSoundTriggerHw.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger315ISoundTriggerHwEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator13getPropertiesEPNS0_5media12soundtrigger10PropertiesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator22registerGlobalCallbackERKNSt3__110shared_ptrINS2_29ISoundTriggerHwGlobalCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator14loadSoundModelERKNS0_5media12soundtrigger10SoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator20loadPhraseSoundModelERKNS0_5media12soundtrigger16PhraseSoundModelERKNSt3__110shared_ptrINS2_23ISoundTriggerHwCallbackEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator16unloadSoundModelEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator16startRecognitionEiiiRKNS0_5media12soundtrigger17RecognitionConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator15stopRecognitionEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator21forceRecognitionEventEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator14queryParameterEiNS0_5media12soundtrigger14ModelParameterEPNSt3__18optionalINS5_19ModelParameterRangeEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator12getParameterEiNS0_5media12soundtrigger14ModelParameterEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324ISoundTriggerHwDelegator12setParameterEiNS0_5media12soundtrigger14ModelParameterEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BnSoundTriggerHw19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BnSoundTriggerHw16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger316BnSoundTriggerHw12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackE",
   "name" : "aidl::android::hardware::soundtrigger3::ISoundTriggerHwGlobalCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/ISoundTriggerHwGlobalCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback20onResourcesAvailableEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallbackE",
   "name" : "aidl::android::hardware::soundtrigger3::BnSoundTriggerHwGlobalCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallbackE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/BnSoundTriggerHwGlobalCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallback20onResourcesAvailableEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger330BpSoundTriggerHwGlobalCallbackE",
   "name" : "aidl::android::hardware::soundtrigger3::BpSoundTriggerHwGlobalCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger330BpSoundTriggerHwGlobalCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger330BpSoundTriggerHwGlobalCallbackE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/BpSoundTriggerHwGlobalCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger330BpSoundTriggerHwGlobalCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BpSoundTriggerHwGlobalCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BpSoundTriggerHwGlobalCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BpSoundTriggerHwGlobalCallback20onResourcesAvailableEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BpSoundTriggerHwGlobalCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BpSoundTriggerHwGlobalCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefaultE",
   "name" : "aidl::android::hardware::soundtrigger3::ISoundTriggerHwCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/ISoundTriggerHwCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefault13modelUnloadedEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefault25phraseRecognitionCallbackEiRKNS0_5media12soundtrigger22PhraseRecognitionEventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefault19recognitionCallbackEiRKNS0_5media12soundtrigger16RecognitionEventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330ISoundTriggerHwCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger332ISoundTriggerHwCallbackDelegatorE",
   "name" : "aidl::android::hardware::soundtrigger3::ISoundTriggerHwCallbackDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger332ISoundTriggerHwCallbackDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger332ISoundTriggerHwCallbackDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/BnSoundTriggerHwCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger332ISoundTriggerHwCallbackDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger332ISoundTriggerHwCallbackDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger332ISoundTriggerHwCallbackDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger323ISoundTriggerHwCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger332ISoundTriggerHwCallbackDelegator13modelUnloadedEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger332ISoundTriggerHwCallbackDelegator25phraseRecognitionCallbackEiRKNS0_5media12soundtrigger22PhraseRecognitionEventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger332ISoundTriggerHwCallbackDelegator19recognitionCallbackEiRKNS0_5media12soundtrigger16RecognitionEventE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger324BnSoundTriggerHwCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefaultE",
   "name" : "aidl::android::hardware::soundtrigger3::ISoundTriggerHwGlobalCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/ISoundTriggerHwGlobalCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefault20onResourcesAvailableEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger336ISoundTriggerHwGlobalCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware13soundtrigger338ISoundTriggerHwGlobalCallbackDelegatorE",
   "name" : "aidl::android::hardware::soundtrigger3::ISoundTriggerHwGlobalCallbackDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware13soundtrigger338ISoundTriggerHwGlobalCallbackDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware13soundtrigger338ISoundTriggerHwGlobalCallbackDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/soundtrigger/aidl/android.hardware.soundtrigger3-V1-ndk-source/gen/include/aidl/android/hardware/soundtrigger3/BnSoundTriggerHwGlobalCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware13soundtrigger338ISoundTriggerHwGlobalCallbackDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger338ISoundTriggerHwGlobalCallbackDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger338ISoundTriggerHwGlobalCallbackDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware13soundtrigger329ISoundTriggerHwGlobalCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger338ISoundTriggerHwGlobalCallbackDelegator20onResourcesAvailableEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware13soundtrigger330BnSoundTriggerHwGlobalCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media12soundtrigger15ConfidenceLevelENS3_9allocatorIS9_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::media::soundtrigger::ConfidenceLevel, std::allocator<aidl::android::media::soundtrigger::ConfidenceLevel>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media12soundtrigger15ConfidenceLevelENS3_9allocatorIS9_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media12soundtrigger15ConfidenceLevelENS3_9allocatorIS9_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android5media12soundtrigger15ConfidenceLevelENS_9allocatorIS5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media12soundtrigger22PhraseRecognitionExtraENS3_9allocatorIS9_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::media::soundtrigger::PhraseRecognitionExtra, std::allocator<aidl::android::media::soundtrigger::PhraseRecognitionExtra>>>",
   "record_kind" : "class",
