{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIDs",
   "name" : "char16_t",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIDs",
   "size" : 2
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",

   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/IBluetoothAudioPort.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::bluetooth::audio::IBluetoothAudioPort>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort23getPresentationPositionEPNS3_20PresentationPositionE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort11startStreamEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort10stopStreamEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort13suspendStreamEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort20updateSourceMetadataERKNS1_5audio6common14SourceMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort18updateSinkMetadataERKNS1_5audio6common12SinkMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort14setLatencyModeENS3_11LatencyModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::bluetooth::audio::IBluetoothAudioProvider>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider10endSessionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider12startSessionERKNSt3__110shared_ptrINS3_19IBluetoothAudioPortEEERKNS3_18AudioConfigurationERKNS5_6vectorINS3_11LatencyModeENS5_9allocatorISF_EEEEPNS1_6common3fmq12MQDescriptorIaNSM_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider13streamStartedENS3_20BluetoothAudioStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider15streamSuspendedENS3_20BluetoothAudioStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider24updateAudioConfigurationERKNS3_18AudioConfigurationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider24setLowLatencyModeAllowedEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::bluetooth::audio::IBluetoothAudioProviderFactory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory23getProviderCapabilitiesENS3_11SessionTypeEPNSt3__16vectorINS3_17AudioCapabilitiesENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory12openProviderENS3_11SessionTypeEPNSt3__110shared_ptrINS3_23IBluetoothAudioProviderEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::bluetooth::audio::IBluetoothAudioPort>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort23getPresentationPositionEPNS3_20PresentationPositionE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort11startStreamEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort10stopStreamEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort13suspendStreamEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort20updateSourceMetadataERKNS1_5audio6common14SourceMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort18updateSinkMetadataERKNS1_5audio6common12SinkMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort14setLatencyModeENS3_11LatencyModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::bluetooth::audio::IBluetoothAudioProvider>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider10endSessionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider12startSessionERKNSt3__110shared_ptrINS3_19IBluetoothAudioPortEEERKNS3_18AudioConfigurationERKNS5_6vectorINS3_11LatencyModeENS5_9allocatorISF_EEEEPNS1_6common3fmq12MQDescriptorIaNSM_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider13streamStartedENS3_20BluetoothAudioStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider15streamSuspendedENS3_20BluetoothAudioStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider24updateAudioConfigurationERKNS3_18AudioConfigurationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider24setLowLatencyModeAllowedEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::bluetooth::audio::IBluetoothAudioProviderFactory>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory23getProviderCapabilitiesENS3_11SessionTypeEPNSt3__16vectorINS3_17AudioCapabilitiesENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory12openProviderENS3_11SessionTypeEPNSt3__110shared_ptrINS3_23IBluetoothAudioProviderEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioDeviceDescriptionE"
    },
    {
     "field_name" : "address",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioDeviceAddressE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common11AudioDeviceE",
   "name" : "aidl::android::media::audio::common::AudioDevice",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common11AudioDeviceE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common11AudioDeviceE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioDevice.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJiiiiiEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE",
   "name" : "aidl::android::media::audio::common::AudioChannelLayout",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioChannelLayout.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_6vectorIhNS4_IhEEEES9_NS7_IiNS4_IiEEEESB_EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common18AudioDeviceAddressE",
   "name" : "aidl::android::media::audio::common::AudioDeviceAddress",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioDeviceAddressE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common18AudioDeviceAddressE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioDeviceAddress.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioDeviceTypeE"
    },
    {
     "field_name" : "connection",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common22AudioDeviceDescriptionE",
   "name" : "aidl::android::media::audio::common::AudioDeviceDescription",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioDeviceDescriptionE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common22AudioDeviceDescriptionE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioDeviceDescription.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tracks",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5audio6common19RecordTrackMetadataENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5audio6common12SinkMetadataE",
   "name" : "aidl::android::hardware::audio::common::SinkMetadata",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5audio6common12SinkMetadataE",
   "self_type" : "_ZTIN4aidl7android8hardware5audio6common12SinkMetadataE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/audio/aidl/android.hardware.audio.common-V1-ndk-source/gen/include/aidl/android/hardware/audio/common/SinkMetadata.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tracks",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5audio6common21PlaybackTrackMetadataENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5audio6common14SourceMetadataE",
   "name" : "aidl::android::hardware::audio::common::SourceMetadata",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5audio6common14SourceMetadataE",
   "self_type" : "_ZTIN4aidl7android8hardware5audio6common14SourceMetadataE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/audio/aidl/android.hardware.audio.common-V1-ndk-source/gen/include/aidl/android/hardware/audio/common/SourceMetadata.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "source",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common11AudioSourceE"
    },
    {
     "field_name" : "gain",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "destinationDevice",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android5media5audio6common11AudioDeviceEEE"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE"
    },
    {
     "field_name" : "tags",
     "field_offset" : 704,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5audio6common19RecordTrackMetadataE",
   "name" : "aidl::android::hardware::audio::common::RecordTrackMetadata",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5audio6common19RecordTrackMetadataE",
   "self_type" : "_ZTIN4aidl7android8hardware5audio6common19RecordTrackMetadataE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/audio/aidl/android.hardware.audio.common-V1-ndk-source/gen/include/aidl/android/hardware/audio/common/RecordTrackMetadata.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "usage",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common10AudioUsageE"
    },
    {
     "field_name" : "contentType",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common16AudioContentTypeE"
    },
    {
     "field_name" : "gain",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE"
    },
    {
     "field_name" : "sourceDevice",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android5media5audio6common11AudioDeviceEEE"
    },
    {
     "field_name" : "tags",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5audio6common21PlaybackTrackMetadataE",
   "name" : "aidl::android::hardware::audio::common::PlaybackTrackMetadata",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5audio6common21PlaybackTrackMetadataE",
   "self_type" : "_ZTIN4aidl7android8hardware5audio6common21PlaybackTrackMetadataE",
   "size" : 120,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/audio/aidl/android.hardware.audio.common-V1-ndk-source/gen/include/aidl/android/hardware/audio/common/PlaybackTrackMetadata.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds",
     "referenced_type" : "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE"
    },
    {
     "field_name" : "ints",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "name" : "aidl::android::hardware::common::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "self_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/aidl/android.hardware.common-V2-ndk-source/gen/include/aidl/android/hardware/common/NativeHandle.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "grantors",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6common3fmq17GrantorDescriptorENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "handle",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4aidl7android8hardware6common12NativeHandleE"
    },
    {
     "field_name" : "quantum",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 608,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common3fmq12MQDescriptorIaNS3_21SynchronizedReadWriteEEE",
   "name" : "aidl::android::hardware::common::fmq::MQDescriptor<signed char, aidl::android::hardware::common::fmq::SynchronizedReadWrite>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common3fmq12MQDescriptorIaNS3_21SynchronizedReadWriteEEE",
   "self_type" : "_ZTIN4aidl7android8hardware6common3fmq12MQDescriptorIaNS3_21SynchronizedReadWriteEEE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/fmq/aidl/android.hardware.common.fmq-V1-ndk-source/gen/include/aidl/android/hardware/common/fmq/MQDescriptor.h",
   "template_args" :
   [
    "_ZTIa",
    "_ZTIN4aidl7android8hardware6common3fmq21SynchronizedReadWriteE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fdIndex",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "extent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6common3fmq17GrantorDescriptorE",
   "name" : "aidl::android::hardware::common::fmq::GrantorDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6common3fmq17GrantorDescriptorE",
   "self_type" : "_ZTIN4aidl7android8hardware6common3fmq17GrantorDescriptorE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/common/fmq/aidl/android.hardware.common.fmq-V1-ndk-source/gen/include/aidl/android/hardware/common/fmq/GrantorDescriptor.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "objectType",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio13AacObjectTypeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "sampleRateHz",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio11ChannelModeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "variableBitRateSupported",
     "field_offset" : 576,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio15AacCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::AacCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio15AacCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio15AacCapabilitiesE",
   "size" : 104,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AacCapabilities.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pcmBitDepth",
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "samplingFrequencyHz",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "frameDurationUs",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "octetsPerFrame",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "blocksPerSdu",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 960,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio11ChannelModeENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio15Lc3CapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::Lc3Capabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio15Lc3CapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio15Lc3CapabilitiesE",
   "size" : 144,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/Lc3Capabilities.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio11ChannelModeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "dataIntervalUs",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio15PcmCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::PcmCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio15PcmCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio15PcmCapabilitiesE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/PcmCapabilities.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio14SbcChannelModeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "blockLength",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "numSubbands",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "allocMethod",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio14SbcAllocMethodENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 960,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "minBitpool",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxBitpool",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio15SbcCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::SbcCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio15SbcCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio15SbcCapabilitiesE",
   "size" : 152,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/SbcCapabilities.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "objectType",
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio13AacObjectTypeE"
    },
    {
     "field_name" : "sampleRateHz",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio11ChannelModeE"
    },
    {
     "field_name" : "variableBitRateEnabled",
     "field_offset" : 72,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 80,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio16AacConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::AacConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16AacConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16AacConfigurationE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AacConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio11ChannelModeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio16AptxCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::AptxCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16AptxCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16AptxCapabilitiesE",
   "size" : 72,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AptxCapabilities.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pcmBitDepth",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "samplingFrequencyHz",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "frameDurationUs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "octetsPerFrame",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "blocksPerSdu",
     "field_offset" : 128,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 136,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio11ChannelModeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio16Lc3ConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::Lc3Configuration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16Lc3ConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16Lc3ConfigurationE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/Lc3Configuration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio15LdacChannelModeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "qualityIndex",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio16LdacQualityIndexENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio16LdacCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::LdacCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16LdacCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16LdacCapabilitiesE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/LdacCapabilities.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pcmBitDepth",
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "samplingFrequencyHz",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "frameDurationUs",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "octetsPerFrame",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "blocksPerSdu",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 960,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio11ChannelModeENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio16OpusCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::OpusCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16OpusCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16OpusCapabilitiesE",
   "size" : 144,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/OpusCapabilities.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio11ChannelModeE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 40,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "dataIntervalUs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio16PcmConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::PcmConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16PcmConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16PcmConfigurationE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/PcmConfiguration.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio14SbcChannelModeE"
    },
    {
     "field_name" : "blockLength",
     "field_offset" : 40,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "numSubbands",
     "field_offset" : 48,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "allocMethod",
     "field_offset" : 56,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio14SbcAllocMethodE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 64,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "minBitpool",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxBitpool",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio16SbcConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::SbcConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16SbcConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16SbcConfigurationE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/SbcConfiguration.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio11ChannelModeE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 40,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AptxConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::AptxConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AptxConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AptxConfigurationE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AptxConfiguration.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "minLowLatency",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "maxLowLatency",
     "field_offset" : 8,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "minHighQuality",
     "field_offset" : 16,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "maxHighQuality",
     "field_offset" : 24,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "minTws",
     "field_offset" : 32,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "maxTws",
     "field_offset" : 40,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AptxSinkBufferingE",
   "name" : "aidl::android::hardware::bluetooth::audio::AptxSinkBuffering",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AptxSinkBufferingE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AptxSinkBufferingE",
   "size" : 6,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AptxSinkBuffering.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware9bluetooth5audio15PcmCapabilitiesENS5_17CodecCapabilitiesENS5_31LeAudioCodecCapabilitiesSettingEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AudioCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::AudioCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AudioCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AudioCapabilitiesE",
   "size" : 408,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AudioCapabilities.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware9bluetooth5audio15SbcCapabilitiesENS5_15AacCapabilitiesENS5_16LdacCapabilitiesENS5_16AptxCapabilitiesENS5_24AptxAdaptiveCapabilitiesENS5_15Lc3CapabilitiesENS5_17CodecCapabilities18VendorCapabilitiesENS_8optionalINS5_16OpusCapabilitiesEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilities12CapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::CodecCapabilities::Capabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilities12CapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilities12CapabilitiesE",
   "size" : 168,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/CodecCapabilities.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "extension",
     "referenced_type" : "_ZTIN3ndk17AParcelableHolderE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilities18VendorCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::CodecCapabilities::VendorCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilities18VendorCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilities18VendorCapabilitiesE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/CodecCapabilities.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "codecType",
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio9CodecTypeE"
    },
    {
     "field_name" : "capabilities",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilities12CapabilitiesE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::CodecCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17CodecCapabilitiesE",
   "size" : 176,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/CodecCapabilities.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio15LdacChannelModeE"
    },
    {
     "field_name" : "qualityIndex",
     "field_offset" : 40,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio16LdacQualityIndexE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 48,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17LdacConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::LdacConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17LdacConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17LdacConfigurationE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/LdacConfiguration.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pcmBitDepth",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "samplingFrequencyHz",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "frameDurationUs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "octetsPerFrame",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "blocksPerSdu",
     "field_offset" : 128,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 136,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio11ChannelModeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17OpusConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::OpusConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17OpusConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17OpusConfigurationE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/OpusConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "extension",
     "referenced_type" : "_ZTIN3ndk17AParcelableHolderE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapability18VendorCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::UnicastCapability::VendorCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapability18VendorCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapability18VendorCapabilitiesE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/UnicastCapability.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware9bluetooth5audio15Lc3CapabilitiesENS5_17UnicastCapability18VendorCapabilitiesEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapability24LeAudioCodecCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::UnicastCapability::LeAudioCodecCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapability24LeAudioCodecCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapability24LeAudioCodecCapabilitiesE",
   "size" : 152,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/UnicastCapability.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "codecType",
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio9CodecTypeE"
    },
    {
     "field_name" : "supportedChannel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio13AudioLocationE"
    },
    {
     "field_name" : "deviceCount",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelCountPerDevice",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "leAudioCodecCapabilities",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapability24LeAudioCodecCapabilitiesE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapabilityE",
   "name" : "aidl::android::hardware::bluetooth::audio::UnicastCapability",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapabilityE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapabilityE",
   "size" : 168,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/UnicastCapability.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware9bluetooth5audio16PcmConfigurationENS5_18CodecConfigurationENS5_20LeAudioConfigurationENS5_29LeAudioBroadcastConfigurationEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio18AudioConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::AudioConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio18AudioConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio18AudioConfigurationE",
   "size" : 104,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AudioConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware9bluetooth5audio16SbcConfigurationENS5_16AacConfigurationENS5_17LdacConfigurationENS5_17AptxConfigurationENS5_25AptxAdaptiveConfigurationENS5_16Lc3ConfigurationENS5_18CodecConfiguration19VendorConfigurationENS_8optionalINS5_17OpusConfigurationEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfiguration13CodecSpecificE",
   "name" : "aidl::android::hardware::bluetooth::audio::CodecConfiguration::CodecSpecific",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfiguration13CodecSpecificE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfiguration13CodecSpecificE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/CodecConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vendorId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "codecId",
     "field_offset" : 32,
     "referenced_type" : "_ZTIDs"
    },
    {
     "field_name" : "codecConfig",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk17AParcelableHolderE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfiguration19VendorConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::CodecConfiguration::VendorConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfiguration19VendorConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfiguration19VendorConfigurationE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/CodecConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "codecType",
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio9CodecTypeE"
    },
    {
     "field_name" : "encodedAudioBitrate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "peerMtu",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "isScmstEnabled",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "config",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfiguration13CodecSpecificE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::CodecConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio18CodecConfigurationE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/CodecConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "extension",
     "referenced_type" : "_ZTIN3ndk17AParcelableHolderE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapability18VendorCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::BroadcastCapability::VendorCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapability18VendorCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapability18VendorCapabilitiesE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BroadcastCapability.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJNS_8optionalINS_6vectorINS1_IN4aidl7android8hardware9bluetooth5audio15Lc3CapabilitiesEEENS_9allocatorIS9_EEEEEENS1_INS2_INS1_INS7_19BroadcastCapability18VendorCapabilitiesEEENSA_ISG_EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapability24LeAudioCodecCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::BroadcastCapability::LeAudioCodecCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapability24LeAudioCodecCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapability24LeAudioCodecCapabilitiesE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BroadcastCapability.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "codecType",
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio9CodecTypeE"
    },
    {
     "field_name" : "supportedChannel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio13AudioLocationE"
    },
    {
     "field_name" : "channelCountPerStream",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "leAudioCodecCapabilities",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapability24LeAudioCodecCapabilitiesE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapabilityE",
   "name" : "aidl::android::hardware::bluetooth::audio::BroadcastCapability",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapabilityE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapabilityE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BroadcastCapability.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortE",
   "name" : "aidl::android::hardware::bluetooth::audio::IBluetoothAudioPort",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/IBluetoothAudioPort.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort23getPresentationPositionEPNS3_20PresentationPositionE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort11startStreamEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort10stopStreamEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort13suspendStreamEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort20updateSourceMetadataERKNS1_5audio6common14SourceMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort18updateSinkMetadataERKNS1_5audio6common12SinkMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort14setLatencyModeENS3_11LatencyModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPortE",
   "name" : "aidl::android::hardware::bluetooth::audio::BnBluetoothAudioPort",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPortE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPortE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BnBluetoothAudioPort.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPortE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPortD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPortD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort23getPresentationPositionEPNS3_20PresentationPositionE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort11startStreamEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort10stopStreamEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort13suspendStreamEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort20updateSourceMetadataERKNS1_5audio6common14SourceMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort18updateSinkMetadataERKNS1_5audio6common12SinkMetadataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPort14setLatencyModeENS3_11LatencyModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPort19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPort16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPort12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPortE",
   "name" : "aidl::android::hardware::bluetooth::audio::BpBluetoothAudioPort",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPortE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPortE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BpBluetoothAudioPort.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPortE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPortD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPortD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPort23getPresentationPositionEPNS3_20PresentationPositionE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPort11startStreamEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPort10stopStreamEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPort13suspendStreamEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPort20updateSourceMetadataERKNS1_5audio6common14SourceMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPort18updateSinkMetadataERKNS1_5audio6common12SinkMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPort14setLatencyModeENS3_11LatencyModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPort19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BpBluetoothAudioPort16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "streamHandle",
     "referenced_type" : "_ZTIDs"
    },
    {
     "field_name" : "audioChannelAllocation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio20LeAudioConfiguration9StreamMapE",
   "name" : "aidl::android::hardware::bluetooth::audio::LeAudioConfiguration::StreamMap",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20LeAudioConfiguration9StreamMapE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20LeAudioConfiguration9StreamMapE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/LeAudioConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "codecType",
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio9CodecTypeE"
    },
    {
     "field_name" : "streamMap",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio20LeAudioConfiguration9StreamMapENS_9allocatorIS7_EEEE"
    },
    {
     "field_name" : "peerDelayUs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "leAudioCodecConfig",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio25LeAudioCodecConfigurationE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio20LeAudioConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::LeAudioConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20LeAudioConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20LeAudioConfigurationE",
   "size" : 72,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/LeAudioConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tvSec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tvNSec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio20PresentationPosition8TimeSpecE",
   "name" : "aidl::android::hardware::bluetooth::audio::PresentationPosition::TimeSpec",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20PresentationPosition8TimeSpecE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20PresentationPosition8TimeSpecE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/PresentationPosition.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "remoteDeviceAudioDelayNanos",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "transmittedOctets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "transmittedOctetsTimestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20PresentationPosition8TimeSpecE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio20PresentationPositionE",
   "name" : "aidl::android::hardware::bluetooth::audio::PresentationPosition",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20PresentationPositionE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20PresentationPositionE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/PresentationPosition.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lowLowLatency",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "highLowLatency",
     "field_offset" : 8,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "lowHighQuality",
     "field_offset" : 16,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "highHighQuality",
     "field_offset" : 24,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "lowTws",
     "field_offset" : 32,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "highTws",
     "field_offset" : 40,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio22AptxAdaptiveTimeToPlayE",
   "name" : "aidl::android::hardware::bluetooth::audio::AptxAdaptiveTimeToPlay",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio22AptxAdaptiveTimeToPlayE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio22AptxAdaptiveTimeToPlayE",
   "size" : 6,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AptxAdaptiveTimeToPlay.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderE",
   "name" : "aidl::android::hardware::bluetooth::audio::IBluetoothAudioProvider",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/IBluetoothAudioProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider10endSessionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider12startSessionERKNSt3__110shared_ptrINS3_19IBluetoothAudioPortEEERKNS3_18AudioConfigurationERKNS5_6vectorINS3_11LatencyModeENS5_9allocatorISF_EEEEPNS1_6common3fmq12MQDescriptorIaNSM_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider13streamStartedENS3_20BluetoothAudioStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider15streamSuspendedENS3_20BluetoothAudioStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider24updateAudioConfigurationERKNS3_18AudioConfigurationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider24setLowLatencyModeAllowedEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio23AptxAdaptiveChannelModeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "aptxMode",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio8AptxModeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "sinkBufferingMs",
     "field_offset" : 768,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AptxSinkBufferingE"
    },
    {
     "field_name" : "ttp",
     "field_offset" : 816,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio22AptxAdaptiveTimeToPlayE"
    },
    {
     "field_name" : "inputMode",
     "field_offset" : 864,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio21AptxAdaptiveInputModeE"
    },
    {
     "field_name" : "inputFadeDurationMs",
     "field_offset" : 896,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "aptxAdaptiveConfigStream",
     "field_offset" : 960,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio24AptxAdaptiveCapabilitiesE",
   "name" : "aidl::android::hardware::bluetooth::audio::AptxAdaptiveCapabilities",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio24AptxAdaptiveCapabilitiesE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio24AptxAdaptiveCapabilitiesE",
   "size" : 144,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AptxAdaptiveCapabilities.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProviderE",
   "name" : "aidl::android::hardware::bluetooth::audio::BnBluetoothAudioProvider",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProviderE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProviderE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BnBluetoothAudioProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProviderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProviderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProviderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider10endSessionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider12startSessionERKNSt3__110shared_ptrINS3_19IBluetoothAudioPortEEERKNS3_18AudioConfigurationERKNS5_6vectorINS3_11LatencyModeENS5_9allocatorISF_EEEEPNS1_6common3fmq12MQDescriptorIaNSM_21SynchronizedReadWriteEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider13streamStartedENS3_20BluetoothAudioStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider15streamSuspendedENS3_20BluetoothAudioStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider24updateAudioConfigurationERKNS3_18AudioConfigurationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProvider24setLowLatencyModeAllowedEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProvider19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProvider12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProviderE",
   "name" : "aidl::android::hardware::bluetooth::audio::BpBluetoothAudioProvider",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProviderE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProviderE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BpBluetoothAudioProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProviderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProviderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProviderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProvider10endSessionEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProvider12startSessionERKNSt3__110shared_ptrINS3_19IBluetoothAudioPortEEERKNS3_18AudioConfigurationERKNS5_6vectorINS3_11LatencyModeENS5_9allocatorISF_EEEEPNS1_6common3fmq12MQDescriptorIaNSM_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProvider13streamStartedENS3_20BluetoothAudioStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProvider15streamSuspendedENS3_20BluetoothAudioStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProvider24updateAudioConfigurationERKNS3_18AudioConfigurationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProvider24setLowLatencyModeAllowedEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProvider19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BpBluetoothAudioProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sampleRateHz",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio23AptxAdaptiveChannelModeE"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 64,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "aptxMode",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio8AptxModeE"
    },
    {
     "field_name" : "sinkBufferingMs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17AptxSinkBufferingE"
    },
    {
     "field_name" : "ttp",
     "field_offset" : 176,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio22AptxAdaptiveTimeToPlayE"
    },
    {
     "field_name" : "inputMode",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio21AptxAdaptiveInputModeE"
    },
    {
     "field_name" : "inputFadeDurationMs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "aptxAdaptiveConfigStream",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio25AptxAdaptiveConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::AptxAdaptiveConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio25AptxAdaptiveConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio25AptxAdaptiveConfigurationE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/AptxAdaptiveConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "extension",
     "referenced_type" : "_ZTIN3ndk17AParcelableHolderE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio25LeAudioCodecConfiguration19VendorConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::LeAudioCodecConfiguration::VendorConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio25LeAudioCodecConfiguration19VendorConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio25LeAudioCodecConfiguration19VendorConfigurationE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/LeAudioCodecConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJN4aidl7android8hardware9bluetooth5audio16Lc3ConfigurationENS5_25LeAudioCodecConfiguration19VendorConfigurationEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio25LeAudioCodecConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::LeAudioCodecConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio25LeAudioCodecConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio25LeAudioCodecConfigurationE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/LeAudioCodecConfiguration.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefaultE",
   "name" : "aidl::android::hardware::bluetooth::audio::IBluetoothAudioPortDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/IBluetoothAudioPort.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault23getPresentationPositionEPNS3_20PresentationPositionE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault11startStreamEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault10stopStreamEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault13suspendStreamEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault20updateSourceMetadataERKNS1_5audio6common14SourceMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault18updateSinkMetadataERKNS1_5audio6common12SinkMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault14setLatencyModeENS3_11LatencyModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio26IBluetoothAudioPortDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPortE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegatorE",
   "name" : "aidl::android::hardware::bluetooth::audio::IBluetoothAudioPortDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BnBluetoothAudioPort.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio19IBluetoothAudioPortEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegator23getPresentationPositionEPNS3_20PresentationPositionE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegator11startStreamEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegator10stopStreamEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegator13suspendStreamEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegator20updateSourceMetadataERKNS1_5audio6common14SourceMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegator18updateSinkMetadataERKNS1_5audio6common12SinkMetadataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio28IBluetoothAudioPortDelegator14setLatencyModeENS3_11LatencyModeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPort19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPort16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio20BnBluetoothAudioPort12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "streamHandle",
     "referenced_type" : "_ZTIDs"
    },
    {
     "field_name" : "audioChannelAllocation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "leAudioCodecConfig",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio25LeAudioCodecConfigurationE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio29LeAudioBroadcastConfiguration18BroadcastStreamMapE",
   "name" : "aidl::android::hardware::bluetooth::audio::LeAudioBroadcastConfiguration::BroadcastStreamMap",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio29LeAudioBroadcastConfiguration18BroadcastStreamMapE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio29LeAudioBroadcastConfiguration18BroadcastStreamMapE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/LeAudioBroadcastConfiguration.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "codecType",
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio9CodecTypeE"
    },
    {
     "field_name" : "streamMap",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware9bluetooth5audio29LeAudioBroadcastConfiguration18BroadcastStreamMapENS_9allocatorIS7_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio29LeAudioBroadcastConfigurationE",
   "name" : "aidl::android::hardware::bluetooth::audio::LeAudioBroadcastConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio29LeAudioBroadcastConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio29LeAudioBroadcastConfigurationE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/LeAudioBroadcastConfiguration.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefaultE",
   "name" : "aidl::android::hardware::bluetooth::audio::IBluetoothAudioProviderDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/IBluetoothAudioProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault10endSessionEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault12startSessionERKNSt3__110shared_ptrINS3_19IBluetoothAudioPortEEERKNS3_18AudioConfigurationERKNS5_6vectorINS3_11LatencyModeENS5_9allocatorISF_EEEEPNS1_6common3fmq12MQDescriptorIaNSM_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault13streamStartedENS3_20BluetoothAudioStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault15streamSuspendedENS3_20BluetoothAudioStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault24updateAudioConfigurationERKNS3_18AudioConfigurationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault24setLowLatencyModeAllowedEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryE",
   "name" : "aidl::android::hardware::bluetooth::audio::IBluetoothAudioProviderFactory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/IBluetoothAudioProviderFactory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory23getProviderCapabilitiesENS3_11SessionTypeEPNSt3__16vectorINS3_17AudioCapabilitiesENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory12openProviderENS3_11SessionTypeEPNSt3__110shared_ptrINS3_23IBluetoothAudioProviderEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactoryE",
   "name" : "aidl::android::hardware::bluetooth::audio::BnBluetoothAudioProviderFactory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactoryE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactoryE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BnBluetoothAudioProviderFactory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory23getProviderCapabilitiesENS3_11SessionTypeEPNSt3__16vectorINS3_17AudioCapabilitiesENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactory12openProviderENS3_11SessionTypeEPNSt3__110shared_ptrINS3_23IBluetoothAudioProviderEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactory19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactory16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactory12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactoryE",
   "name" : "aidl::android::hardware::bluetooth::audio::BpBluetoothAudioProviderFactory",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactoryE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactoryE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BpBluetoothAudioProviderFactory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactory23getProviderCapabilitiesENS3_11SessionTypeEPNSt3__16vectorINS3_17AudioCapabilitiesENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactory12openProviderENS3_11SessionTypeEPNSt3__110shared_ptrINS3_23IBluetoothAudioProviderEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactory19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BpBluetoothAudioProviderFactory16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "unicastEncodeCapability",
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapabilityE"
    },
    {
     "field_name" : "unicastDecodeCapability",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio17UnicastCapabilityE"
    },
    {
     "field_name" : "broadcastCapability",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio19BroadcastCapabilityE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio31LeAudioCodecCapabilitiesSettingE",
   "name" : "aidl::android::hardware::bluetooth::audio::LeAudioCodecCapabilitiesSetting",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio31LeAudioCodecCapabilitiesSettingE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio31LeAudioCodecCapabilitiesSettingE",
   "size" : 400,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/LeAudioCodecCapabilitiesSetting.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProviderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegatorE",
   "name" : "aidl::android::hardware::bluetooth::audio::IBluetoothAudioProviderDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BnBluetoothAudioProvider.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio23IBluetoothAudioProviderEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegator10endSessionEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegator12startSessionERKNSt3__110shared_ptrINS3_19IBluetoothAudioPortEEERKNS3_18AudioConfigurationERKNS5_6vectorINS3_11LatencyModeENS5_9allocatorISF_EEEEPNS1_6common3fmq12MQDescriptorIaNSM_21SynchronizedReadWriteEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegator13streamStartedENS3_20BluetoothAudioStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegator15streamSuspendedENS3_20BluetoothAudioStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegator24updateAudioConfigurationERKNS3_18AudioConfigurationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio32IBluetoothAudioProviderDelegator24setLowLatencyModeAllowedEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProvider19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProvider16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio24BnBluetoothAudioProvider12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefaultE",
   "name" : "aidl::android::hardware::bluetooth::audio::IBluetoothAudioProviderFactoryDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/IBluetoothAudioProviderFactory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefault23getProviderCapabilitiesENS3_11SessionTypeEPNSt3__16vectorINS3_17AudioCapabilitiesENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefault12openProviderENS3_11SessionTypeEPNSt3__110shared_ptrINS3_23IBluetoothAudioProviderEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio37IBluetoothAudioProviderFactoryDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactoryE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware9bluetooth5audio39IBluetoothAudioProviderFactoryDelegatorE",
   "name" : "aidl::android::hardware::bluetooth::audio::IBluetoothAudioProviderFactoryDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio39IBluetoothAudioProviderFactoryDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware9bluetooth5audio39IBluetoothAudioProviderFactoryDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/bluetooth/audio/aidl/android.hardware.bluetooth.audio-V2-ndk-source/gen/include/aidl/android/hardware/bluetooth/audio/BnBluetoothAudioProviderFactory.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware9bluetooth5audio39IBluetoothAudioProviderFactoryDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio39IBluetoothAudioProviderFactoryDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio39IBluetoothAudioProviderFactoryDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware9bluetooth5audio30IBluetoothAudioProviderFactoryEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio39IBluetoothAudioProviderFactoryDelegator23getProviderCapabilitiesENS3_11SessionTypeEPNSt3__16vectorINS3_17AudioCapabilitiesENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio39IBluetoothAudioProviderFactoryDelegator12openProviderENS3_11SessionTypeEPNSt3__110shared_ptrINS3_23IBluetoothAudioProviderEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactory19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactory16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware9bluetooth5audio31BnBluetoothAudioProviderFactory12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<ndk::ScopedFileDescriptor, std::allocator<ndk::ScopedFileDescriptor>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN3ndk20ScopedFileDescriptorENS3_9allocatorIS6_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN3ndk20ScopedFileDescriptorENS_9allocatorIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5audio6common19RecordTrackMetadataENS3_9allocatorISA_EEEEEE",
