{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIDs",
   "name" : "char16_t",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIDs",
   "size" : 2
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",

   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long, std::allocator<unsigned long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/IRadioDataIndication.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data10IRadioDataE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::radio::data::IRadioData>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio4data10IRadioDataE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData20allocatePduSessionIdEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14cancelHandoverEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData18deactivateDataCallEiiNS3_17DataRequestReasonE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData15getDataCallListEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData16getSlicingConfigEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19releasePduSessionIdEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData23responseAcknowledgementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14setDataAllowedEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14setDataProfileEiRKNSt3__16vectorINS3_15DataProfileInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData17setDataThrottlingEiNS3_20DataThrottlingActionEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19setInitialAttachApnEiRKNSt3__18optionalINS3_15DataProfileInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData20setResponseFunctionsERKNSt3__110shared_ptrINS3_18IRadioDataResponseEEERKNS6_INS3_20IRadioDataIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13setupDataCallEiNS2_13AccessNetworkERKNS3_15DataProfileInfoEbNS3_17DataRequestReasonERKNSt3__16vectorINS3_11LinkAddressENSA_9allocatorISC_EEEERKNSB_INSA_12basic_stringIcNSA_11char_traitsIcEENSD_IcEEEENSD_ISM_EEEEiRKNSA_8optionalINS3_9SliceInfoEEEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13startHandoverEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14startKeepaliveEiRKNS3_16KeepaliveRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13stopKeepaliveEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data18IRadioDataResponseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::radio::data::IRadioDataResponse>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio4data18IRadioDataResponseE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse18acknowledgeRequestEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse28allocatePduSessionIdResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22cancelHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse26deactivateDataCallResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse23getDataCallListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_19SetupDataCallResultENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse24getSlicingConfigResponseERKNS2_17RadioResponseInfoERKNS3_13SlicingConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse27releasePduSessionIdResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22setDataAllowedResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22setDataProfileResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse25setDataThrottlingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse27setInitialAttachApnResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21setupDataCallResponseERKNS2_17RadioResponseInfoERKNS3_19SetupDataCallResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21startHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22startKeepaliveResponseERKNS2_17RadioResponseInfoERKNS3_15KeepaliveStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21stopKeepaliveResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data20IRadioDataIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::radio::data::IRadioDataIndication>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio4data20IRadioDataIndicationE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication19dataCallListChangedENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_19SetupDataCallResultENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication15keepaliveStatusENS2_19RadioIndicationTypeERKNS3_15KeepaliveStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication7pcoDataENS2_19RadioIndicationTypeERKNS3_11PcoDataInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication13unthrottleApnENS2_19RadioIndicationTypeERKNS3_15DataProfileInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication20slicingConfigChangedENS2_19RadioIndicationTypeERKNS3_13SlicingConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data10IRadioDataE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::radio::data::IRadioData>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio4data10IRadioDataE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData20allocatePduSessionIdEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14cancelHandoverEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData18deactivateDataCallEiiNS3_17DataRequestReasonE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData15getDataCallListEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData16getSlicingConfigEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19releasePduSessionIdEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData23responseAcknowledgementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14setDataAllowedEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14setDataProfileEiRKNSt3__16vectorINS3_15DataProfileInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData17setDataThrottlingEiNS3_20DataThrottlingActionEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19setInitialAttachApnEiRKNSt3__18optionalINS3_15DataProfileInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData20setResponseFunctionsERKNSt3__110shared_ptrINS3_18IRadioDataResponseEEERKNS6_INS3_20IRadioDataIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13setupDataCallEiNS2_13AccessNetworkERKNS3_15DataProfileInfoEbNS3_17DataRequestReasonERKNSt3__16vectorINS3_11LinkAddressENSA_9allocatorISC_EEEERKNSB_INSA_12basic_stringIcNSA_11char_traitsIcEENSD_IcEEEENSD_ISM_EEEEiRKNSA_8optionalINS3_9SliceInfoEEEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13startHandoverEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14startKeepaliveEiRKNS3_16KeepaliveRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13stopKeepaliveEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data18IRadioDataResponseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::radio::data::IRadioDataResponse>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio4data18IRadioDataResponseE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse18acknowledgeRequestEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse28allocatePduSessionIdResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22cancelHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse26deactivateDataCallResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse23getDataCallListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_19SetupDataCallResultENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse24getSlicingConfigResponseERKNS2_17RadioResponseInfoERKNS3_13SlicingConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse27releasePduSessionIdResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22setDataAllowedResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22setDataProfileResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse25setDataThrottlingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse27setInitialAttachApnResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21setupDataCallResponseERKNS2_17RadioResponseInfoERKNS3_19SetupDataCallResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21startHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22startKeepaliveResponseERKNS2_17RadioResponseInfoERKNS3_15KeepaliveStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21stopKeepaliveResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data20IRadioDataIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::radio::data::IRadioDataIndication>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware5radio4data20IRadioDataIndicationE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication19dataCallListChangedENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_19SetupDataCallResultENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication15keepaliveStatusENS2_19RadioIndicationTypeERKNS3_15KeepaliveStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication7pcoDataENS2_19RadioIndicationTypeERKNS3_11PcoDataInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication13unthrottleApnENS2_19RadioIndicationTypeERKNS3_15DataProfileInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication20slicingConfigChangedENS2_19RadioIndicationTypeERKNS3_13SlicingConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio17RadioResponseTypeE"
    },
    {
     "field_name" : "serial",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "error",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio10RadioErrorE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio17RadioResponseInfoE",
   "name" : "aidl::android::hardware::radio::RadioResponseInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio17RadioResponseInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio17RadioResponseInfoE",
   "size" : 12,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio-V1-ndk-source/gen/include/aidl/android/hardware/radio/RadioResponseInfo.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data10IRadioDataE",
   "name" : "aidl::android::hardware::radio::data::IRadioData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data10IRadioDataE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data10IRadioDataE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/IRadioData.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data10IRadioDataE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioDataD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioDataD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData20allocatePduSessionIdEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14cancelHandoverEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData18deactivateDataCallEiiNS3_17DataRequestReasonE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData15getDataCallListEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData16getSlicingConfigEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19releasePduSessionIdEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData23responseAcknowledgementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14setDataAllowedEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14setDataProfileEiRKNSt3__16vectorINS3_15DataProfileInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData17setDataThrottlingEiNS3_20DataThrottlingActionEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19setInitialAttachApnEiRKNSt3__18optionalINS3_15DataProfileInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData20setResponseFunctionsERKNSt3__110shared_ptrINS3_18IRadioDataResponseEEERKNS6_INS3_20IRadioDataIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13setupDataCallEiNS2_13AccessNetworkERKNS3_15DataProfileInfoEbNS3_17DataRequestReasonERKNSt3__16vectorINS3_11LinkAddressENSA_9allocatorISC_EEEERKNSB_INSA_12basic_stringIcNSA_11char_traitsIcEENSD_IcEEEENSD_ISM_EEEEiRKNSA_8optionalINS3_9SliceInfoEEEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13startHandoverEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14startKeepaliveEiRKNS3_16KeepaliveRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13stopKeepaliveEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "qosSessionId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "qos",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data3QosE"
    },
    {
     "field_name" : "qosFilters",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data9QosFilterENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data10QosSessionE",
   "name" : "aidl::android::hardware::radio::data::QosSession",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data10QosSessionE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data10QosSessionE",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/QosSession.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data11BnRadioDataE",
   "name" : "aidl::android::hardware::radio::data::BnRadioData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data11BnRadioDataE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data11BnRadioDataE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/BnRadioData.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data11BnRadioDataE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BnRadioDataD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BnRadioDataD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData20allocatePduSessionIdEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14cancelHandoverEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData18deactivateDataCallEiiNS3_17DataRequestReasonE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData15getDataCallListEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData16getSlicingConfigEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19releasePduSessionIdEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData23responseAcknowledgementEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14setDataAllowedEib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14setDataProfileEiRKNSt3__16vectorINS3_15DataProfileInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData17setDataThrottlingEiNS3_20DataThrottlingActionEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData19setInitialAttachApnEiRKNSt3__18optionalINS3_15DataProfileInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData20setResponseFunctionsERKNSt3__110shared_ptrINS3_18IRadioDataResponseEEERKNS6_INS3_20IRadioDataIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13setupDataCallEiNS2_13AccessNetworkERKNS3_15DataProfileInfoEbNS3_17DataRequestReasonERKNSt3__16vectorINS3_11LinkAddressENSA_9allocatorISC_EEEERKNSB_INSA_12basic_stringIcNSA_11char_traitsIcEENSD_IcEEEENSD_ISM_EEEEiRKNSA_8optionalINS3_9SliceInfoEEEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13startHandoverEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData14startKeepaliveEiRKNS3_16KeepaliveRequestE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data10IRadioData13stopKeepaliveEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BnRadioData19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BnRadioData16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BnRadioData12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data11BpRadioDataE",
   "name" : "aidl::android::hardware::radio::data::BpRadioData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data11BpRadioDataE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data11BpRadioDataE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/BpRadioData.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data11BpRadioDataE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioDataD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioDataD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData20allocatePduSessionIdEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData14cancelHandoverEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData18deactivateDataCallEiiNS3_17DataRequestReasonE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData15getDataCallListEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData16getSlicingConfigEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData19releasePduSessionIdEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData23responseAcknowledgementEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData14setDataAllowedEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData14setDataProfileEiRKNSt3__16vectorINS3_15DataProfileInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData17setDataThrottlingEiNS3_20DataThrottlingActionEl"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData19setInitialAttachApnEiRKNSt3__18optionalINS3_15DataProfileInfoEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData20setResponseFunctionsERKNSt3__110shared_ptrINS3_18IRadioDataResponseEEERKNS6_INS3_20IRadioDataIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData13setupDataCallEiNS2_13AccessNetworkERKNS3_15DataProfileInfoEbNS3_17DataRequestReasonERKNSt3__16vectorINS3_11LinkAddressENSA_9allocatorISC_EEEERKNSB_INSA_12basic_stringIcNSA_11char_traitsIcEENSD_IcEEEENSD_ISM_EEEEiRKNSA_8optionalINS3_9SliceInfoEEEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData13startHandoverEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData14startKeepaliveEiRKNS3_16KeepaliveRequestE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData13stopKeepaliveEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BpRadioData16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "address",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "addressProperties",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "deprecationTime",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "expirationTime",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data11LinkAddressE",
   "name" : "aidl::android::hardware::radio::data::LinkAddress",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data11LinkAddressE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data11LinkAddressE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/LinkAddress.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bearerProto",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "pcoId",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "contents",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data11PcoDataInfoE",
   "name" : "aidl::android::hardware::radio::data::PcoDataInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data11PcoDataInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data11PcoDataInfoE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/PcoDataInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxBitrateKbps",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "guaranteedBitrateKbps",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data12QosBandwidthE",
   "name" : "aidl::android::hardware::radio::data::QosBandwidth",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data12QosBandwidthE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data12QosBandwidthE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/QosBandwidth.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "urspRules",
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data8UrspRuleENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "sliceInfo",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data9SliceInfoENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data13SlicingConfigE",
   "name" : "aidl::android::hardware::radio::data::SlicingConfig",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data13SlicingConfigE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data13SlicingConfigE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/SlicingConfig.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "profileId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "apn",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "protocol",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data15PdpProtocolTypeE"
    },
    {
     "field_name" : "roamingProtocol",
     "field_offset" : 288,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data15PdpProtocolTypeE"
    },
    {
     "field_name" : "authType",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data11ApnAuthTypeE"
    },
    {
     "field_name" : "user",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "password",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "type",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxConnsTime",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxConns",
     "field_offset" : 832,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "waitTime",
     "field_offset" : 864,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "enabled",
     "field_offset" : 896,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "supportedApnTypesBitmap",
     "field_offset" : 928,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bearerBitmap",
     "field_offset" : 960,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mtuV4",
     "field_offset" : 992,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mtuV6",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "preferred",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "persistent",
     "field_offset" : 1064,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "alwaysOn",
     "field_offset" : 1072,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "trafficDescriptor",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data17TrafficDescriptorE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data15DataProfileInfoE",
   "name" : "aidl::android::hardware::radio::data::DataProfileInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data15DataProfileInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data15DataProfileInfoE",
   "size" : 200,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/DataProfileInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sessionHandle",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data15KeepaliveStatusE",
   "name" : "aidl::android::hardware::radio::data::KeepaliveStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data15KeepaliveStatusE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data15KeepaliveStatusE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/KeepaliveStatus.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sourceAddress",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "sourcePort",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "destinationAddress",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "destinationPort",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxKeepaliveIntervalMillis",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data16KeepaliveRequestE",
   "name" : "aidl::android::hardware::radio::data::KeepaliveRequest",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data16KeepaliveRequestE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data16KeepaliveRequestE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/KeepaliveRequest.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data10IRadioDataE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data17IRadioDataDefaultE",
   "name" : "aidl::android::hardware::radio::data::IRadioDataDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data17IRadioDataDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data17IRadioDataDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/IRadioData.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data17IRadioDataDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault20allocatePduSessionIdEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault14cancelHandoverEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault18deactivateDataCallEiiNS3_17DataRequestReasonE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault15getDataCallListEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault16getSlicingConfigEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault19releasePduSessionIdEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault23responseAcknowledgementEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault14setDataAllowedEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault14setDataProfileEiRKNSt3__16vectorINS3_15DataProfileInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault17setDataThrottlingEiNS3_20DataThrottlingActionEl"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault19setInitialAttachApnEiRKNSt3__18optionalINS3_15DataProfileInfoEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault20setResponseFunctionsERKNSt3__110shared_ptrINS3_18IRadioDataResponseEEERKNS6_INS3_20IRadioDataIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault13setupDataCallEiNS2_13AccessNetworkERKNS3_15DataProfileInfoEbNS3_17DataRequestReasonERKNSt3__16vectorINS3_11LinkAddressENSA_9allocatorISC_EEEERKNSB_INSA_12basic_stringIcNSA_11char_traitsIcEENSD_IcEEEENSD_ISM_EEEEiRKNSA_8optionalINS3_9SliceInfoEEEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault13startHandoverEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault14startKeepaliveEiRKNS3_16KeepaliveRequestE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault13stopKeepaliveEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data17IRadioDataDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbiEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data17QosFilterIpsecSpiE",
   "name" : "aidl::android::hardware::radio::data::QosFilterIpsecSpi",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data17QosFilterIpsecSpiE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data17QosFilterIpsecSpiE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/QosFilterIpsecSpi.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dnn",
     "referenced_type" : "_ZTINSt3__18optionalINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE"
    },
    {
     "field_name" : "osAppId",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware5radio4data7OsAppIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data17TrafficDescriptorE",
   "name" : "aidl::android::hardware::radio::data::TrafficDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data17TrafficDescriptorE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data17TrafficDescriptorE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/TrafficDescriptor.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data18IRadioDataResponseE",
   "name" : "aidl::android::hardware::radio::data::IRadioDataResponse",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data18IRadioDataResponseE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data18IRadioDataResponseE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/IRadioDataResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data18IRadioDataResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponseD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse18acknowledgeRequestEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse28allocatePduSessionIdResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22cancelHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse26deactivateDataCallResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse23getDataCallListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_19SetupDataCallResultENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse24getSlicingConfigResponseERKNS2_17RadioResponseInfoERKNS3_13SlicingConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse27releasePduSessionIdResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22setDataAllowedResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22setDataProfileResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse25setDataThrottlingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse27setInitialAttachApnResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21setupDataCallResponseERKNS2_17RadioResponseInfoERKNS3_19SetupDataCallResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21startHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22startKeepaliveResponseERKNS2_17RadioResponseInfoERKNS3_15KeepaliveStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21stopKeepaliveResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data19BnRadioDataResponseE",
   "name" : "aidl::android::hardware::radio::data::BnRadioDataResponse",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data19BnRadioDataResponseE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data19BnRadioDataResponseE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/BnRadioDataResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data19BnRadioDataResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BnRadioDataResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BnRadioDataResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse18acknowledgeRequestEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse28allocatePduSessionIdResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22cancelHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse26deactivateDataCallResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse23getDataCallListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_19SetupDataCallResultENS8_9allocatorISA_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse24getSlicingConfigResponseERKNS2_17RadioResponseInfoERKNS3_13SlicingConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse27releasePduSessionIdResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22setDataAllowedResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22setDataProfileResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse25setDataThrottlingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse27setInitialAttachApnResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21setupDataCallResponseERKNS2_17RadioResponseInfoERKNS3_19SetupDataCallResultE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21startHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse22startKeepaliveResponseERKNS2_17RadioResponseInfoERKNS3_15KeepaliveStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data18IRadioDataResponse21stopKeepaliveResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BnRadioDataResponse19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BnRadioDataResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BnRadioDataResponse12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data19BpRadioDataResponseE",
   "name" : "aidl::android::hardware::radio::data::BpRadioDataResponse",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data19BpRadioDataResponseE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data19BpRadioDataResponseE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/BpRadioDataResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data19BpRadioDataResponseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse18acknowledgeRequestEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse28allocatePduSessionIdResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse22cancelHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse26deactivateDataCallResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse23getDataCallListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_19SetupDataCallResultENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse24getSlicingConfigResponseERKNS2_17RadioResponseInfoERKNS3_13SlicingConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse27releasePduSessionIdResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse22setDataAllowedResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse22setDataProfileResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse25setDataThrottlingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse27setInitialAttachApnResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse21setupDataCallResponseERKNS2_17RadioResponseInfoERKNS3_19SetupDataCallResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse21startHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse22startKeepaliveResponseERKNS2_17RadioResponseInfoERKNS3_15KeepaliveStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse21stopKeepaliveResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BpRadioDataResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data11BnRadioDataE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware5radio4data10IRadioDataEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data19IRadioDataDelegatorE",
   "name" : "aidl::android::hardware::radio::data::IRadioDataDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data19IRadioDataDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data19IRadioDataDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/BnRadioData.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data19IRadioDataDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data10IRadioDataEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator20allocatePduSessionIdEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator14cancelHandoverEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator18deactivateDataCallEiiNS3_17DataRequestReasonE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator15getDataCallListEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator16getSlicingConfigEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator19releasePduSessionIdEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator23responseAcknowledgementEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator14setDataAllowedEib"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator14setDataProfileEiRKNSt3__16vectorINS3_15DataProfileInfoENS5_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator17setDataThrottlingEiNS3_20DataThrottlingActionEl"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator19setInitialAttachApnEiRKNSt3__18optionalINS3_15DataProfileInfoEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator20setResponseFunctionsERKNSt3__110shared_ptrINS3_18IRadioDataResponseEEERKNS6_INS3_20IRadioDataIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator13setupDataCallEiNS2_13AccessNetworkERKNS3_15DataProfileInfoEbNS3_17DataRequestReasonERKNSt3__16vectorINS3_11LinkAddressENSA_9allocatorISC_EEEERKNSB_INSA_12basic_stringIcNSA_11char_traitsIcEENSD_IcEEEENSD_ISM_EEEEiRKNSA_8optionalINS3_9SliceInfoEEEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator13startHandoverEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator14startKeepaliveEiRKNS3_16KeepaliveRequestE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19IRadioDataDelegator13stopKeepaliveEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BnRadioData19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BnRadioData16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data11BnRadioData12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cause",
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data17DataCallFailCauseE"
    },
    {
     "field_name" : "suggestedRetryTime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "cid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "active",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data15PdpProtocolTypeE"
    },
    {
     "field_name" : "ifname",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "addresses",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data11LinkAddressENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "dnses",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "field_name" : "gateways",
     "field_offset" : 832,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "field_name" : "pcscf",
     "field_offset" : 1024,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "field_name" : "mtuV4",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mtuV6",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "defaultQos",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data3QosE"
    },
    {
     "field_name" : "qosSessions",
     "field_offset" : 1536,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data10QosSessionENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "handoverFailureMode",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "pduSessionId",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sliceInfo",
     "field_offset" : 1792,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware5radio4data9SliceInfoEEE"
    },
    {
     "field_name" : "trafficDescriptors",
     "field_offset" : 1984,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data17TrafficDescriptorENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data19SetupDataCallResultE",
   "name" : "aidl::android::hardware::radio::data::SetupDataCallResult",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data19SetupDataCallResultE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data19SetupDataCallResultE",
   "size" : 272,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/SetupDataCallResult.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data20IRadioDataIndicationE",
   "name" : "aidl::android::hardware::radio::data::IRadioDataIndication",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data20IRadioDataIndicationE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data20IRadioDataIndicationE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/IRadioDataIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data20IRadioDataIndicationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndicationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndicationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication19dataCallListChangedENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_19SetupDataCallResultENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication15keepaliveStatusENS2_19RadioIndicationTypeERKNS3_15KeepaliveStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication7pcoDataENS2_19RadioIndicationTypeERKNS3_11PcoDataInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication13unthrottleApnENS2_19RadioIndicationTypeERKNS3_15DataProfileInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication20slicingConfigChangedENS2_19RadioIndicationTypeERKNS3_13SlicingConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data21BnRadioDataIndicationE",
   "name" : "aidl::android::hardware::radio::data::BnRadioDataIndication",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data21BnRadioDataIndicationE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data21BnRadioDataIndicationE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/BnRadioDataIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data21BnRadioDataIndicationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BnRadioDataIndicationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BnRadioDataIndicationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication19dataCallListChangedENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_19SetupDataCallResultENS6_9allocatorIS8_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication15keepaliveStatusENS2_19RadioIndicationTypeERKNS3_15KeepaliveStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication7pcoDataENS2_19RadioIndicationTypeERKNS3_11PcoDataInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication13unthrottleApnENS2_19RadioIndicationTypeERKNS3_15DataProfileInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data20IRadioDataIndication20slicingConfigChangedENS2_19RadioIndicationTypeERKNS3_13SlicingConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BnRadioDataIndication19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BnRadioDataIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BnRadioDataIndication12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data21BpRadioDataIndicationE",
   "name" : "aidl::android::hardware::radio::data::BpRadioDataIndication",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data21BpRadioDataIndicationE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data21BpRadioDataIndicationE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/BpRadioDataIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data21BpRadioDataIndicationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BpRadioDataIndicationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BpRadioDataIndicationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BpRadioDataIndication19dataCallListChangedENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_19SetupDataCallResultENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BpRadioDataIndication15keepaliveStatusENS2_19RadioIndicationTypeERKNS3_15KeepaliveStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BpRadioDataIndication7pcoDataENS2_19RadioIndicationTypeERKNS3_11PcoDataInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BpRadioDataIndication13unthrottleApnENS2_19RadioIndicationTypeERKNS3_15DataProfileInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BpRadioDataIndication20slicingConfigChangedENS2_19RadioIndicationTypeERKNS3_13SlicingConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BpRadioDataIndication19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BpRadioDataIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbiEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data22QosFilterIpv6FlowLabelE",
   "name" : "aidl::android::hardware::radio::data::QosFilterIpv6FlowLabel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data22QosFilterIpv6FlowLabelE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data22QosFilterIpv6FlowLabelE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/QosFilterIpv6FlowLabel.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbaEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data22QosFilterTypeOfServiceE",
   "name" : "aidl::android::hardware::radio::data::QosFilterTypeOfService",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data22QosFilterTypeOfServiceE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data22QosFilterTypeOfServiceE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/QosFilterTypeOfService.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "precedence",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "sessionType",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data15PdpProtocolTypeE"
    },
    {
     "field_name" : "sscMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "sliceInfo",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data9SliceInfoENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "dnn",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data24RouteSelectionDescriptorE",
   "name" : "aidl::android::hardware::radio::data::RouteSelectionDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data24RouteSelectionDescriptorE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data24RouteSelectionDescriptorE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/RouteSelectionDescriptor.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data18IRadioDataResponseE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data25IRadioDataResponseDefaultE",
   "name" : "aidl::android::hardware::radio::data::IRadioDataResponseDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data25IRadioDataResponseDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data25IRadioDataResponseDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/IRadioDataResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data25IRadioDataResponseDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault18acknowledgeRequestEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault28allocatePduSessionIdResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault22cancelHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault26deactivateDataCallResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault23getDataCallListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_19SetupDataCallResultENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault24getSlicingConfigResponseERKNS2_17RadioResponseInfoERKNS3_13SlicingConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault27releasePduSessionIdResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault22setDataAllowedResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault22setDataProfileResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault25setDataThrottlingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault27setInitialAttachApnResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault21setupDataCallResponseERKNS2_17RadioResponseInfoERKNS3_19SetupDataCallResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault21startHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault22startKeepaliveResponseERKNS2_17RadioResponseInfoERKNS3_15KeepaliveStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault21stopKeepaliveResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data25IRadioDataResponseDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data20IRadioDataIndicationE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data27IRadioDataIndicationDefaultE",
   "name" : "aidl::android::hardware::radio::data::IRadioDataIndicationDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data27IRadioDataIndicationDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data27IRadioDataIndicationDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/IRadioDataIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data27IRadioDataIndicationDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefault19dataCallListChangedENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_19SetupDataCallResultENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefault15keepaliveStatusENS2_19RadioIndicationTypeERKNS3_15KeepaliveStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefault7pcoDataENS2_19RadioIndicationTypeERKNS3_11PcoDataInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefault13unthrottleApnENS2_19RadioIndicationTypeERKNS3_15DataProfileInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefault20slicingConfigChangedENS2_19RadioIndicationTypeERKNS3_13SlicingConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataIndicationDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data19BnRadioDataResponseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware5radio4data18IRadioDataResponseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data27IRadioDataResponseDelegatorE",
   "name" : "aidl::android::hardware::radio::data::IRadioDataResponseDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data27IRadioDataResponseDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data27IRadioDataResponseDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/BnRadioDataResponse.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data27IRadioDataResponseDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data18IRadioDataResponseEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator18acknowledgeRequestEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator28allocatePduSessionIdResponseERKNS2_17RadioResponseInfoEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator22cancelHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator26deactivateDataCallResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator23getDataCallListResponseERKNS2_17RadioResponseInfoERKNSt3__16vectorINS3_19SetupDataCallResultENS8_9allocatorISA_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator24getSlicingConfigResponseERKNS2_17RadioResponseInfoERKNS3_13SlicingConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator27releasePduSessionIdResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator22setDataAllowedResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator22setDataProfileResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator25setDataThrottlingResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator27setInitialAttachApnResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator21setupDataCallResponseERKNS2_17RadioResponseInfoERKNS3_19SetupDataCallResultE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator21startHandoverResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator22startKeepaliveResponseERKNS2_17RadioResponseInfoERKNS3_15KeepaliveStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data27IRadioDataResponseDelegator21stopKeepaliveResponseERKNS2_17RadioResponseInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BnRadioDataResponse19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BnRadioDataResponse16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data19BnRadioDataResponse12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data21BnRadioDataIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware5radio4data20IRadioDataIndicationEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegatorE",
   "name" : "aidl::android::hardware::radio::data::IRadioDataIndicationDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/BnRadioDataIndication.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware5radio4data20IRadioDataIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegator19dataCallListChangedENS2_19RadioIndicationTypeERKNSt3__16vectorINS3_19SetupDataCallResultENS6_9allocatorIS8_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegator15keepaliveStatusENS2_19RadioIndicationTypeERKNS3_15KeepaliveStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegator7pcoDataENS2_19RadioIndicationTypeERKNS3_11PcoDataInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegator13unthrottleApnENS2_19RadioIndicationTypeERKNS3_15DataProfileInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data29IRadioDataIndicationDelegator20slicingConfigChangedENS2_19RadioIndicationTypeERKNS3_13SlicingConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BnRadioDataIndication19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BnRadioDataIndication16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware5radio4data21BnRadioDataIndication12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbN4aidl7android8hardware5radio4data6EpsQosENS5_5NrQosEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data3QosE",
   "name" : "aidl::android::hardware::radio::data::Qos",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data3QosE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data3QosE",
   "size" : 28,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/Qos.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fiveQi",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "downlink",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data12QosBandwidthE"
    },
    {
     "field_name" : "uplink",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data12QosBandwidthE"
    },
    {
     "field_name" : "qfi",
     "field_offset" : 160,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "averagingWindowMs",
     "field_offset" : 176,
     "referenced_type" : "_ZTIDs"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data5NrQosE",
   "name" : "aidl::android::hardware::radio::data::NrQos",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data5NrQosE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data5NrQosE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/NrQos.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "qci",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "downlink",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data12QosBandwidthE"
    },
    {
     "field_name" : "uplink",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data12QosBandwidthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data6EpsQosE",
   "name" : "aidl::android::hardware::radio::data::EpsQos",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data6EpsQosE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data6EpsQosE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/EpsQos.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "osAppId",
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data7OsAppIdE",
   "name" : "aidl::android::hardware::radio::data::OsAppId",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data7OsAppIdE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data7OsAppIdE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/OsAppId.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "precedence",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "trafficDescriptors",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data17TrafficDescriptorENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "routeSelectionDescriptor",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data24RouteSelectionDescriptorENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data8UrspRuleE",
   "name" : "aidl::android::hardware::radio::data::UrspRule",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data8UrspRuleE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data8UrspRuleE",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/UrspRule.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "end",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data9PortRangeE",
   "name" : "aidl::android::hardware::radio::data::PortRange",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data9PortRangeE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data9PortRangeE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/PortRange.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "localAddresses",
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "field_name" : "remoteAddresses",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS4_IS6_EEEE"
    },
    {
     "field_name" : "localPort",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware5radio4data9PortRangeEEE"
    },
    {
     "field_name" : "remotePort",
     "field_offset" : 480,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android8hardware5radio4data9PortRangeEEE"
    },
    {
     "field_name" : "protocol",
     "field_offset" : 576,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "tos",
     "field_offset" : 608,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data22QosFilterTypeOfServiceE"
    },
    {
     "field_name" : "flowLabel",
     "field_offset" : 672,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data22QosFilterIpv6FlowLabelE"
    },
    {
     "field_name" : "spi",
     "field_offset" : 736,
     "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data17QosFilterIpsecSpiE"
    },
    {
     "field_name" : "direction",
     "field_offset" : 800,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "precedence",
     "field_offset" : 832,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data9QosFilterE",
   "name" : "aidl::android::hardware::radio::data::QosFilter",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data9QosFilterE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data9QosFilterE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/QosFilter.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sliceServiceType",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "sliceDifferentiator",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mappedHplmnSst",
     "field_offset" : 64,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "mappedHplmnSd",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "status",
     "field_offset" : 128,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware5radio4data9SliceInfoE",
   "name" : "aidl::android::hardware::radio::data::SliceInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware5radio4data9SliceInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware5radio4data9SliceInfoE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/radio/aidl/android.hardware.radio.data-V1-ndk-source/gen/include/aidl/android/hardware/radio/data/SliceInfo.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data10QosSessionENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::radio::data::QosSession, std::allocator<aidl::android::hardware::radio::data::QosSession>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data10QosSessionENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data10QosSessionENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data10QosSessionENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data11LinkAddressENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::radio::data::LinkAddress, std::allocator<aidl::android::hardware::radio::data::LinkAddress>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data11LinkAddressENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data11LinkAddressENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data11LinkAddressENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data17TrafficDescriptorENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::radio::data::TrafficDescriptor, std::allocator<aidl::android::hardware::radio::data::TrafficDescriptor>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data17TrafficDescriptorENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data17TrafficDescriptorENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware5radio4data17TrafficDescriptorENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware5radio4data24RouteSelectionDescriptorENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::radio::data::RouteSelectionDescriptor, std::allocator<aidl::android::hardware::radio::data::RouteSelectionDescriptor>>>",
   "record_kind" : "class",
