{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 8
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"

   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "name" : "const std::optional<std::vector<long, std::allocator<long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIlNS_9allocatorIlEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long, std::allocator<unsigned long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorImNS_9allocatorImEEEEEE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/DiskStats.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/IHealthInfoCallback.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6health19IHealthInfoCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::health::IHealthInfoCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6health19IHealthInfoCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6health7IHealthE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::health::IHealth>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEEE",
   "size" : 80,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6health7IHealthE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth16registerCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth18unregisterCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getChargeCounterUahEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth22getCurrentNowMicroampsEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth26getCurrentAverageMicroampsEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth11getCapacityEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getEnergyCounterNwhEPl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth15getChargeStatusEPNS2_13BatteryStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth14getStorageInfoEPNSt3__16vectorINS2_11StorageInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth12getDiskStatsEPNSt3__16vectorINS2_9DiskStatsENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth13getHealthInfoEPNS2_10HealthInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6health19IHealthInfoCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::health::IHealthInfoCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6health19IHealthInfoCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6health7IHealthE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::health::IHealth>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEEE",
   "size" : 40,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6health7IHealthE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth16registerCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth18unregisterCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getChargeCounterUahEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth22getCurrentNowMicroampsEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth26getCurrentAverageMicroampsEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth11getCapacityEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getEnergyCounterNwhEPl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth15getChargeStatusEPNS2_13BatteryStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth14getStorageInfoEPNSt3__16vectorINS2_11StorageInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth12getDiskStatsEPNSt3__16vectorINS2_9DiskStatsENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth13getHealthInfoEPNS2_10HealthInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 32,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "chargerAcOnline",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "chargerUsbOnline",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "chargerWirelessOnline",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "chargerDockOnline",
     "field_offset" : 24,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "maxChargingCurrentMicroamps",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxChargingVoltageMicrovolts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryStatus",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware6health13BatteryStatusE"
    },
    {
     "field_name" : "batteryHealth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware6health13BatteryHealthE"
    },
    {
     "field_name" : "batteryPresent",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "batteryLevel",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryVoltageMillivolts",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryTemperatureTenthsCelsius",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryCurrentMicroamps",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryCycleCount",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryFullChargeUah",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryChargeCounterUah",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "batteryTechnology",
     "field_offset" : 448,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "batteryCurrentAverageMicroamps",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "diskStats",
     "field_offset" : 704,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6health9DiskStatsENS_9allocatorIS5_EEEE"
    },
    {
     "field_name" : "storageInfos",
     "field_offset" : 896,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware6health11StorageInfoENS_9allocatorIS5_EEEE"
    },
    {
     "field_name" : "batteryCapacityLevel",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIN4aidl7android8hardware6health20BatteryCapacityLevelE"
    },
    {
     "field_name" : "batteryChargeTimeToFullNowSeconds",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "batteryFullChargeDesignCapacityUah",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health10HealthInfoE",
   "name" : "aidl::android::hardware::health::HealthInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health10HealthInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware6health10HealthInfoE",
   "size" : 160,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/HealthInfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "eol",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lifetimeA",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lifetimeB",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "version",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health11StorageInfoE",
   "name" : "aidl::android::hardware::health::StorageInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health11StorageInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware6health11StorageInfoE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/StorageInfo.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6health7IHealthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health14IHealthDefaultE",
   "name" : "aidl::android::hardware::health::IHealthDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health14IHealthDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware6health14IHealthDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/IHealth.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health14IHealthDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault16registerCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault18unregisterCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault6updateEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault19getChargeCounterUahEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault22getCurrentNowMicroampsEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault26getCurrentAverageMicroampsEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault11getCapacityEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault19getEnergyCounterNwhEPl"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault15getChargeStatusEPNS2_13BatteryStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault14getStorageInfoEPNSt3__16vectorINS2_11StorageInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault12getDiskStatsEPNSt3__16vectorINS2_9DiskStatsENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault13getHealthInfoEPNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health14IHealthDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6health8BnHealthE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware6health7IHealthEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health16IHealthDelegatorE",
   "name" : "aidl::android::hardware::health::IHealthDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health16IHealthDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware6health16IHealthDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/BnHealth.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health16IHealthDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator16registerCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator18unregisterCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator6updateEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator19getChargeCounterUahEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator22getCurrentNowMicroampsEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator26getCurrentAverageMicroampsEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator11getCapacityEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator19getEnergyCounterNwhEPl"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator15getChargeStatusEPNS2_13BatteryStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator14getStorageInfoEPNSt3__16vectorINS2_11StorageInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator12getDiskStatsEPNSt3__16vectorINS2_9DiskStatsENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health16IHealthDelegator13getHealthInfoEPNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BnHealth19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BnHealth16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BnHealth12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health19IHealthInfoCallbackE",
   "name" : "aidl::android::hardware::health::IHealthInfoCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health19IHealthInfoCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware6health19IHealthInfoCallbackE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/IHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health19IHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health20BnHealthInfoCallbackE",
   "name" : "aidl::android::hardware::health::BnHealthInfoCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health20BnHealthInfoCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware6health20BnHealthInfoCallbackE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/BnHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health20BnHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BnHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BnHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health19IHealthInfoCallback17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BnHealthInfoCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BnHealthInfoCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BnHealthInfoCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health20BpHealthInfoCallbackE",
   "name" : "aidl::android::hardware::health::BpHealthInfoCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health20BpHealthInfoCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware6health20BpHealthInfoCallbackE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/BpHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health20BpHealthInfoCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BpHealthInfoCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BpHealthInfoCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BpHealthInfoCallback17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BpHealthInfoCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BpHealthInfoCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6health19IHealthInfoCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health26IHealthInfoCallbackDefaultE",
   "name" : "aidl::android::hardware::health::IHealthInfoCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health26IHealthInfoCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware6health26IHealthInfoCallbackDefaultE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/IHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health26IHealthInfoCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health26IHealthInfoCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health26IHealthInfoCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health26IHealthInfoCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health26IHealthInfoCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health26IHealthInfoCallbackDefault17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health26IHealthInfoCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health26IHealthInfoCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware6health20BnHealthInfoCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 640,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware6health19IHealthInfoCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health28IHealthInfoCallbackDelegatorE",
   "name" : "aidl::android::hardware::health::IHealthInfoCallbackDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health28IHealthInfoCallbackDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware6health28IHealthInfoCallbackDelegatorE",
   "size" : 96,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/BnHealthInfoCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health28IHealthInfoCallbackDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health28IHealthInfoCallbackDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health28IHealthInfoCallbackDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health19IHealthInfoCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health28IHealthInfoCallbackDelegator17healthInfoChangedERKNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BnHealthInfoCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BnHealthInfoCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health20BnHealthInfoCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health7IHealthE",
   "name" : "aidl::android::hardware::health::IHealth",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health7IHealthE",
   "self_type" : "_ZTIN4aidl7android8hardware6health7IHealthE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/IHealth.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health7IHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealthD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth16registerCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth18unregisterCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getChargeCounterUahEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth22getCurrentNowMicroampsEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth26getCurrentAverageMicroampsEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth11getCapacityEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getEnergyCounterNwhEPl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth15getChargeStatusEPNS2_13BatteryStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth14getStorageInfoEPNSt3__16vectorINS2_11StorageInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth12getDiskStatsEPNSt3__16vectorINS2_9DiskStatsENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth13getHealthInfoEPNS2_10HealthInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health8BnHealthE",
   "name" : "aidl::android::hardware::health::BnHealth",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health8BnHealthE",
   "self_type" : "_ZTIN4aidl7android8hardware6health8BnHealthE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/BnHealth.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health8BnHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BnHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BnHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware6health7IHealthEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth16registerCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth18unregisterCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth6updateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getChargeCounterUahEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth22getCurrentNowMicroampsEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth26getCurrentAverageMicroampsEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth11getCapacityEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth19getEnergyCounterNwhEPl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth15getChargeStatusEPNS2_13BatteryStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth14getStorageInfoEPNSt3__16vectorINS2_11StorageInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth12getDiskStatsEPNSt3__16vectorINS2_9DiskStatsENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware6health7IHealth13getHealthInfoEPNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BnHealth19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BnHealth16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BnHealth12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health8BpHealthE",
   "name" : "aidl::android::hardware::health::BpHealth",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health8BpHealthE",
   "self_type" : "_ZTIN4aidl7android8hardware6health8BpHealthE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/BpHealth.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware6health8BpHealthE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealthD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware6health7IHealthEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth16registerCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth18unregisterCallbackERKNSt3__110shared_ptrINS2_19IHealthInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth6updateEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth19getChargeCounterUahEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth22getCurrentNowMicroampsEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth26getCurrentAverageMicroampsEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth11getCapacityEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth19getEnergyCounterNwhEPl"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth15getChargeStatusEPNS2_13BatteryStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth14getStorageInfoEPNSt3__16vectorINS2_11StorageInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth12getDiskStatsEPNSt3__16vectorINS2_9DiskStatsENS4_9allocatorIS6_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth13getHealthInfoEPNS2_10HealthInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware6health8BpHealth16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reads",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "readMerges",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "readSectors",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "readTicks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "writes",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "writeMerges",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "writeSectors",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "writeTicks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ioInFlight",
     "field_offset" : 512,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ioTicks",
     "field_offset" : 576,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ioInQueue",
     "field_offset" : 640,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware6health9DiskStatsE",
   "name" : "aidl::android::hardware::health::DiskStats",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware6health9DiskStatsE",
   "self_type" : "_ZTIN4aidl7android8hardware6health9DiskStatsE",
   "size" : 88,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/health/aidl/android.hardware.health-V1-ndk-source/gen/include/aidl/android/hardware/health/DiskStats.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6health11StorageInfoENS3_9allocatorIS9_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::health::StorageInfo, std::allocator<aidl::android::hardware::health::StorageInfo>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6health11StorageInfoENS3_9allocatorIS9_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6health11StorageInfoENS3_9allocatorIS9_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware6health11StorageInfoENS_9allocatorIS5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6health9DiskStatsENS3_9allocatorIS9_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::health::DiskStats, std::allocator<aidl::android::hardware::health::DiskStats>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6health9DiskStatsENS3_9allocatorIS9_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware6health9DiskStatsENS3_9allocatorIS9_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware6health9DiskStatsENS_9allocatorIS5_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6health11StorageInfoEEE",
   "name" : "android::internal::details::IsPointerLike<aidl::android::hardware::health::StorageInfo>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6health11StorageInfoEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6health11StorageInfoEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6health11StorageInfoE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6health13BatteryHealthEEE",
   "name" : "android::internal::details::IsPointerLike<aidl::android::hardware::health::BatteryHealth>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6health13BatteryHealthEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6health13BatteryHealthEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware6health13BatteryHealthE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware6health13BatteryStatusEEE",
