{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  }
 ],
 "elf_functions" :
 [
  {
   "binding" : "weak",
   "name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8asBinderEv"
  },
  {

   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIxNS_9allocatorIxEEEEEE",
   "name" : "const std::optional<std::vector<long long, std::allocator<long long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIxNS_9allocatorIxEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIxNS_9allocatorIxEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long long, std::allocator<unsigned long long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/IHostapdCallback.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::wifi::hostapd::IHostapdCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback23onApInstanceInfoChangedERKNS3_6ApInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback25onConnectedClientsChangedERKNS3_10ClientInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback9onFailureERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd8IHostapdE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::wifi::hostapd::IHostapd>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4wifi7hostapd8IHostapdE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd14addAccessPointERKNS3_11IfaceParamsERKNS3_13NetworkParamsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd21forceClientDisconnectERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEERKNS5_6vectorIhNS9_IhEEEENS3_19Ieee80211ReasonCodeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd16registerCallbackERKNSt3__110shared_ptrINS3_16IHostapdCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd17removeAccessPointERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd14setDebugParamsENS3_10DebugLevelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd9terminateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::wifi::hostapd::IHostapdCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback23onApInstanceInfoChangedERKNS3_6ApInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback25onConnectedClientsChangedERKNS3_10ClientInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback9onFailureERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd8IHostapdE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::wifi::hostapd::IHostapd>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4wifi7hostapd8IHostapdE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd14addAccessPointERKNS3_11IfaceParamsERKNS3_13NetworkParamsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd21forceClientDisconnectERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEERKNS5_6vectorIhNS9_IhEEEENS3_19Ieee80211ReasonCodeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd16registerCallbackERKNSt3__110shared_ptrINS3_16IHostapdCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd17removeAccessPointERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd14setDebugParamsENS3_10DebugLevelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd9terminateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifaceName",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "apIfaceInstance",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "clientAddress",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "isConnected",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd10ClientInfoE",
   "name" : "aidl::android::hardware::wifi::hostapd::ClientInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd10ClientInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd10ClientInfoE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/ClientInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "hwModeParams",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd12HwModeParamsE"
    },
    {
     "field_name" : "channelParams",
     "field_offset" : 224,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware4wifi7hostapd13ChannelParamsENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd11IfaceParamsE",
   "name" : "aidl::android::hardware::wifi::hostapd::IfaceParams",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd11IfaceParamsE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd11IfaceParamsE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/IfaceParams.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "enable80211N",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "enable80211AC",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "enable80211AX",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "enable6GhzBand",
     "field_offset" : 24,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "enableHeSingleUserBeamformer",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "enableHeSingleUserBeamformee",
     "field_offset" : 40,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "enableHeMultiUserBeamformer",
     "field_offset" : 48,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "enableHeTargetWakeTime",
     "field_offset" : 56,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "enableEdmg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "enable80211BE",
     "field_offset" : 72,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "maximumChannelBandwidth",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd16ChannelBandwidthE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd12HwModeParamsE",
   "name" : "aidl::android::hardware::wifi::hostapd::HwModeParams",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd12HwModeParamsE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd12HwModeParamsE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/HwModeParams.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bandMask",
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd8BandMaskE"
    },
    {
     "field_name" : "acsChannelFreqRangesMhz",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware4wifi7hostapd14FrequencyRangeENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "enableAcs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "acsShouldExcludeDfs",
     "field_offset" : 136,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "channel",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd13ChannelParamsE",
   "name" : "aidl::android::hardware::wifi::hostapd::ChannelParams",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd13ChannelParamsE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd13ChannelParamsE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/ChannelParams.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ssid",
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "isHidden",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "encryptionType",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd14EncryptionTypeE"
    },
    {
     "field_name" : "passphrase",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "isMetered",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "vendorElements",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd13NetworkParamsE",
   "name" : "aidl::android::hardware::wifi::hostapd::NetworkParams",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd13NetworkParamsE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd13NetworkParamsE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/NetworkParams.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "startMhz",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "endMhz",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd14FrequencyRangeE",
   "name" : "aidl::android::hardware::wifi::hostapd::FrequencyRange",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd14FrequencyRangeE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd14FrequencyRangeE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/FrequencyRange.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd8IHostapdE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd15IHostapdDefaultE",
   "name" : "aidl::android::hardware::wifi::hostapd::IHostapdDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd15IHostapdDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd15IHostapdDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/IHostapd.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd15IHostapdDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault14addAccessPointERKNS3_11IfaceParamsERKNS3_13NetworkParamsE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault21forceClientDisconnectERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEERKNS5_6vectorIhNS9_IhEEEENS3_19Ieee80211ReasonCodeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault16registerCallbackERKNSt3__110shared_ptrINS3_16IHostapdCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault17removeAccessPointERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault14setDebugParamsENS3_10DebugLevelE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault9terminateEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd15IHostapdDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackE",
   "name" : "aidl::android::hardware::wifi::hostapd::IHostapdCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/IHostapdCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback23onApInstanceInfoChangedERKNS3_6ApInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback25onConnectedClientsChangedERKNS3_10ClientInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback9onFailureERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd17BnHostapdCallbackE",
   "name" : "aidl::android::hardware::wifi::hostapd::BnHostapdCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd17BnHostapdCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd17BnHostapdCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/BnHostapdCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd17BnHostapdCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BnHostapdCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BnHostapdCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback23onApInstanceInfoChangedERKNS3_6ApInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback25onConnectedClientsChangedERKNS3_10ClientInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd16IHostapdCallback9onFailureERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BnHostapdCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BnHostapdCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BnHostapdCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd17BpHostapdCallbackE",
   "name" : "aidl::android::hardware::wifi::hostapd::BpHostapdCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd17BpHostapdCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd17BpHostapdCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/BpHostapdCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd17BpHostapdCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BpHostapdCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BpHostapdCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BpHostapdCallback23onApInstanceInfoChangedERKNS3_6ApInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BpHostapdCallback25onConnectedClientsChangedERKNS3_10ClientInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BpHostapdCallback9onFailureERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BpHostapdCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BpHostapdCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd9BnHostapdE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd17IHostapdDelegatorE",
   "name" : "aidl::android::hardware::wifi::hostapd::IHostapdDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd17IHostapdDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd17IHostapdDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/BnHostapd.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd17IHostapdDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17IHostapdDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17IHostapdDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17IHostapdDelegator14addAccessPointERKNS3_11IfaceParamsERKNS3_13NetworkParamsE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17IHostapdDelegator21forceClientDisconnectERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEERKNS5_6vectorIhNS9_IhEEEENS3_19Ieee80211ReasonCodeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17IHostapdDelegator16registerCallbackERKNSt3__110shared_ptrINS3_16IHostapdCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17IHostapdDelegator17removeAccessPointERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17IHostapdDelegator14setDebugParamsENS3_10DebugLevelE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17IHostapdDelegator9terminateEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BnHostapd19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BnHostapd16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BnHostapd12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefaultE",
   "name" : "aidl::android::hardware::wifi::hostapd::IHostapdCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/IHostapdCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefault23onApInstanceInfoChangedERKNS3_6ApInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefault25onConnectedClientsChangedERKNS3_10ClientInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefault9onFailureERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd23IHostapdCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd17BnHostapdCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd25IHostapdCallbackDelegatorE",
   "name" : "aidl::android::hardware::wifi::hostapd::IHostapdCallbackDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd25IHostapdCallbackDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd25IHostapdCallbackDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/BnHostapdCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd25IHostapdCallbackDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd25IHostapdCallbackDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd25IHostapdCallbackDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd16IHostapdCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd25IHostapdCallbackDelegator23onApInstanceInfoChangedERKNS3_6ApInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd25IHostapdCallbackDelegator25onConnectedClientsChangedERKNS3_10ClientInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd25IHostapdCallbackDelegator9onFailureERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEESD_"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BnHostapdCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BnHostapdCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd17BnHostapdCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifaceName",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "apIfaceInstance",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "freqMhz",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelBandwidth",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd16ChannelBandwidthE"
    },
    {
     "field_name" : "generation",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd10GenerationE"
    },
    {
     "field_name" : "apIfaceInstanceMacAddress",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd6ApInfoE",
   "name" : "aidl::android::hardware::wifi::hostapd::ApInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd6ApInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd6ApInfoE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/ApInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd8IHostapdE",
   "name" : "aidl::android::hardware::wifi::hostapd::IHostapd",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd8IHostapdE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd8IHostapdE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/IHostapd.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd8IHostapdE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapdD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapdD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd14addAccessPointERKNS3_11IfaceParamsERKNS3_13NetworkParamsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd21forceClientDisconnectERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEERKNS5_6vectorIhNS9_IhEEEENS3_19Ieee80211ReasonCodeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd16registerCallbackERKNSt3__110shared_ptrINS3_16IHostapdCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd17removeAccessPointERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd14setDebugParamsENS3_10DebugLevelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd9terminateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd9BnHostapdE",
   "name" : "aidl::android::hardware::wifi::hostapd::BnHostapd",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd9BnHostapdE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd9BnHostapdE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/BnHostapd.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd9BnHostapdE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BnHostapdD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BnHostapdD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd14addAccessPointERKNS3_11IfaceParamsERKNS3_13NetworkParamsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd21forceClientDisconnectERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEERKNS5_6vectorIhNS9_IhEEEENS3_19Ieee80211ReasonCodeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd16registerCallbackERKNSt3__110shared_ptrINS3_16IHostapdCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd17removeAccessPointERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd14setDebugParamsENS3_10DebugLevelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd8IHostapd9terminateEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BnHostapd19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BnHostapd16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BnHostapd12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4wifi7hostapd9BpHostapdE",
   "name" : "aidl::android::hardware::wifi::hostapd::BpHostapd",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd9BpHostapdE",
   "self_type" : "_ZTIN4aidl7android8hardware4wifi7hostapd9BpHostapdE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/wifi/hostapd/aidl/android.hardware.wifi.hostapd-V1-ndk-source/gen/include/aidl/android/hardware/wifi/hostapd/BpHostapd.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4wifi7hostapd9BpHostapdE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapdD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapdD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4wifi7hostapd8IHostapdEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapd14addAccessPointERKNS3_11IfaceParamsERKNS3_13NetworkParamsE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapd21forceClientDisconnectERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEERKNS5_6vectorIhNS9_IhEEEENS3_19Ieee80211ReasonCodeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapd16registerCallbackERKNSt3__110shared_ptrINS3_16IHostapdCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapd17removeAccessPointERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapd14setDebugParamsENS3_10DebugLevelE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapd9terminateEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapd19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4wifi7hostapd9BpHostapd16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4wifi7hostapd13ChannelParamsENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::hardware::wifi::hostapd::ChannelParams, std::allocator<aidl::android::hardware::wifi::hostapd::ChannelParams>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4wifi7hostapd13ChannelParamsENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4wifi7hostapd13ChannelParamsENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android8hardware4wifi7hostapd13ChannelParamsENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android8hardware4wifi7hostapd14FrequencyRangeENS3_9allocatorISA_EEEEEE",
