{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",

   "name" : "const std::optional<std::vector<unsigned long long, std::allocator<unsigned long long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IAGnssCallback.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebugE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssDebug>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss10IGnssDebugE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug12getDebugDataEPNS3_9DebugDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssBatchingE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssBatching>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss13IGnssBatchingE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching4initERKNSt3__110shared_ptrINS2_21IGnssBatchingCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching12getBatchSizeEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching5startERKNS3_7OptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching7cleanupEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback12gnssStatusCbENS3_15GnssStatusValueE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback14gnssSvStatusCbERKNSt3__16vectorINS3_10GnssSvInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback14gnssLocationCbERKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback10gnssNmeaCbExRKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssAcquireWakelockCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssReleaseWakelockCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19gnssSetSystemInfoCbERKNS3_14GnssSystemInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback17gnssRequestTimeCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssRequestLocationCbEbb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssGeofenceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssGeofence>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss13IGnssGeofenceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence11setCallbackERKNSt3__110shared_ptrINS2_21IGnssGeofenceCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence11addGeofenceEidddiiii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence13pauseGeofenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence14resumeGeofenceEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence14removeGeofenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14IAGnssCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IAGnssCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss14IAGnssCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback13agnssStatusCbENS3_9AGnssTypeENS3_16AGnssStatusValueE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss16IGnssAntennaInfoE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssAntennaInfo>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss16IGnssAntennaInfoE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo11setCallbackERKNSt3__110shared_ptrINS2_24IGnssAntennaInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IAGnssRilCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IAGnssRilCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss17IAGnssRilCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback14requestSetIdCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback15requestRefLocCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssPsdsCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssConfiguration>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration14setSuplVersionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration11setSuplModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration13setLppProfileEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration29setGlonassPositioningProtocolEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19setEmergencySuplPdnEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration17setEsExtensionSecEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration12setBlocklistERKNSt3__16vectorINS2_17BlocklistedSourceENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::visibility_control::IGnssVisibilityControl>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControl23enableNfwLocationAccessERKNSt3__16vectorINS5_12basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENSA_ISC_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControl11setCallbackERKNSt3__110shared_ptrINS3_30IGnssVisibilityControlCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControl19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControl16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::visibility_control::IGnssVisibilityControlCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallback11nfwNotifyCbERKNS4_15NfwNotificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallback20isInEmergencySessionEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssPowerIndication>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication11setCallbackERKNSt3__110shared_ptrINS2_28IGnssPowerIndicationCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication21requestGnssPowerStatsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21IGnssBatchingCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssBatchingCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss21IGnssBatchingCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssBatchingCallback19gnssLocationBatchCbERKNSt3__16vectorINS2_12GnssLocationENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssBatchingCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssBatchingCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssGeofenceCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback24gnssGeofenceTransitionCbEiRKNS2_12GnssLocationEix"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback20gnssGeofenceStatusCbEiRKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback17gnssGeofenceAddCbEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback20gnssGeofenceRemoveCbEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback19gnssGeofencePauseCbEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback20gnssGeofenceResumeCbEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::measurement_corrections::IMeasurementCorrectionsCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallback17setCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::measurement_corrections::IMeasurementCorrectionsInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterface14setCorrectionsERKNS3_22MeasurementCorrectionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterface11setCallbackERKNSt3__110shared_ptrINS3_31IMeasurementCorrectionsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterface19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterface16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssAntennaInfoCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssAntennaInfoCallback17gnssAntennaInfoCbERKNSt3__16vectorINS3_15GnssAntennaInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssAntennaInfoCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssAntennaInfoCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssMeasurementCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback17gnssMeasurementCbERKNS2_8GnssDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssMeasurementInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface11setCallbackERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEEbb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface22setCallbackWithOptionsERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEERKNS3_7OptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssPowerIndicationCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback17setCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16gnssPowerStatsCbERKNS2_14GnssPowerStatsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssNavigationMessageCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss30IGnssNavigationMessageCallback23gnssNavigationMessageCbERKNS3_21GnssNavigationMessageE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss30IGnssNavigationMessageCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss30IGnssNavigationMessageCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssNavigationMessageInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssNavigationMessageInterface11setCallbackERKNSt3__110shared_ptrINS2_30IGnssNavigationMessageCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssNavigationMessageInterface5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssNavigationMessageInterface19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssNavigationMessageInterface16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss5IGnssE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnss>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss5IGnssE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss24getExtensionGnssBatchingEPNSt3__110shared_ptrINS2_13IGnssBatchingEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss24getExtensionGnssGeofenceEPNSt3__110shared_ptrINS2_13IGnssGeofenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss33getExtensionGnssNavigationMessageEPNSt3__110shared_ptrINS2_31IGnssNavigationMessageInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss17getExtensionAGnssEPNSt3__110shared_ptrINS2_6IAGnssEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss20getExtensionAGnssRilEPNSt3__110shared_ptrINS2_9IAGnssRilEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss21getExtensionGnssDebugEPNSt3__110shared_ptrINS2_10IGnssDebugEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss33getExtensionGnssVisibilityControlEPNSt3__110shared_ptrINS2_18visibility_control22IGnssVisibilityControlEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss5startEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss10injectTimeExxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss14injectLocationERKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss18injectBestLocationERKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16deleteAidingDataENS3_14GnssAidingDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss15setPositionModeERKNS3_19PositionModeOptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss27getExtensionGnssAntennaInfoEPNSt3__110shared_ptrINS2_16IGnssAntennaInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss34getExtensionMeasurementCorrectionsEPNSt3__110shared_ptrINS2_23measurement_corrections32IMeasurementCorrectionsInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss13startSvStatusEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss12stopSvStatusEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss9startNmeaEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss8stopNmeaEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss6IAGnssE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IAGnss>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss6IAGnssE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss11setCallbackERKNSt3__110shared_ptrINS2_14IAGnssCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss14dataConnClosedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss14dataConnFailedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss9setServerENS2_14IAGnssCallback9AGnssTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss12dataConnOpenExRKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEENS3_9ApnIpTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IAGnssRilE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IAGnssRil>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss9IAGnssRilE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil11setCallbackERKNSt3__110shared_ptrINS2_17IAGnssRilCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil14setRefLocationERKNS3_16AGnssRefLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil8setSetIdENS3_9SetIdTypeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil18updateNetworkStateERKNS3_17NetworkAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::gnss::IGnssPsds>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebugE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssDebug>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss10IGnssDebugE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug12getDebugDataEPNS3_9DebugDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssBatchingE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssBatching>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss13IGnssBatchingE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching4initERKNSt3__110shared_ptrINS2_21IGnssBatchingCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching12getBatchSizeEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching5startERKNS3_7OptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching7cleanupEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback12gnssStatusCbENS3_15GnssStatusValueE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback14gnssSvStatusCbERKNSt3__16vectorINS3_10GnssSvInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback14gnssLocationCbERKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback10gnssNmeaCbExRKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssAcquireWakelockCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssReleaseWakelockCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19gnssSetSystemInfoCbERKNS3_14GnssSystemInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback17gnssRequestTimeCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssRequestLocationCbEbb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssGeofenceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssGeofence>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss13IGnssGeofenceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence11setCallbackERKNSt3__110shared_ptrINS2_21IGnssGeofenceCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence11addGeofenceEidddiiii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence13pauseGeofenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence14resumeGeofenceEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence14removeGeofenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14IAGnssCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IAGnssCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss14IAGnssCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback13agnssStatusCbENS3_9AGnssTypeENS3_16AGnssStatusValueE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss16IGnssAntennaInfoE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssAntennaInfo>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss16IGnssAntennaInfoE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo11setCallbackERKNSt3__110shared_ptrINS2_24IGnssAntennaInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IAGnssRilCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IAGnssRilCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss17IAGnssRilCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback14requestSetIdCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback15requestRefLocCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssPsdsCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssConfiguration>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18IGnssConfigurationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration14setSuplVersionEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration11setSuplModeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration13setLppProfileEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration29setGlonassPositioningProtocolEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19setEmergencySuplPdnEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration17setEsExtensionSecEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration12setBlocklistERKNSt3__16vectorINS2_17BlocklistedSourceENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::visibility_control::IGnssVisibilityControl>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControlEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControl23enableNfwLocationAccessERKNSt3__16vectorINS5_12basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEENSA_ISC_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControl11setCallbackERKNSt3__110shared_ptrINS3_30IGnssVisibilityControlCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControl19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control22IGnssVisibilityControl16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::visibility_control::IGnssVisibilityControlCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallback11nfwNotifyCbERKNS4_15NfwNotificationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallback20isInEmergencySessionEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18visibility_control30IGnssVisibilityControlCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssPowerIndication>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss20IGnssPowerIndicationE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss20IGnssPowerIndicationEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication11setCallbackERKNSt3__110shared_ptrINS2_28IGnssPowerIndicationCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication21requestGnssPowerStatsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss20IGnssPowerIndication16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21IGnssBatchingCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssBatchingCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss21IGnssBatchingCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssBatchingCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssBatchingCallback19gnssLocationBatchCbERKNSt3__16vectorINS2_12GnssLocationENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssBatchingCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssBatchingCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssGeofenceCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss21IGnssGeofenceCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback24gnssGeofenceTransitionCbEiRKNS2_12GnssLocationEix"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback20gnssGeofenceStatusCbEiRKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback17gnssGeofenceAddCbEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback20gnssGeofenceRemoveCbEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback19gnssGeofencePauseCbEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback20gnssGeofenceResumeCbEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss21IGnssGeofenceCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::measurement_corrections::IMeasurementCorrectionsCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallback17setCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections31IMeasurementCorrectionsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::measurement_corrections::IMeasurementCorrectionsInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterfaceEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterface14setCorrectionsERKNS3_22MeasurementCorrectionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterface11setCallbackERKNSt3__110shared_ptrINS3_31IMeasurementCorrectionsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterface19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss23measurement_corrections32IMeasurementCorrectionsInterface16getInterfaceHashEPNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssAntennaInfoCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssAntennaInfoCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssAntennaInfoCallback17gnssAntennaInfoCbERKNSt3__16vectorINS3_15GnssAntennaInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssAntennaInfoCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssAntennaInfoCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssMeasurementCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss24IGnssMeasurementCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback17gnssMeasurementCbERKNS2_8GnssDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss24IGnssMeasurementCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssMeasurementInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss25IGnssMeasurementInterfaceEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface11setCallbackERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEEbb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface22setCallbackWithOptionsERKNSt3__110shared_ptrINS2_24IGnssMeasurementCallbackEEERKNS3_7OptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss25IGnssMeasurementInterface16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssPowerIndicationCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss28IGnssPowerIndicationCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback17setCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16gnssPowerStatsCbERKNS2_14GnssPowerStatsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss28IGnssPowerIndicationCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssNavigationMessageCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss30IGnssNavigationMessageCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss30IGnssNavigationMessageCallback23gnssNavigationMessageCbERKNS3_21GnssNavigationMessageE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss30IGnssNavigationMessageCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss30IGnssNavigationMessageCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssNavigationMessageInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss31IGnssNavigationMessageInterfaceEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssNavigationMessageInterface11setCallbackERKNSt3__110shared_ptrINS2_30IGnssNavigationMessageCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssNavigationMessageInterface5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssNavigationMessageInterface19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss31IGnssNavigationMessageInterface16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss5IGnssE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnss>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss5IGnssE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss5IGnssEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss24getExtensionGnssBatchingEPNSt3__110shared_ptrINS2_13IGnssBatchingEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss24getExtensionGnssGeofenceEPNSt3__110shared_ptrINS2_13IGnssGeofenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss33getExtensionGnssNavigationMessageEPNSt3__110shared_ptrINS2_31IGnssNavigationMessageInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss17getExtensionAGnssEPNSt3__110shared_ptrINS2_6IAGnssEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss20getExtensionAGnssRilEPNSt3__110shared_ptrINS2_9IAGnssRilEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss21getExtensionGnssDebugEPNSt3__110shared_ptrINS2_10IGnssDebugEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss33getExtensionGnssVisibilityControlEPNSt3__110shared_ptrINS2_18visibility_control22IGnssVisibilityControlEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss5startEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss10injectTimeExxi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss14injectLocationERKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss18injectBestLocationERKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16deleteAidingDataENS3_14GnssAidingDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss15setPositionModeERKNS3_19PositionModeOptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss27getExtensionGnssAntennaInfoEPNSt3__110shared_ptrINS2_16IGnssAntennaInfoEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss34getExtensionMeasurementCorrectionsEPNSt3__110shared_ptrINS2_23measurement_corrections32IMeasurementCorrectionsInterfaceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss13startSvStatusEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss12stopSvStatusEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss9startNmeaEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss8stopNmeaEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss5IGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss6IAGnssE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss6IAGnssEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IAGnss>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss6IAGnssEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss6IAGnssEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss6IAGnssE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss6IAGnssEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss6IAGnssEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss6IAGnssEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss6IAGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss6IAGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss6IAGnssEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss11setCallbackERKNSt3__110shared_ptrINS2_14IAGnssCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss14dataConnClosedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss14dataConnFailedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss9setServerENS2_14IAGnssCallback9AGnssTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss12dataConnOpenExRKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEENS3_9ApnIpTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6IAGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IAGnssRilE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IAGnssRil>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss9IAGnssRilE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil11setCallbackERKNSt3__110shared_ptrINS2_17IAGnssRilCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil14setRefLocationERKNS3_16AGnssRefLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil8setSetIdENS3_9SetIdTypeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil18updateNetworkStateERKNS3_17NetworkAttributesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::gnss::IGnssPsds>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10BnAGnssRilE",
   "name" : "aidl::android::hardware::gnss::BnAGnssRil",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10BnAGnssRilE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10BnAGnssRilE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnAGnssRil.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss10BnAGnssRilE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnAGnssRilD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnAGnssRilD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil11setCallbackERKNSt3__110shared_ptrINS2_17IAGnssRilCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil14setRefLocationERKNS3_16AGnssRefLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil8setSetIdENS3_9SetIdTypeERKNSt3__112basic_stringIcNS5_11char_traitsIcEENS5_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IAGnssRil18updateNetworkStateERKNS3_17NetworkAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnAGnssRil19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnAGnssRil16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnAGnssRil12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10BnGnssPsdsE",
   "name" : "aidl::android::hardware::gnss::BnGnssPsds",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10BnGnssPsdsE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10BnGnssPsdsE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnGnssPsds.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss10BnGnssPsdsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsdsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsdsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss9IGnssPsds11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsds19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsds16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnGnssPsds12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10BpAGnssRilE",
   "name" : "aidl::android::hardware::gnss::BpAGnssRil",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10BpAGnssRilE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10BpAGnssRilE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpAGnssRil.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss10BpAGnssRilE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpAGnssRilD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpAGnssRilD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpAGnssRil11setCallbackERKNSt3__110shared_ptrINS2_17IAGnssRilCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpAGnssRil14setRefLocationERKNS2_9IAGnssRil16AGnssRefLocationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpAGnssRil8setSetIdENS2_9IAGnssRil9SetIdTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpAGnssRil18updateNetworkStateERKNS2_9IAGnssRil17NetworkAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpAGnssRil19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpAGnssRil16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10BpGnssPsdsE",
   "name" : "aidl::android::hardware::gnss::BpGnssPsds",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10BpGnssPsdsE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10BpGnssPsdsE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpGnssPsds.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss10BpGnssPsdsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsdsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsdsD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss9IGnssPsdsEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsds14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsds11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsds19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BpGnssPsds16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "valid",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "latitudeDegrees",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "longitudeDegrees",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "altitudeMeters",
     "field_offset" : 192,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "speedMetersPerSec",
     "field_offset" : 224,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "bearingDegrees",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "horizontalAccuracyMeters",
     "field_offset" : 320,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "verticalAccuracyMeters",
     "field_offset" : 384,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "speedAccuracyMetersPerSecond",
     "field_offset" : 448,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "bearingAccuracyDegrees",
     "field_offset" : 512,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "ageSeconds",
     "field_offset" : 576,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug13PositionDebugE",
   "name" : "aidl::android::hardware::gnss::IGnssDebug::PositionDebug",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug13PositionDebugE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug13PositionDebugE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssDebug.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "svid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "constellation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21GnssConstellationTypeE"
    },
    {
     "field_name" : "ephemerisType",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug22SatelliteEphemerisTypeE"
    },
    {
     "field_name" : "ephemerisSource",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvt24SatelliteEphemerisSourceE"
    },
    {
     "field_name" : "ephemerisHealth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug24SatelliteEphemerisHealthE"
    },
    {
     "field_name" : "ephemerisAgeSeconds",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "serverPredictionIsAvailable",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "serverPredictionAgeSeconds",
     "field_offset" : 224,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug13SatelliteDataE",
   "name" : "aidl::android::hardware::gnss::IGnssDebug::SatelliteData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug13SatelliteDataE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug13SatelliteDataE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssDebug.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "position",
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug13PositionDebugE"
    },
    {
     "field_name" : "time",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug9TimeDebugE"
    },
    {
     "field_name" : "satelliteDataArray",
     "field_offset" : 768,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware4gnss10IGnssDebug13SatelliteDataENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug9DebugDataE",
   "name" : "aidl::android::hardware::gnss::IGnssDebug::DebugData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug9DebugDataE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug9DebugDataE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssDebug.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timeEstimateMs",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "timeUncertaintyNs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "frequencyUncertaintyNsPerSec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug9TimeDebugE",
   "name" : "aidl::android::hardware::gnss::IGnssDebug::TimeDebug",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug9TimeDebugE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebug9TimeDebugE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssDebug.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebugE",
   "name" : "aidl::android::hardware::gnss::IGnssDebug",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebugE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebugE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssDebug.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebugE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebugD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebugD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug12getDebugDataEPNS3_9DebugDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss11BnGnssDebugE",
   "name" : "aidl::android::hardware::gnss::BnGnssDebug",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss11BnGnssDebugE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss11BnGnssDebugE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnGnssDebug.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss11BnGnssDebugE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BnGnssDebugD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BnGnssDebugD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10IGnssDebug12getDebugDataEPNS3_9DebugDataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BnGnssDebug19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BnGnssDebug16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BnGnssDebug12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss11BpGnssDebugE",
   "name" : "aidl::android::hardware::gnss::BpGnssDebug",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss11BpGnssDebugE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss11BpGnssDebugE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpGnssDebug.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss11BpGnssDebugE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BpGnssDebugD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BpGnssDebugD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss10IGnssDebugEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BpGnssDebug12getDebugDataEPNS2_10IGnssDebug9DebugDataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BpGnssDebug19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss11BpGnssDebug16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "gnssLocationFlags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "latitudeDegrees",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "longitudeDegrees",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "altitudeMeters",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "speedMetersPerSec",
     "field_offset" : 256,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "bearingDegrees",
     "field_offset" : 320,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "horizontalAccuracyMeters",
     "field_offset" : 384,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "verticalAccuracyMeters",
     "field_offset" : 448,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "speedAccuracyMetersPerSecond",
     "field_offset" : 512,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "bearingAccuracyDegrees",
     "field_offset" : 576,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "timestampMillis",
     "field_offset" : 640,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "elapsedRealtime",
     "field_offset" : 704,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss12GnssLocationE",
   "name" : "aidl::android::hardware::gnss::GnssLocation",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12GnssLocationE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss12GnssLocationE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/GnssLocation.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss5IGnssE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss12IGnssDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12IGnssDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss12IGnssDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnss.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss12IGnssDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault24getExtensionGnssBatchingEPNSt3__110shared_ptrINS2_13IGnssBatchingEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault24getExtensionGnssGeofenceEPNSt3__110shared_ptrINS2_13IGnssGeofenceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault33getExtensionGnssNavigationMessageEPNSt3__110shared_ptrINS2_31IGnssNavigationMessageInterfaceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault17getExtensionAGnssEPNSt3__110shared_ptrINS2_6IAGnssEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault20getExtensionAGnssRilEPNSt3__110shared_ptrINS2_9IAGnssRilEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault21getExtensionGnssDebugEPNSt3__110shared_ptrINS2_10IGnssDebugEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault33getExtensionGnssVisibilityControlEPNSt3__110shared_ptrINS2_18visibility_control22IGnssVisibilityControlEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault5startEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault4stopEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault10injectTimeExxi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault14injectLocationERKNS2_12GnssLocationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault18injectBestLocationERKNS2_12GnssLocationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault16deleteAidingDataENS2_5IGnss14GnssAidingDataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault15setPositionModeERKNS2_5IGnss19PositionModeOptionsE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault27getExtensionGnssAntennaInfoEPNSt3__110shared_ptrINS2_16IGnssAntennaInfoEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault34getExtensionMeasurementCorrectionsEPNSt3__110shared_ptrINS2_23measurement_corrections32IMeasurementCorrectionsInterfaceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault13startSvStatusEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault12stopSvStatusEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault9startNmeaEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault8stopNmeaEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss12IGnssDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "satPosEcef",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatellitePositionEcefE"
    },
    {
     "field_name" : "satVelEcef",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21SatelliteVelocityEcefE"
    },
    {
     "field_name" : "satClockInfo",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18SatelliteClockInfoE"
    },
    {
     "field_name" : "ionoDelayMeters",
     "field_offset" : 768,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "tropoDelayMeters",
     "field_offset" : 832,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "timeOfClockSeconds",
     "field_offset" : 896,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "issueOfDataClock",
     "field_offset" : 960,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timeOfEphemerisSeconds",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "issueOfDataEphemeris",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ephemerisSource",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvt24SatelliteEphemerisSourceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE",
   "name" : "aidl::android::hardware::gnss::SatellitePvt",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE",
   "size" : 144,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/SatellitePvt.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss6IAGnssE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss13IAGnssDefaultE",
   "name" : "aidl::android::hardware::gnss::IAGnssDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IAGnssDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss13IAGnssDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IAGnss.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss13IAGnssDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefault11setCallbackERKNSt3__110shared_ptrINS2_14IAGnssCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefault14dataConnClosedEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefault14dataConnFailedEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefault9setServerENS2_14IAGnssCallback9AGnssTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefault12dataConnOpenExRKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEENS2_6IAGnss9ApnIpTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IAGnssDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "periodNanos",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "minDistanceMeters",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss13IGnssBatching7OptionsE",
   "name" : "aidl::android::hardware::gnss::IGnssBatching::Options",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssBatching7OptionsE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssBatching7OptionsE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssBatching.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss13IGnssBatchingE",
   "name" : "aidl::android::hardware::gnss::IGnssBatching",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssBatchingE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssBatchingE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssBatching.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss13IGnssBatchingE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatchingD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatchingD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching4initERKNSt3__110shared_ptrINS2_21IGnssBatchingCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching12getBatchSizeEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching5startERKNS3_7OptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching7cleanupEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "svid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "constellation",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21GnssConstellationTypeE"
    },
    {
     "field_name" : "cN0Dbhz",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "basebandCN0DbHz",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "elevationDegrees",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "azimuthDegrees",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "carrierFrequencyHz",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "svFlag",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallback10GnssSvInfoE",
   "name" : "aidl::android::hardware::gnss::IGnssCallback::GnssSvInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallback10GnssSvInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallback10GnssSvInfoE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssCallback.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "yearOfHw",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallback14GnssSystemInfoE",
   "name" : "aidl::android::hardware::gnss::IGnssCallback::GnssSystemInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallback14GnssSystemInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallback14GnssSystemInfoE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssCallback.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE",
   "name" : "aidl::android::hardware::gnss::IGnssCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss13IGnssCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback12gnssStatusCbENS3_15GnssStatusValueE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback14gnssSvStatusCbERKNSt3__16vectorINS3_10GnssSvInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback14gnssLocationCbERKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback10gnssNmeaCbExRKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssAcquireWakelockCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssReleaseWakelockCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19gnssSetSystemInfoCbERKNS3_14GnssSystemInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback17gnssRequestTimeCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssRequestLocationCbEbb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss13IGnssGeofenceE",
   "name" : "aidl::android::hardware::gnss::IGnssGeofence",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssGeofenceE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss13IGnssGeofenceE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssGeofence.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss13IGnssGeofenceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofenceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofenceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence11setCallbackERKNSt3__110shared_ptrINS2_21IGnssGeofenceCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence11addGeofenceEidddiiii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence13pauseGeofenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence14resumeGeofenceEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence14removeGeofenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14BnGnssBatchingE",
   "name" : "aidl::android::hardware::gnss::BnGnssBatching",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14BnGnssBatchingE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14BnGnssBatchingE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnGnssBatching.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14BnGnssBatchingE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssBatchingD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssBatchingD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching4initERKNSt3__110shared_ptrINS2_21IGnssBatchingCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching12getBatchSizeEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching5startERKNS3_7OptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssBatching7cleanupEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssBatching19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssBatching16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssBatching12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14BnGnssCallbackE",
   "name" : "aidl::android::hardware::gnss::BnGnssCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14BnGnssCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14BnGnssCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14BnGnssCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback12gnssStatusCbENS3_15GnssStatusValueE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback14gnssSvStatusCbERKNSt3__16vectorINS3_10GnssSvInfoENS4_9allocatorIS6_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback14gnssLocationCbERKNS2_12GnssLocationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback10gnssNmeaCbExRKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssAcquireWakelockCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssReleaseWakelockCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback19gnssSetSystemInfoCbERKNS3_14GnssSystemInfoE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback17gnssRequestTimeCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssCallback21gnssRequestLocationCbEbb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14BnGnssGeofenceE",
   "name" : "aidl::android::hardware::gnss::BnGnssGeofence",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14BnGnssGeofenceE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14BnGnssGeofenceE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnGnssGeofence.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14BnGnssGeofenceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssGeofenceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssGeofenceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence11setCallbackERKNSt3__110shared_ptrINS2_21IGnssGeofenceCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence11addGeofenceEidddiiii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence13pauseGeofenceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence14resumeGeofenceEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss13IGnssGeofence14removeGeofenceEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssGeofence19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssGeofence16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BnGnssGeofence12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14BpGnssBatchingE",
   "name" : "aidl::android::hardware::gnss::BpGnssBatching",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14BpGnssBatchingE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14BpGnssBatchingE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpGnssBatching.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14BpGnssBatchingE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatchingD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatchingD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssBatchingEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatching4initERKNSt3__110shared_ptrINS2_21IGnssBatchingCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatching12getBatchSizeEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatching5startERKNS2_13IGnssBatching7OptionsE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatching5flushEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatching4stopEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatching7cleanupEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatching19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssBatching16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14BpGnssCallbackE",
   "name" : "aidl::android::hardware::gnss::BpGnssCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14BpGnssCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14BpGnssCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14BpGnssCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback21gnssSetCapabilitiesCbEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback12gnssStatusCbENS2_13IGnssCallback15GnssStatusValueE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback14gnssSvStatusCbERKNSt3__16vectorINS2_13IGnssCallback10GnssSvInfoENS4_9allocatorIS7_EEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback14gnssLocationCbERKNS2_12GnssLocationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback10gnssNmeaCbExRKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback21gnssAcquireWakelockCbEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback21gnssReleaseWakelockCbEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback19gnssSetSystemInfoCbERKNS2_13IGnssCallback14GnssSystemInfoE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback17gnssRequestTimeCbEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback21gnssRequestLocationCbEbb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14BpGnssGeofenceE",
   "name" : "aidl::android::hardware::gnss::BpGnssGeofence",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14BpGnssGeofenceE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14BpGnssGeofenceE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpGnssGeofence.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14BpGnssGeofenceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssGeofenceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssGeofenceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss13IGnssGeofenceEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssGeofence11setCallbackERKNSt3__110shared_ptrINS2_21IGnssGeofenceCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssGeofence11addGeofenceEidddiiii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssGeofence13pauseGeofenceEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssGeofence14resumeGeofenceEii"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssGeofence14removeGeofenceEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssGeofence19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14BpGnssGeofence16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "elapsedRealtime",
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE"
    },
    {
     "field_name" : "totalEnergyMilliJoule",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "singlebandTrackingModeEnergyMilliJoule",
     "field_offset" : 256,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "multibandTrackingModeEnergyMilliJoule",
     "field_offset" : 320,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "singlebandAcquisitionModeEnergyMilliJoule",
     "field_offset" : 384,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "multibandAcquisitionModeEnergyMilliJoule",
     "field_offset" : 448,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "otherModesEnergyMilliJoule",
     "field_offset" : 512,
     "referenced_type" : "_ZTINSt3__16vectorIdNS_9allocatorIdEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14GnssPowerStatsE",
   "name" : "aidl::android::hardware::gnss::GnssPowerStats",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssPowerStatsE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14GnssPowerStatsE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/GnssPowerStats.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "constellation",
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21GnssConstellationTypeE"
    },
    {
     "field_name" : "carrierFrequencyHz",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "codeType",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE",
   "name" : "aidl::android::hardware::gnss::GnssSignalType",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/GnssSignalType.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14IAGnssCallbackE",
   "name" : "aidl::android::hardware::gnss::IAGnssCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14IAGnssCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14IAGnssCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IAGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14IAGnssCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback13agnssStatusCbENS3_9AGnssTypeENS3_16AGnssStatusValueE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss6BnGnssE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware4gnss5IGnssEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss14IGnssDelegatorE",
   "name" : "aidl::android::hardware::gnss::IGnssDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14IGnssDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss14IGnssDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnGnss.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss14IGnssDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss5IGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator11setCallbackERKNSt3__110shared_ptrINS2_13IGnssCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator16getExtensionPsdsEPNSt3__110shared_ptrINS2_9IGnssPsdsEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator29getExtensionGnssConfigurationEPNSt3__110shared_ptrINS2_18IGnssConfigurationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator27getExtensionGnssMeasurementEPNSt3__110shared_ptrINS2_25IGnssMeasurementInterfaceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator31getExtensionGnssPowerIndicationEPNSt3__110shared_ptrINS2_20IGnssPowerIndicationEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator24getExtensionGnssBatchingEPNSt3__110shared_ptrINS2_13IGnssBatchingEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator24getExtensionGnssGeofenceEPNSt3__110shared_ptrINS2_13IGnssGeofenceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator33getExtensionGnssNavigationMessageEPNSt3__110shared_ptrINS2_31IGnssNavigationMessageInterfaceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator17getExtensionAGnssEPNSt3__110shared_ptrINS2_6IAGnssEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator20getExtensionAGnssRilEPNSt3__110shared_ptrINS2_9IAGnssRilEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator21getExtensionGnssDebugEPNSt3__110shared_ptrINS2_10IGnssDebugEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator33getExtensionGnssVisibilityControlEPNSt3__110shared_ptrINS2_18visibility_control22IGnssVisibilityControlEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator5startEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator4stopEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator10injectTimeExxi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator14injectLocationERKNS2_12GnssLocationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator18injectBestLocationERKNS2_12GnssLocationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator16deleteAidingDataENS2_5IGnss14GnssAidingDataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator15setPositionModeERKNS2_5IGnss19PositionModeOptionsE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator27getExtensionGnssAntennaInfoEPNSt3__110shared_ptrINS2_16IGnssAntennaInfoEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator34getExtensionMeasurementCorrectionsEPNSt3__110shared_ptrINS2_23measurement_corrections32IMeasurementCorrectionsInterfaceEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator13startSvStatusEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator12stopSvStatusEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator9startNmeaEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IGnssDelegator8stopNmeaEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BnGnss19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BnGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss6BnGnss12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss15BnAGnssCallbackE",
   "name" : "aidl::android::hardware::gnss::BnAGnssCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15BnAGnssCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss15BnAGnssCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnAGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss15BnAGnssCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BnAGnssCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BnAGnssCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss14IAGnssCallback13agnssStatusCbENS3_9AGnssTypeENS3_16AGnssStatusValueE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BnAGnssCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BnAGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BnAGnssCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss15BpAGnssCallbackE",
   "name" : "aidl::android::hardware::gnss::BpAGnssCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15BpAGnssCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss15BpAGnssCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpAGnssCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss15BpAGnssCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BpAGnssCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BpAGnssCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss14IAGnssCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BpAGnssCallback13agnssStatusCbENS2_14IAGnssCallback9AGnssTypeENS4_16AGnssStatusValueE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BpAGnssCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15BpAGnssCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timestampNs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "timeUncertaintyNs",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE",
   "name" : "aidl::android::hardware::gnss::ElapsedRealtime",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss15ElapsedRealtimeE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/ElapsedRealtime.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "svid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "signalType",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss14GnssSignalTypeE"
    },
    {
     "field_name" : "timeOffsetNs",
     "field_offset" : 320,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "state",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "receivedSvTimeInNs",
     "field_offset" : 448,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "receivedSvTimeUncertaintyInNs",
     "field_offset" : 512,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "antennaCN0DbHz",
     "field_offset" : 576,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "basebandCN0DbHz",
     "field_offset" : 640,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "pseudorangeRateMps",
     "field_offset" : 704,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "pseudorangeRateUncertaintyMps",
     "field_offset" : 768,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "accumulatedDeltaRangeState",
     "field_offset" : 832,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "accumulatedDeltaRangeM",
     "field_offset" : 896,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "accumulatedDeltaRangeUncertaintyM",
     "field_offset" : 960,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "carrierCycles",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "carrierPhase",
     "field_offset" : 1088,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "carrierPhaseUncertainty",
     "field_offset" : 1152,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "multipathIndicator",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss22GnssMultipathIndicatorE"
    },
    {
     "field_name" : "snrDb",
     "field_offset" : 1280,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "agcLevelDb",
     "field_offset" : 1344,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "fullInterSignalBiasNs",
     "field_offset" : 1408,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "fullInterSignalBiasUncertaintyNs",
     "field_offset" : 1472,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satelliteInterSignalBiasNs",
     "field_offset" : 1536,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satelliteInterSignalBiasUncertaintyNs",
     "field_offset" : 1600,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "satellitePvt",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss12SatellitePvtE"
    },
    {
     "field_name" : "correlationVectors",
     "field_offset" : 2816,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android8hardware4gnss17CorrelationVectorENS_9allocatorIS5_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss15GnssMeasurementE",
   "name" : "aidl::android::hardware::gnss::GnssMeasurement",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15GnssMeasurementE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss15GnssMeasurementE",
   "size" : 368,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/GnssMeasurement.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss7BnAGnssE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware4gnss6IAGnssEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss15IAGnssDelegatorE",
   "name" : "aidl::android::hardware::gnss::IAGnssDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss15IAGnssDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss15IAGnssDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnAGnss.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss15IAGnssDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15IAGnssDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15IAGnssDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss6IAGnssEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15IAGnssDelegator11setCallbackERKNSt3__110shared_ptrINS2_14IAGnssCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15IAGnssDelegator14dataConnClosedEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15IAGnssDelegator14dataConnFailedEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15IAGnssDelegator9setServerENS2_14IAGnssCallback9AGnssTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss15IAGnssDelegator12dataConnOpenExRKNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEENS2_6IAGnss9ApnIpTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss7BnAGnss19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss7BnAGnss16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss7BnAGnss12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IAGnssRilE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss16IAGnssRilDefaultE",
   "name" : "aidl::android::hardware::gnss::IAGnssRilDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss16IAGnssRilDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss16IAGnssRilDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IAGnssRil.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss16IAGnssRilDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefault11setCallbackERKNSt3__110shared_ptrINS2_17IAGnssRilCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefault14setRefLocationERKNS2_9IAGnssRil16AGnssRefLocationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefault8setSetIdENS2_9IAGnssRil9SetIdTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefault18updateNetworkStateERKNS2_9IAGnssRil17NetworkAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IAGnssRilDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss16IGnssAntennaInfoE",
   "name" : "aidl::android::hardware::gnss::IGnssAntennaInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss16IGnssAntennaInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss16IGnssAntennaInfoE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssAntennaInfo.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss16IGnssAntennaInfoE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfoD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo11setCallbackERKNSt3__110shared_ptrINS2_24IGnssAntennaInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss9IGnssPsdsE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss16IGnssPsdsDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssPsdsDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss16IGnssPsdsDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss16IGnssPsdsDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssPsds.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss16IGnssPsdsDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault14injectPsdsDataENS2_8PsdsTypeERKNSt3__16vectorIhNS5_9allocatorIhEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault11setCallbackERKNSt3__110shared_ptrINS2_17IGnssPsdsCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssPsdsDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "constellation",
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss21GnssConstellationTypeE"
    },
    {
     "field_name" : "svid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17BlocklistedSourceE",
   "name" : "aidl::android::hardware::gnss::BlocklistedSource",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17BlocklistedSourceE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17BlocklistedSourceE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BlocklistedSource.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17BnGnssAntennaInfoE",
   "name" : "aidl::android::hardware::gnss::BnGnssAntennaInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17BnGnssAntennaInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17BnGnssAntennaInfoE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnGnssAntennaInfo.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss17BnGnssAntennaInfoE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BnGnssAntennaInfoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BnGnssAntennaInfoD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo11setCallbackERKNSt3__110shared_ptrINS2_24IGnssAntennaInfoCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss16IGnssAntennaInfo5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BnGnssAntennaInfo19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BnGnssAntennaInfo16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BnGnssAntennaInfo12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17BpGnssAntennaInfoE",
   "name" : "aidl::android::hardware::gnss::BpGnssAntennaInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17BpGnssAntennaInfoE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17BpGnssAntennaInfoE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpGnssAntennaInfo.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss17BpGnssAntennaInfoE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BpGnssAntennaInfoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BpGnssAntennaInfoD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss16IGnssAntennaInfoEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BpGnssAntennaInfo11setCallbackERKNSt3__110shared_ptrINS2_24IGnssAntennaInfoCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BpGnssAntennaInfo5closeEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BpGnssAntennaInfo19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17BpGnssAntennaInfo16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frequencyOffsetMps",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "samplingWidthM",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "samplingStartM",
     "field_offset" : 128,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "magnitude",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17CorrelationVectorE",
   "name" : "aidl::android::hardware::gnss::CorrelationVector",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17CorrelationVectorE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17CorrelationVectorE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/CorrelationVector.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17IAGnssRilCallbackE",
   "name" : "aidl::android::hardware::gnss::IAGnssRilCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IAGnssRilCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17IAGnssRilCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IAGnssRilCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss17IAGnssRilCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback14requestSetIdCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback15requestRefLocCbEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10IGnssDebugE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17IGnssDebugDefaultE",
   "name" : "aidl::android::hardware::gnss::IGnssDebugDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssDebugDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssDebugDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssDebug.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss17IGnssDebugDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssDebugDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssDebugDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssDebugDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssDebugDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssDebugDefault12getDebugDataEPNS2_10IGnssDebug9DebugDataE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssDebugDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssDebugDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE",
   "name" : "aidl::android::hardware::gnss::IGnssPsdsCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssPsdsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss17IGnssPsdsCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18BnAGnssRilCallbackE",
   "name" : "aidl::android::hardware::gnss::BnAGnssRilCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18BnAGnssRilCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18BnAGnssRilCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnAGnssRilCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss18BnAGnssRilCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnAGnssRilCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnAGnssRilCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback14requestSetIdCbEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IAGnssRilCallback15requestRefLocCbEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnAGnssRilCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnAGnssRilCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnAGnssRilCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18BnGnssPsdsCallbackE",
   "name" : "aidl::android::hardware::gnss::BnGnssPsdsCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18BnGnssPsdsCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18BnGnssPsdsCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnGnssPsdsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss18BnGnssPsdsCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss17IGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BnGnssPsdsCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18BpAGnssRilCallbackE",
   "name" : "aidl::android::hardware::gnss::BpAGnssRilCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18BpAGnssRilCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18BpAGnssRilCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpAGnssRilCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss18BpAGnssRilCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpAGnssRilCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpAGnssRilCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IAGnssRilCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpAGnssRilCallback14requestSetIdCbEi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpAGnssRilCallback15requestRefLocCbEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpAGnssRilCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpAGnssRilCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18BpGnssPsdsCallbackE",
   "name" : "aidl::android::hardware::gnss::BpGnssPsdsCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18BpGnssPsdsCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18BpGnssPsdsCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BpGnssPsdsCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss18BpGnssPsdsCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware4gnss17IGnssPsdsCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallback17downloadRequestCbENS2_8PsdsTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18BpGnssPsdsCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware4gnss10BnAGnssRilE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware4gnss9IAGnssRilEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18IAGnssRilDelegatorE",
   "name" : "aidl::android::hardware::gnss::IAGnssRilDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18IAGnssRilDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18IAGnssRilDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/BnAGnssRil.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss18IAGnssRilDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IAGnssRilDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IAGnssRilDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware4gnss9IAGnssRilEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IAGnssRilDelegator11setCallbackERKNSt3__110shared_ptrINS2_17IAGnssRilCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IAGnssRilDelegator14setRefLocationERKNS2_9IAGnssRil16AGnssRefLocationE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IAGnssRilDelegator8setSetIdENS2_9IAGnssRil9SetIdTypeERKNSt3__112basic_stringIcNS6_11char_traitsIcEENS6_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IAGnssRilDelegator18updateNetworkStateERKNS2_9IAGnssRil17NetworkAttributesE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnAGnssRil19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnAGnssRil16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss10BnAGnssRil12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE",
   "name" : "aidl::android::hardware::gnss::IGnssConfiguration",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE",
   "self_type" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/gnss/aidl/android.hardware.gnss-V2-ndk-source/gen/include/aidl/android/hardware/gnss/IGnssConfiguration.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware4gnss18IGnssConfigurationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfigurationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfigurationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware4gnss18IGnssConfiguration14setSuplVersionEi"
    },
    {
