{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",

   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIxNS_9allocatorIxEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIxNS_9allocatorIxEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "name" : "const std::optional<std::vector<unsigned long long, std::allocator<unsigned long long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/INfcClientCallback.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/INfcClientCallback.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc18INfcClientCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::nfc::INfcClientCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware3nfc18INfcClientCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback8sendDataERKNSt3__16vectorIhNS4_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback9sendEventENS2_8NfcEventENS2_9NfcStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc4INfcE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mWeakBinder",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEEE",
   "name" : "ndk::BnCInterface<aidl::android::hardware::nfc::INfc>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEEE",
   "self_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEEE",
   "size" : 24,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware3nfc4INfcE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc4openERKNSt3__110shared_ptrINS2_18INfcClientCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc5closeENS2_12NfcCloseTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc15coreInitializedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc12factoryResetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc9getConfigEPNS2_9NfcConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc10powerCycleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc11preDiscoverEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc5writeERKNSt3__16vectorIhNS4_9allocatorIhEEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc23setEnableVerboseLoggingEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc23isVerboseLoggingEnabledEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEE12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc18INfcClientCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::nfc::INfcClientCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware3nfc18INfcClientCallbackE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback8sendDataERKNSt3__16vectorIhNS4_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback9sendEventENS2_8NfcEventENS2_9NfcStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc4INfcE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3ndk10SpAIBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEEE",
   "name" : "ndk::BpCInterface<aidl::android::hardware::nfc::INfc>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEEE",
   "self_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEEE",
   "size" : 20,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware3nfc4INfcE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc4openERKNSt3__110shared_ptrINS2_18INfcClientCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc5closeENS2_12NfcCloseTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc15coreInitializedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc12factoryResetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc9getConfigEPNS2_9NfcConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc10powerCycleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc11preDiscoverEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc5writeERKNSt3__16vectorIhNS4_9allocatorIhEEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc23setEnableVerboseLoggingEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc23isVerboseLoggingEnabledEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc4INfcE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc11INfcDefaultE",
   "name" : "aidl::android::hardware::nfc::INfcDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc11INfcDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc11INfcDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/INfc.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc11INfcDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault4openERKNSt3__110shared_ptrINS2_18INfcClientCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault5closeENS2_12NfcCloseTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault15coreInitializedEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault12factoryResetEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault9getConfigEPNS2_9NfcConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault10powerCycleEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault11preDiscoverEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault5writeERKNSt3__16vectorIhNS4_9allocatorIhEEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault23setEnableVerboseLoggingEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault23isVerboseLoggingEnabledEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc11INfcDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc5BnNfcE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware3nfc4INfcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc13INfcDelegatorE",
   "name" : "aidl::android::hardware::nfc::INfcDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc13INfcDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc13INfcDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/BnNfc.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc13INfcDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator4openERKNSt3__110shared_ptrINS2_18INfcClientCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator5closeENS2_12NfcCloseTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator15coreInitializedEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator12factoryResetEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator9getConfigEPNS2_9NfcConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator10powerCycleEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator11preDiscoverEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator5writeERKNSt3__16vectorIhNS4_9allocatorIhEEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator23setEnableVerboseLoggingEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc13INfcDelegator23isVerboseLoggingEnabledEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BnNfc19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BnNfc16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BnNfc12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc18INfcClientCallbackE",
   "name" : "aidl::android::hardware::nfc::INfcClientCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc18INfcClientCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc18INfcClientCallbackE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/INfcClientCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc18INfcClientCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback8sendDataERKNSt3__16vectorIhNS4_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback9sendEventENS2_8NfcEventENS2_9NfcStatusE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc19BnNfcClientCallbackE",
   "name" : "aidl::android::hardware::nfc::BnNfcClientCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc19BnNfcClientCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc19BnNfcClientCallbackE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/BnNfcClientCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc19BnNfcClientCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BnNfcClientCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BnNfcClientCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback8sendDataERKNSt3__16vectorIhNS4_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc18INfcClientCallback9sendEventENS2_8NfcEventENS2_9NfcStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BnNfcClientCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BnNfcClientCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BnNfcClientCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc19BpNfcClientCallbackE",
   "name" : "aidl::android::hardware::nfc::BpNfcClientCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc19BpNfcClientCallbackE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc19BpNfcClientCallbackE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/BpNfcClientCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc19BpNfcClientCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BpNfcClientCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BpNfcClientCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BpNfcClientCallback8sendDataERKNSt3__16vectorIhNS4_9allocatorIhEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BpNfcClientCallback9sendEventENS2_8NfcEventENS2_9NfcStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BpNfcClientCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BpNfcClientCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "protocol18092Active",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "protocolBPrime",
     "field_offset" : 8,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "protocolDual",
     "field_offset" : 16,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "protocol15693",
     "field_offset" : 24,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "protocolKovio",
     "field_offset" : 32,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "protocolMifare",
     "field_offset" : 40,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "discoveryPollKovio",
     "field_offset" : 48,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "discoveryPollBPrime",
     "field_offset" : 56,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "discoveryListenBPrime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc23ProtocolDiscoveryConfigE",
   "name" : "aidl::android::hardware::nfc::ProtocolDiscoveryConfig",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc23ProtocolDiscoveryConfigE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc23ProtocolDiscoveryConfigE",
   "size" : 9,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/ProtocolDiscoveryConfig.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc18INfcClientCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc25INfcClientCallbackDefaultE",
   "name" : "aidl::android::hardware::nfc::INfcClientCallbackDefault",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc25INfcClientCallbackDefaultE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc25INfcClientCallbackDefaultE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/INfcClientCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc25INfcClientCallbackDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc25INfcClientCallbackDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc25INfcClientCallbackDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc25INfcClientCallbackDefault8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc25INfcClientCallbackDefault8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc25INfcClientCallbackDefault8sendDataERKNSt3__16vectorIhNS4_9allocatorIhEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc25INfcClientCallbackDefault9sendEventENS2_8NfcEventENS2_9NfcStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc25INfcClientCallbackDefault19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc25INfcClientCallbackDefault16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc19BnNfcClientCallbackE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_impl",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN4aidl7android8hardware3nfc18INfcClientCallbackEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc27INfcClientCallbackDelegatorE",
   "name" : "aidl::android::hardware::nfc::INfcClientCallbackDelegator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc27INfcClientCallbackDelegatorE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc27INfcClientCallbackDelegatorE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/BnNfcClientCallback.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc27INfcClientCallbackDelegatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc27INfcClientCallbackDelegatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc27INfcClientCallbackDelegatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc18INfcClientCallbackEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc27INfcClientCallbackDelegator8sendDataERKNSt3__16vectorIhNS4_9allocatorIhEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc27INfcClientCallbackDelegator9sendEventENS2_8NfcEventENS2_9NfcStatusE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BnNfcClientCallback19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BnNfcClientCallback16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc19BnNfcClientCallback12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk11ICInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc4INfcE",
   "name" : "aidl::android::hardware::nfc::INfc",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc4INfcE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc4INfcE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/INfc.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc4INfcE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfcD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfcD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc4openERKNSt3__110shared_ptrINS2_18INfcClientCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc5closeENS2_12NfcCloseTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc15coreInitializedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc12factoryResetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc9getConfigEPNS2_9NfcConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc10powerCycleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc11preDiscoverEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc5writeERKNSt3__16vectorIhNS4_9allocatorIhEEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc23setEnableVerboseLoggingEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc23isVerboseLoggingEnabledEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc19getInterfaceVersionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc5BnNfcE",
   "name" : "aidl::android::hardware::nfc::BnNfc",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc5BnNfcE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc5BnNfcE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/BnNfc.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc5BnNfcE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BnNfcD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BnNfcD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BnCInterfaceIN4aidl7android8hardware3nfc4INfcEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc4openERKNSt3__110shared_ptrINS2_18INfcClientCallbackEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc5closeENS2_12NfcCloseTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc15coreInitializedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc12factoryResetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc9getConfigEPNS2_9NfcConfigE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc10powerCycleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc11preDiscoverEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc5writeERKNSt3__16vectorIhNS4_9allocatorIhEEEEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc23setEnableVerboseLoggingEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc4INfc23isVerboseLoggingEnabledEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BnNfc19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BnNfc16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BnNfc12createBinderEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "_aidl_cached_version",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_aidl_cached_hash",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "_aidl_cached_hash_mutex",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc5BpNfcE",
   "name" : "aidl::android::hardware::nfc::BpNfc",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc5BpNfcE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc5BpNfcE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/BpNfc.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN4aidl7android8hardware3nfc5BpNfcE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfcD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfcD0Ev"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEE8asBinderEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEE8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk12BpCInterfaceIN4aidl7android8hardware3nfc4INfcEE4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc4openERKNSt3__110shared_ptrINS2_18INfcClientCallbackEEE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc5closeENS2_12NfcCloseTypeE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc15coreInitializedEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc12factoryResetEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc9getConfigEPNS2_9NfcConfigE"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc10powerCycleEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc11preDiscoverEv"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc5writeERKNSt3__16vectorIhNS4_9allocatorIhEEEEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc23setEnableVerboseLoggingEb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc23isVerboseLoggingEnabledEPb"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc19getInterfaceVersionEPi"
    },
    {
     "mangled_component_name" : "_ZN4aidl7android8hardware3nfc5BpNfc16getInterfaceHashEPNSt3__112basic_stringIcNS4_11char_traitsIcEENS4_9allocatorIcEEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nfaPollBailOutMode",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "presenceCheckAlgorithm",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc22PresenceCheckAlgorithmE"
    },
    {
     "field_name" : "nfaProprietaryCfg",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN4aidl7android8hardware3nfc23ProtocolDiscoveryConfigE"
    },
    {
     "field_name" : "defaultOffHostRoute",
     "field_offset" : 88,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "defaultOffHostRouteFelica",
     "field_offset" : 96,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "defaultSystemCodeRoute",
     "field_offset" : 104,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "defaultSystemCodePowerState",
     "field_offset" : 112,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "defaultRoute",
     "field_offset" : 120,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "offHostESEPipeId",
     "field_offset" : 128,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "offHostSIMPipeId",
     "field_offset" : 136,
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "maxIsoDepTransceiveLength",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "hostAllowlist",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "offHostRouteUicc",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "offHostRouteEse",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "defaultIsoDepRoute",
     "field_offset" : 480,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware3nfc9NfcConfigE",
   "name" : "aidl::android::hardware::nfc::NfcConfig",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android8hardware3nfc9NfcConfigE",
   "self_type" : "_ZTIN4aidl7android8hardware3nfc9NfcConfigE",
   "size" : 64,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/nfc/aidl/android.hardware.nfc-V1-ndk-source/gen/include/aidl/android/hardware/nfc/NfcConfig.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<unsigned char, std::allocator<unsigned char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware3nfc22PresenceCheckAlgorithmEEE",
   "name" : "android::internal::details::IsPointerLike<aidl::android::hardware::nfc::PresenceCheckAlgorithm>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware3nfc22PresenceCheckAlgorithmEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware3nfc22PresenceCheckAlgorithmEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware3nfc22PresenceCheckAlgorithmE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware3nfc23ProtocolDiscoveryConfigEEE",
   "name" : "android::internal::details::IsPointerLike<aidl::android::hardware::nfc::ProtocolDiscoveryConfig>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware3nfc23ProtocolDiscoveryConfigEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeIN4aidl7android8hardware3nfc23ProtocolDiscoveryConfigEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTIN4aidl7android8hardware3nfc23ProtocolDiscoveryConfigE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "name" : "android::internal::details::IsPointerLike<std::vector<unsigned char, std::allocator<unsigned char>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "self_type" : "_ZTIN7android8internal7details13IsPointerLikeINSt3__16vectorIhNS3_9allocatorIhEEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details13ToEmptyStringIN4aidl7android8hardware3nfc22PresenceCheckAlgorithmEEE",
   "name" : "android::internal::details::ToEmptyString<aidl::android::hardware::nfc::PresenceCheckAlgorithm>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details13ToEmptyStringIN4aidl7android8hardware3nfc22PresenceCheckAlgorithmEEE",
   "self_type" : "_ZTIN7android8internal7details13ToEmptyStringIN4aidl7android8hardware3nfc22PresenceCheckAlgorithmEEE",
   "size" : 1,
