{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "referenced_type" : "_ZTIDn",
   "self_type" : "_ZTIDn",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",

   "name" : "const std::optional<std::vector<unsigned long long, std::allocator<unsigned long long>>>",
   "referenced_type" : "_ZTINSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "self_type" : "_ZTIKNSt3__18optionalINS_6vectorIyNS_9allocatorIyEEEEEE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AParcel",
   "name" : "AParcel *const",
   "referenced_type" : "_ZTIP7AParcel",
   "self_type" : "_ZTIKP7AParcel",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP7AStatus",
   "name" : "AStatus *const",
   "referenced_type" : "_ZTIP7AStatus",
   "self_type" : "_ZTIKP7AStatus",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcel_utils.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinder",
     "referenced_type" : "_ZTIP8AIBinder"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk10SpAIBinderE",
   "name" : "ndk::SpAIBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk10SpAIBinderE",
   "self_type" : "_ZTIN3ndk10SpAIBinderE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interface",
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3ndk11ICInterfaceEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "name" : "ndk::ICInterface::ICInterfaceData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "self_type" : "_ZTIN3ndk11ICInterface15ICInterfaceDataE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk13SharedRefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk11ICInterfaceE",
   "name" : "ndk::ICInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk11ICInterfaceE",
   "self_type" : "_ZTIN3ndk11ICInterfaceE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk11ICInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk11ICInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8asBinderEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3ndk11ICInterface8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface4dumpEiPPKcj"
    },
    {
     "mangled_component_name" : "_ZN3ndk11ICInterface18handleShellCommandEiiiPPKcj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAParcelE",
   "name" : "ndk::ScopedAParcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAParcelE",
   "self_type" : "_ZTIN3ndk13ScopedAParcelE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13ScopedAStatusE",
   "name" : "ndk::ScopedAStatus",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13ScopedAStatusE",
   "self_type" : "_ZTIN3ndk13ScopedAStatusE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFlagThis",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__19once_flagE"
    },
    {
     "access" : "private",
     "field_name" : "mThis",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18weak_ptrIN3ndk13SharedRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk13SharedRefBaseE",
   "name" : "ndk::SharedRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk13SharedRefBaseE",
   "self_type" : "_ZTIN3ndk13SharedRefBaseE",
   "size" : 16,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_interface_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk13SharedRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk13SharedRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParcel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3ndk13ScopedAParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mStability",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk17AParcelableHolderE",
   "name" : "ndk::AParcelableHolder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk17AParcelableHolderE",
   "self_type" : "_ZTIN3ndk17AParcelableHolderE",
   "size" : 12,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_parcelable_utils.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3ndk17AParcelableHolderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3ndk17AParcelableHolderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "name" : "ndk::ScopedAIBinder_Weak",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "self_type" : "_ZTIN3ndk19ScopedAIBinder_WeakE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIiXadL_ZNS_8internalL14closeWithErrorEiEELin1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "name" : "ndk::ScopedFileDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "self_type" : "_ZTIN3ndk20ScopedFileDescriptorE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "name" : "ndk::ScopedAIBinder_DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "self_type" : "_ZTIN3ndk29ScopedAIBinder_DeathRecipientE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP13AIBinder_Weak"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_Weak *, &AIBinder_Weak_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP13AIBinder_WeakXadL_Z20AIBinder_Weak_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP13AIBinder_Weak"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP23AIBinder_DeathRecipient"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AIBinder_DeathRecipient *, &AIBinder_DeathRecipient_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP23AIBinder_DeathRecipientXadL_Z30AIBinder_DeathRecipient_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP23AIBinder_DeathRecipient"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AParcel"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AParcel *, &AParcel_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AParcelXadL_Z14AParcel_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AParcel"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mT",
     "referenced_type" : "_ZTIP7AStatus"
    }
   ],
   "linker_set_key" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "name" : "ndk::impl::ScopedAResource<AStatus *, &AStatus_delete, nullptr>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "self_type" : "_ZTIN3ndk4impl15ScopedAResourceIP7AStatusXadL_Z14AStatus_deleteEELS3_0EEE",
   "size" : 4,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_auto_utils.h",
   "template_args" :
   [
    "_ZTIP7AStatus"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE"
    },
    {
     "field_name" : "offloadInfo",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common16AudioOffloadInfoE"
    },
    {
     "field_name" : "frameCount",
     "field_offset" : 896,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common11AudioConfigE",
   "name" : "aidl::android::media::audio::common::AudioConfig",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common11AudioConfigE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common11AudioConfigE",
   "size" : 120,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioConfig.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioDeviceDescriptionE"
    },
    {
     "field_name" : "address",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioDeviceAddressE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common11AudioDeviceE",
   "name" : "aidl::android::media::audio::common::AudioDevice",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common11AudioDeviceE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common11AudioDeviceE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioDevice.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJiiEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common12AudioIoFlagsE",
   "name" : "aidl::android::media::audio::common::AudioIoFlags",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common12AudioIoFlagsE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common12AudioIoFlagsE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioIoFlags.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbN4aidl7android5media5audio6common18AudioPortDeviceExtENS5_15AudioPortMixExtEiEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common12AudioPortExtE",
   "name" : "aidl::android::media::audio::common::AudioPortExt",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common12AudioPortExtE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common12AudioPortExtE",
   "size" : 52,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioPortExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioFormatDescriptionE"
    },
    {
     "field_name" : "channelMasks",
     "field_offset" : 224,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android5media5audio6common18AudioChannelLayoutENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "sampleRates",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "encapsulationType",
     "field_offset" : 416,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioEncapsulationTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common12AudioProfileE",
   "name" : "aidl::android::media::audio::common::AudioProfile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common12AudioProfileE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common12AudioProfileE",
   "size" : 56,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioProfile.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sampleRate",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioFormatDescriptionE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE",
   "name" : "aidl::android::media::audio::common::AudioConfigBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE",
   "size" : 28,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioConfigBase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE"
    },
    {
     "field_name" : "values",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16vectorIiNS_9allocatorIiEEEE"
    },
    {
     "field_name" : "rampDurationMs",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common15AudioGainConfigE",
   "name" : "aidl::android::media::audio::common::AudioGainConfig",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioGainConfigE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common15AudioGainConfigE",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioGainConfig.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "portId",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android5media5audio6common3IntEEE"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android5media5audio6common18AudioChannelLayoutEEE"
    },
    {
     "field_name" : "format",
     "field_offset" : 224,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android5media5audio6common22AudioFormatDescriptionEEE"
    },
    {
     "field_name" : "gain",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android5media5audio6common15AudioGainConfigEEE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 672,
     "referenced_type" : "_ZTINSt3__18optionalIN4aidl7android5media5audio6common12AudioIoFlagsEEE"
    },
    {
     "field_name" : "ext",
     "field_offset" : 768,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common12AudioPortExtE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common15AudioPortConfigE",
   "name" : "aidl::android::media::audio::common::AudioPortConfig",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioPortConfigE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common15AudioPortConfigE",
   "size" : 148,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioPortConfig.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "handle",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usecase",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioPortMixExtUseCaseE"
    },
    {
     "field_name" : "maxOpenStreamCount",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxActiveStreamCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "recommendedMuteDurationMs",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common15AudioPortMixExtE",
   "name" : "aidl::android::media::audio::common::AudioPortMixExt",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioPortMixExtE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common15AudioPortMixExtE",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioPortMixExt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioConfigBaseE"
    },
    {
     "field_name" : "streamType",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioStreamTypeE"
    },
    {
     "field_name" : "bitRatePerSecond",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "durationUs",
     "field_offset" : 320,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "hasVideo",
     "field_offset" : 384,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "isStreaming",
     "field_offset" : 392,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "bitWidth",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "offloadBufferSize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usage",
     "field_offset" : 480,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common10AudioUsageE"
    },
    {
     "field_name" : "encapsulationMode",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioEncapsulationModeE"
    },
    {
     "field_name" : "contentId",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "syncId",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common16AudioOffloadInfoE",
   "name" : "aidl::android::media::audio::common::AudioOffloadInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common16AudioOffloadInfoE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common16AudioOffloadInfoE",
   "size" : 80,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioOffloadInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJiiiiiEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE",
   "name" : "aidl::android::media::audio::common::AudioChannelLayout",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioChannelLayout.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_6vectorIhNS4_IhEEEES9_NS7_IiNS4_IiEEEESB_EEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common18AudioDeviceAddressE",
   "name" : "aidl::android::media::audio::common::AudioDeviceAddress",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioDeviceAddressE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common18AudioDeviceAddressE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioDeviceAddress.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common11AudioDeviceE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "encodedFormats",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android5media5audio6common22AudioFormatDescriptionENS_9allocatorIS6_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common18AudioPortDeviceExtE",
   "name" : "aidl::android::media::audio::common::AudioPortDeviceExt",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioPortDeviceExtE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common18AudioPortDeviceExtE",
   "size" : 48,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioPortDeviceExt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common11AudioDeviceE"
    },
    {
     "field_name" : "mmapPolicy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioMMapPolicyE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common19AudioMMapPolicyInfoE",
   "name" : "aidl::android::media::audio::common::AudioMMapPolicyInfo",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common19AudioMMapPolicyInfoE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common19AudioMMapPolicyInfoE",
   "size" : 36,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioMMapPolicyInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "standard",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common13AudioStandardE"
    },
    {
     "field_name" : "audioDescriptor",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    },
    {
     "field_name" : "encapsulationType",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioEncapsulationTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common20ExtraAudioDescriptorE",
   "name" : "aidl::android::media::audio::common::ExtraAudioDescriptor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common20ExtraAudioDescriptorE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common20ExtraAudioDescriptorE",
   "size" : 20,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/ExtraAudioDescriptor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioDeviceTypeE"
    },
    {
     "field_name" : "connection",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common22AudioDeviceDescriptionE",
   "name" : "aidl::android::media::audio::common::AudioDeviceDescription",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioDeviceDescriptionE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common22AudioDeviceDescriptionE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioDeviceDescription.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common15AudioFormatTypeE"
    },
    {
     "field_name" : "pcm",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common7PcmTypeE"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common22AudioFormatDescriptionE",
   "name" : "aidl::android::media::audio::common::AudioFormatDescription",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioFormatDescriptionE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common22AudioFormatDescriptionE",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioFormatDescription.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_value",
     "referenced_type" : "_ZTINSt3__17variantIJbN4aidl7android5media5audio6common15AudioStreamTypeENS5_11AudioSourceEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common22AudioPortMixExtUseCaseE",
   "name" : "aidl::android::media::audio::common::AudioPortMixExtUseCase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common22AudioPortMixExtUseCaseE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common22AudioPortMixExtUseCaseE",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioPortMixExtUseCase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common3IntE",
   "name" : "aidl::android::media::audio::common::Int",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common3IntE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common3IntE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/Int.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common18AudioChannelLayoutE"
    },
    {
     "field_name" : "minValue",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxValue",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "defaultValue",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stepValue",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "minRampMs",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "maxRampMs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "useForVolume",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common9AudioGainE",
   "name" : "aidl::android::media::audio::common::AudioGain",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common9AudioGainE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common9AudioGainE",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioGain.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "profiles",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android5media5audio6common12AudioProfileENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common12AudioIoFlagsE"
    },
    {
     "field_name" : "extraAudioDescriptors",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android5media5audio6common20ExtraAudioDescriptorENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "gains",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorIN4aidl7android5media5audio6common9AudioGainENS_9allocatorIS6_EEEE"
    },
    {
     "field_name" : "ext",
     "field_offset" : 480,
     "referenced_type" : "_ZTIN4aidl7android5media5audio6common12AudioPortExtE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common9AudioPortE",
   "name" : "aidl::android::media::audio::common::AudioPort",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common9AudioPortE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common9AudioPortE",
   "size" : 112,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioPort.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "timeLow",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timeMid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "timeHiAndVersion",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "clockSeq",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "node",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16vectorIhNS_9allocatorIhEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android5media5audio6common9AudioUuidE",
   "name" : "aidl::android::media::audio::common::AudioUuid",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN4aidl7android5media5audio6common9AudioUuidE",
   "self_type" : "_ZTIN4aidl7android5media5audio6common9AudioUuidE",
   "size" : 28,
   "source_file" : "out/soong/.intermediates/frameworks/base/media/android.media.audio.common.types-V1-ndk-source/gen/include/aidl/android/media/audio/common/AudioUuid.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common12AudioProfileENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::media::audio::common::AudioProfile, std::allocator<aidl::android::media::audio::common::AudioProfile>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common12AudioProfileENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common12AudioProfileENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android5media5audio6common12AudioProfileENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common18AudioChannelLayoutENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::media::audio::common::AudioChannelLayout, std::allocator<aidl::android::media::audio::common::AudioChannelLayout>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common18AudioChannelLayoutENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common18AudioChannelLayoutENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android5media5audio6common18AudioChannelLayoutENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common20ExtraAudioDescriptorENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::media::audio::common::ExtraAudioDescriptor, std::allocator<aidl::android::media::audio::common::ExtraAudioDescriptor>>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common20ExtraAudioDescriptorENS3_9allocatorISA_EEEEEE",
   "self_type" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common20ExtraAudioDescriptorENS3_9allocatorISA_EEEEEE",
   "size" : 1,
   "source_file" : "frameworks/native/libs/binder/ndk/include_cpp/android/binder_to_string.h",
   "template_args" :
   [
    "_ZTINSt3__16vectorIN4aidl7android5media5audio6common20ExtraAudioDescriptorENS_9allocatorIS6_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8internal7details10IsIterableINSt3__16vectorIN4aidl7android5media5audio6common22AudioFormatDescriptionENS3_9allocatorISA_EEEEEE",
   "name" : "android::internal::details::IsIterable<std::vector<aidl::android::media::audio::common::AudioFormatDescription, std::allocator<aidl::android::media::audio::common::AudioFormatDescription>>>",
   "record_kind" : "class",
