<abi-corpus version='2.1' path='data/test-read-dwarf/test16-pr18904.so' soname='liboffloadmic_host.so.5'>
  <elf-needed>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='ORSLRelease' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLReservePartial' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ORSLTryReserve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_find_associated_mic_memory' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_get_physical_device_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Offload_number_of_devices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='omp_init_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_init_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_default_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_dynamic_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_nested_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_num_threads_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_set_schedule_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_test_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_test_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_unset_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='omp_unset_nest_lock_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZN3COI13EngineGetInfoE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI18PipelineSetCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI20PipelineClearCPUMaskE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN3COI21EventRegisterCallbackE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine12m_func_namesE' size='56' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Engine14c_signal_namesE' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream11all_streamsE' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream13m_stream_lockE' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN6Stream15m_streams_countE' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_major_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_api_minor_version' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_is_attached' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_exe_name' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_id' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__dbg_target_so_pid' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_func_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_init_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_var_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__offload_myo_vtable_tables' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../../gcc/liboffloadmic/runtime/cean_util.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../../gcc/liboffloadmic/runtime/coi/coi_client.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32768' id='type-id-3'>
      <subrange length='1024' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='128' id='type-id-7'>
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='8160' id='type-id-10'>
      <subrange length='255' type-id='type-id-4' id='type-id-11'/>
    </array-type-def>
    <class-decl name='coievent' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='63' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opaque' type-id='type-id-7' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='COIPROCESS' type-id='type-id-13' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='65' column='1' id='type-id-14'/>
    <typedef-decl name='COIPIPELINE' type-id='type-id-15' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='66' column='1' id='type-id-16'/>
    <typedef-decl name='COIFUNCTION' type-id='type-id-17' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='67' column='1' id='type-id-18'/>
    <typedef-decl name='COIENGINE' type-id='type-id-19' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='68' column='1' id='type-id-20'/>
    <typedef-decl name='COIEVENT' type-id='type-id-12' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='69' column='1' id='type-id-21'/>
    <typedef-decl name='COIBUFFER' type-id='type-id-22' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='70' column='1' id='type-id-23'/>
    <typedef-decl name='COILIBRARY' type-id='type-id-24' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='71' column='1' id='type-id-25'/>
    <typedef-decl name='COIMAPINSTANCE' type-id='type-id-26' filepath='../../../gcc/liboffloadmic/include/coi/common/../common/COITypes_common.h' line='72' column='1' id='type-id-27'/>
    <enum-decl name='COI_ISA_TYPE' naming-typedef-id='type-id-28' linkage-name='12COI_ISA_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIEngine_common.h' line='70' column='1' id='type-id-29'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='COI_ISA_INVALID' value='0'/>
      <enumerator name='COI_ISA_x86_64' value='1'/>
      <enumerator name='COI_ISA_MIC' value='2'/>
      <enumerator name='COI_ISA_KNF' value='3'/>
      <enumerator name='COI_ISA_KNC' value='4'/>
    </enum-decl>
    <typedef-decl name='COI_ISA_TYPE' type-id='type-id-29' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIEngine_common.h' line='78' column='1' id='type-id-28'/>
    <enum-decl name='COIRESULT' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIResult_common.h' line='57' column='1' id='type-id-31'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='COI_SUCCESS' value='0'/>
      <enumerator name='COI_ERROR' value='1'/>
      <enumerator name='COI_NOT_INITIALIZED' value='2'/>
      <enumerator name='COI_ALREADY_INITIALIZED' value='3'/>
      <enumerator name='COI_ALREADY_EXISTS' value='4'/>
      <enumerator name='COI_DOES_NOT_EXIST' value='5'/>
      <enumerator name='COI_INVALID_POINTER' value='6'/>
      <enumerator name='COI_OUT_OF_RANGE' value='7'/>
      <enumerator name='COI_NOT_SUPPORTED' value='8'/>
      <enumerator name='COI_TIME_OUT_REACHED' value='9'/>
      <enumerator name='COI_MEMORY_OVERLAP' value='10'/>
      <enumerator name='COI_ARGUMENT_MISMATCH' value='11'/>
      <enumerator name='COI_SIZE_MISMATCH' value='12'/>
      <enumerator name='COI_OUT_OF_MEMORY' value='13'/>
      <enumerator name='COI_INVALID_HANDLE' value='14'/>
      <enumerator name='COI_RETRY' value='15'/>
      <enumerator name='COI_RESOURCE_EXHAUSTED' value='16'/>
      <enumerator name='COI_ALREADY_LOCKED' value='17'/>
      <enumerator name='COI_NOT_LOCKED' value='18'/>
      <enumerator name='COI_MISSING_DEPENDENCY' value='19'/>
      <enumerator name='COI_UNDEFINED_SYMBOL' value='20'/>
      <enumerator name='COI_PENDING' value='21'/>
      <enumerator name='COI_BINARY_AND_HARDWARE_MISMATCH' value='22'/>
      <enumerator name='COI_PROCESS_DIED' value='23'/>
      <enumerator name='COI_INVALID_FILE' value='24'/>
      <enumerator name='COI_EVENT_CANCELED' value='25'/>
      <enumerator name='COI_VERSION_MISMATCH' value='26'/>
      <enumerator name='COI_BAD_PORT' value='27'/>
      <enumerator name='COI_AUTHENTICATION_FAILURE' value='28'/>
      <enumerator name='COI_NUM_RESULTS' value='29'/>
    </enum-decl>
    <typedef-decl name='COIRESULT' type-id='type-id-31' filepath='../../../gcc/liboffloadmic/include/coi/source/../common/COIResult_common.h' line='122' column='1' id='type-id-32'/>
    <enum-decl name='COI_BUFFER_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='65' column='1' id='type-id-33'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='COI_BUFFER_NORMAL' value='1'/>
      <enumerator name='COI_BUFFER_RESERVED_1' value='2'/>
      <enumerator name='COI_BUFFER_RESERVED_2' value='3'/>
      <enumerator name='COI_BUFFER_PINNED' value='4'/>
      <enumerator name='COI_BUFFER_OPENCL' value='5'/>
    </enum-decl>
    <typedef-decl name='COI_BUFFER_TYPE' type-id='type-id-33' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='87' column='1' id='type-id-34'/>
    <enum-decl name='COI_MAP_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='183' column='1' id='type-id-35'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='COI_MAP_READ_WRITE' value='1'/>
      <enumerator name='COI_MAP_READ_ONLY' value='2'/>
      <enumerator name='COI_MAP_WRITE_ENTIRE_BUFFER' value='3'/>
    </enum-decl>
    <typedef-decl name='COI_MAP_TYPE' type-id='type-id-35' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='204' column='1' id='type-id-36'/>
    <enum-decl name='COI_COPY_TYPE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='240' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='COI_COPY_UNSPECIFIED' value='0'/>
      <enumerator name='COI_COPY_USE_DMA' value='1'/>
      <enumerator name='COI_COPY_USE_CPU' value='2'/>
      <enumerator name='COI_COPY_UNSPECIFIED_MOVE_ENTIRE' value='3'/>
      <enumerator name='COI_COPY_USE_DMA_MOVE_ENTIRE' value='4'/>
      <enumerator name='COI_COPY_USE_CPU_MOVE_ENTIRE' value='5'/>
    </enum-decl>
    <typedef-decl name='COI_COPY_TYPE' type-id='type-id-37' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='265' column='1' id='type-id-38'/>
    <enum-decl name='COI_BUFFER_STATE' naming-typedef-id='type-id-39' linkage-name='16COI_BUFFER_STATE' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='335' column='1' id='type-id-40'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='COI_BUFFER_VALID' value='0'/>
      <enumerator name='COI_BUFFER_INVALID' value='1'/>
      <enumerator name='COI_BUFFER_VALID_MAY_DROP' value='2'/>
      <enumerator name='COI_BUFFER_RESERVED' value='3'/>
    </enum-decl>
    <typedef-decl name='COI_BUFFER_STATE' type-id='type-id-40' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='342' column='1' id='type-id-39'/>
    <enum-decl name='COI_BUFFER_MOVE_FLAG' naming-typedef-id='type-id-41' linkage-name='20COI_BUFFER_MOVE_FLAG' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='359' column='1' id='type-id-42'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='COI_BUFFER_MOVE' value='0'/>
      <enumerator name='COI_BUFFER_NO_MOVE' value='1'/>
    </enum-decl>
    <typedef-decl name='COI_BUFFER_MOVE_FLAG' type-id='type-id-42' filepath='../../../gcc/liboffloadmic/include/coi/source/COIBuffer_source.h' line='362' column='1' id='type-id-41'/>
    <enum-decl name='coi_eng_misc' naming-typedef-id='type-id-43' linkage-name='12coi_eng_misc' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='70' column='1' id='type-id-44'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='COI_ENG_ECC_DISABLED' value='0'/>
      <enumerator name='COI_ENG_ECC_ENABLED' value='1'/>
      <enumerator name='COI_ENG_ECC_UNKNOWN' value='2'/>
    </enum-decl>
    <typedef-decl name='coi_eng_misc' type-id='type-id-44' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='74' column='1' id='type-id-43'/>
    <class-decl name='COI_ENGINE_INFO' size-in-bits='41472' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='83' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='DriverVersion' type-id='type-id-10' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8160'>
        <var-decl name='ISA' type-id='type-id-28' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='NumCores' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8224'>
        <var-decl name='MiscFlags' type-id='type-id-43' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='NumThreads' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8288'>
        <var-decl name='CoreMaxFrequency' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='Load' type-id='type-id-3' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41088'>
        <var-decl name='PhysicalMemory' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41152'>
        <var-decl name='PhysicalMemoryFree' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41216'>
        <var-decl name='SwapMemory' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41280'>
        <var-decl name='SwapMemoryFree' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41344'>
        <var-decl name='VendorId' type-id='type-id-48' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41360'>
        <var-decl name='DeviceId' type-id='type-id-48' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41376'>
        <var-decl name='SubSystemId' type-id='type-id-48' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41392'>
        <var-decl name='BoardStepping' type-id='type-id-48' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41408'>
        <var-decl name='BoardSKU' type-id='type-id-48' visibility='default' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='COI_ENGINE_INFO' type-id='type-id-45' filepath='../../../gcc/liboffloadmic/include/coi/source/COIEngine_source.h' line='133' column='1' id='type-id-49'/>
    <enum-decl name='COI_ACCESS_FLAGS' filepath='../../../gcc/liboffloadmic/include/coi/source/COIPipeline_source.h' line='69' column='1' id='type-id-50'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='COI_SINK_READ' value='1'/>
      <enumerator name='COI_SINK_WRITE' value='2'/>
      <enumerator name='COI_SINK_WRITE_ENTIRE' value='3'/>
      <enumerator name='COI_SINK_READ_ADDREF' value='4'/>
      <enumerator name='COI_SINK_WRITE_ADDREF' value='5'/>
      <enumerator name='COI_SINK_WRITE_ENTIRE_ADDREF' value='6'/>
    </enum-decl>
    <typedef-decl name='COI_ACCESS_FLAGS' type-id='type-id-50' filepath='../../../gcc/liboffloadmic/include/coi/source/COIPipeline_source.h' line='97' column='1' id='type-id-51'/>
    <typedef-decl name='int8_t' type-id='type-id-52' filepath='/usr/include/stdint.h' line='36' column='1' id='type-id-53'/>
    <typedef-decl name='int32_t' type-id='type-id-54' filepath='/usr/include/stdint.h' line='38' column='1' id='type-id-55'/>
    <typedef-decl name='uint8_t' type-id='type-id-1' filepath='/usr/include/stdint.h' line='48' column='1' id='type-id-56'/>
    <typedef-decl name='uint16_t' type-id='type-id-57' filepath='/usr/include/stdint.h' line='49' column='1' id='type-id-48'/>
    <typedef-decl name='uint32_t' type-id='type-id-2' filepath='/usr/include/stdint.h' line='51' column='1' id='type-id-46'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-13'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-74'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-75'/>
    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-76'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-78'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <qualified-type-def type-id='type-id-51' const='yes' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-82'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-148'/>
    <class-decl name='coibuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-67'/>
    <class-decl name='coiengine' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-68'/>
    <class-decl name='coifunction' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <class-decl name='coilibrary' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-70'/>
    <class-decl name='coimapinst' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-71'/>
    <class-decl name='coipipeline' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <class-decl name='coiprocess' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-73'/>
    <namespace-decl name='COI'>
      <var-decl name='is_available' type-id='type-id-149' mangled-name='_ZN3COI12is_availableE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='60' column='1'/>
      <var-decl name='EngineGetCount' type-id='type-id-132' mangled-name='_ZN3COI14EngineGetCountE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='63' column='1'/>
      <var-decl name='EngineGetHandle' type-id='type-id-130' mangled-name='_ZN3COI15EngineGetHandleE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='64' column='1'/>
      <var-decl name='ProcessCreateFromMemory' type-id='type-id-104' mangled-name='_ZN3COI23ProcessCreateFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='66' column='1'/>
      <var-decl name='ProcessCreateFromFile' type-id='type-id-102' mangled-name='_ZN3COI21ProcessCreateFromFileE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='74' column='1'/>
      <var-decl name='ProcessSetCacheSize' type-id='type-id-124' mangled-name='_ZN3COI19ProcessSetCacheSizeE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='82' column='1'/>
      <var-decl name='ProcessDestroy' type-id='type-id-118' mangled-name='_ZN3COI14ProcessDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='85' column='1'/>
      <var-decl name='ProcessGetFunctionHandles' type-id='type-id-120' mangled-name='_ZN3COI25ProcessGetFunctionHandlesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='87' column='1'/>
      <var-decl name='ProcessLoadLibraryFromMemory' type-id='type-id-128' mangled-name='_ZN3COI28ProcessLoadLibraryFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='90' column='1'/>
      <var-decl name='ProcessUnloadLibrary' type-id='type-id-116' mangled-name='_ZN3COI20ProcessUnloadLibraryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='100' column='1'/>
      <var-decl name='ProcessRegisterLibraries' type-id='type-id-136' mangled-name='_ZN3COI24ProcessRegisterLibrariesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='103' column='1'/>
      <var-decl name='PipelineCreate' type-id='type-id-126' mangled-name='_ZN3COI14PipelineCreateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='109' column='1'/>
      <var-decl name='PipelineDestroy' type-id='type-id-112' mangled-name='_ZN3COI15PipelineDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='111' column='1'/>
      <var-decl name='PipelineRunFunction' type-id='type-id-114' mangled-name='_ZN3COI19PipelineRunFunctionE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='112' column='1'/>
      <var-decl name='BufferCreate' type-id='type-id-140' mangled-name='_ZN3COI12BufferCreateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='119' column='1'/>
      <var-decl name='BufferCreateFromMemory' type-id='type-id-140' mangled-name='_ZN3COI22BufferCreateFromMemoryE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='122' column='1'/>
      <var-decl name='BufferDestroy' type-id='type-id-86' mangled-name='_ZN3COI13BufferDestroyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='126' column='1'/>
      <var-decl name='BufferMap' type-id='type-id-94' mangled-name='_ZN3COI9BufferMapE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='127' column='1'/>
      <var-decl name='BufferUnmap' type-id='type-id-110' mangled-name='_ZN3COI11BufferUnmapE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='130' column='1'/>
      <var-decl name='BufferWrite' type-id='type-id-96' mangled-name='_ZN3COI11BufferWriteE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='132' column='1'/>
      <var-decl name='BufferRead' type-id='type-id-96' mangled-name='_ZN3COI10BufferReadE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='135' column='1'/>
      <var-decl name='BufferReadMultiD' type-id='type-id-98' mangled-name='_ZN3COI16BufferReadMultiDE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='138' column='1'/>
      <var-decl name='BufferWriteMultiD' type-id='type-id-92' mangled-name='_ZN3COI17BufferWriteMultiDE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='141' column='1'/>
      <var-decl name='BufferCopy' type-id='type-id-88' mangled-name='_ZN3COI10BufferCopyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='145' column='1'/>
      <var-decl name='BufferGetSinkAddress' type-id='type-id-100' mangled-name='_ZN3COI20BufferGetSinkAddressE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='148' column='1'/>
      <var-decl name='BufferSetState' type-id='type-id-90' mangled-name='_ZN3COI14BufferSetStateE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='149' column='1'/>
      <var-decl name='EventWait' type-id='type-id-134' mangled-name='_ZN3COI9EventWaitE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='153' column='1'/>
      <var-decl name='PerfGetCycleFrequency' type-id='type-id-144' mangled-name='_ZN3COI21PerfGetCycleFrequencyE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='156' column='1'/>
      <var-decl name='ProcessConfigureDMA' type-id='type-id-138' mangled-name='_ZN3COI19ProcessConfigureDMAE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='158' column='1'/>
      <var-decl name='PipelineClearCPUMask' type-id='type-id-142' mangled-name='_ZN3COI20PipelineClearCPUMaskE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='160' column='1' elf-symbol-id='_ZN3COI20PipelineClearCPUMaskE'/>
      <var-decl name='PipelineSetCPUMask' type-id='type-id-122' mangled-name='_ZN3COI18PipelineSetCPUMaskE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='162' column='1' elf-symbol-id='_ZN3COI18PipelineSetCPUMaskE'/>
      <var-decl name='EngineGetInfo' type-id='type-id-106' mangled-name='_ZN3COI13EngineGetInfoE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='164' column='1' elf-symbol-id='_ZN3COI13EngineGetInfoE'/>
      <var-decl name='EventRegisterCallback' type-id='type-id-108' mangled-name='_ZN3COI21EventRegisterCallbackE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/coi/coi_client.h' line='166' column='1' elf-symbol-id='_ZN3COI21EventRegisterCallbackE'/>
    </namespace-decl>
    <function-type size-in-bits='64' id='type-id-85'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-87'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-89'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-91'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-93'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-95'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-97'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-99'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-101'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-103'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-105'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-107'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-109'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-111'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-113'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-115'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-117'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-119'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-121'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-123'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-145'/>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-141'>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-143'>
      <return type-id='type-id-47'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-147'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-154'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../../gcc/liboffloadmic/runtime/compiler_if_host.cpp' comp-dir-path='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/liboffloadmic' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='128' id='type-id-156'>
      <subrange length='1' type-id='type-id-4' id='type-id-157'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-158' size-in-bits='320' id='type-id-159'>
      <subrange length='1' type-id='type-id-4' id='type-id-157'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-160' size-in-bits='2560' id='type-id-161'>
      <subrange length='20' type-id='type-id-4' id='type-id-162'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-160' size-in-bits='1152' id='type-id-163'>
      <subrange length='9' type-id='type-id-4' id='type-id-164'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-165' size-in-bits='infinite' id='type-id-166'>
      <subrange length='infinite' type-id='type-id-4' id='type-id-167'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-17' size-in-bits='448' id='type-id-168'>
      <subrange length='7' type-id='type-id-4' id='type-id-169'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-152' size-in-bits='2048' id='type-id-170'>
      <subrange length='32' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-152' size-in-bits='448' id='type-id-172'>
      <subrange length='7' type-id='type-id-4' id='type-id-169'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='832' id='type-id-173'>
      <subrange length='104' type-id='type-id-4' id='type-id-174'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-175'>
      <subrange length='16' type-id='type-id-4' id='type-id-176'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='192' id='type-id-177'>
      <subrange length='24' type-id='type-id-4' id='type-id-178'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-179'>
      <subrange length='40' type-id='type-id-4' id='type-id-180'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' id='type-id-181'>
      <subrange length='8' type-id='type-id-4' id='type-id-182'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='1024' id='type-id-183'>
      <subrange length='16' type-id='type-id-4' id='type-id-176'/>
    </array-type-def>
    <class-decl name='Dim_Desc' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='38' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lindex' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lower' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='upper' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='stride' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Arr_Desc' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='46' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rank' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dim' type-id='type-id-159' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='CeanReadDim' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='52' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='CeanReadRanges' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='58' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arr_desc' type-id='type-id-187' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ptr' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='current_number' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='range_max_number' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='range_size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='last_noncont_ind' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='init_offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='Dim' type-id='type-id-156' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/cean_util.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='error_types' naming-typedef-id='type-id-188' linkage-name='11error_types' filepath='../../../gcc/liboffloadmic/runtime/liboffload_error_codes.h' line='38' column='1' id='type-id-189'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='c_device_is_not_available' value='0'/>
      <enumerator name='c_invalid_device_number' value='1'/>
      <enumerator name='c_offload1' value='2'/>
      <enumerator name='c_unknown_var_type' value='3'/>
      <enumerator name='c_send_func_ptr' value='4'/>
      <enumerator name='c_receive_func_ptr' value='5'/>
      <enumerator name='c_malloc' value='6'/>
      <enumerator name='c_offload_malloc' value='7'/>
      <enumerator name='c_invalid_env_var_value' value='8'/>
      <enumerator name='c_invalid_env_var_int_value' value='9'/>
      <enumerator name='c_invalid_env_report_value' value='10'/>
      <enumerator name='c_offload_signaled1' value='11'/>
      <enumerator name='c_offload_signaled2' value='12'/>
      <enumerator name='c_myotarget_checkresult' value='13'/>
      <enumerator name='c_myowrapper_checkresult' value='14'/>
      <enumerator name='c_offload_descriptor_offload' value='15'/>
      <enumerator name='c_merge_var_descs1' value='16'/>
      <enumerator name='c_merge_var_descs2' value='17'/>
      <enumerator name='c_mic_parse_env_var_list1' value='18'/>
      <enumerator name='c_mic_parse_env_var_list2' value='19'/>
      <enumerator name='c_mic_process_exit_ret' value='20'/>
      <enumerator name='c_mic_process_exit_sig' value='21'/>
      <enumerator name='c_mic_process_exit' value='22'/>
      <enumerator name='c_mic_init3' value='23'/>
      <enumerator name='c_mic_init4' value='24'/>
      <enumerator name='c_mic_init5' value='25'/>
      <enumerator name='c_mic_init6' value='26'/>
      <enumerator name='c_no_static_var_data' value='27'/>
      <enumerator name='c_no_ptr_data' value='28'/>
      <enumerator name='c_get_engine_handle' value='29'/>
      <enumerator name='c_get_engine_index' value='30'/>
      <enumerator name='c_process_create' value='31'/>
      <enumerator name='c_process_set_cache_size' value='32'/>
      <enumerator name='c_process_get_func_handles' value='33'/>
      <enumerator name='c_process_wait_shutdown' value='34'/>
      <enumerator name='c_process_proxy_flush' value='35'/>
      <enumerator name='c_load_library' value='36'/>
      <enumerator name='c_pipeline_create' value='37'/>
      <enumerator name='c_pipeline_run_func' value='38'/>
      <enumerator name='c_pipeline_start_run_funcs' value='39'/>
      <enumerator name='c_buf_create' value='40'/>
      <enumerator name='c_buf_create_out_of_mem' value='41'/>
      <enumerator name='c_buf_create_from_mem' value='42'/>
      <enumerator name='c_buf_destroy' value='43'/>
      <enumerator name='c_buf_map' value='44'/>
      <enumerator name='c_buf_unmap' value='45'/>
      <enumerator name='c_buf_read' value='46'/>
      <enumerator name='c_buf_write' value='47'/>
      <enumerator name='c_buf_copy' value='48'/>
      <enumerator name='c_buf_get_address' value='49'/>
      <enumerator name='c_buf_add_ref' value='50'/>
      <enumerator name='c_buf_release_ref' value='51'/>
      <enumerator name='c_buf_set_state' value='52'/>
      <enumerator name='c_event_wait' value='53'/>
      <enumerator name='c_zero_or_neg_ptr_len' value='54'/>
      <enumerator name='c_zero_or_neg_transfer_size' value='55'/>
      <enumerator name='c_bad_ptr_mem_alloc' value='56'/>
      <enumerator name='c_bad_ptr_mem_range' value='57'/>
      <enumerator name='c_different_src_and_dstn_sizes' value='58'/>
      <enumerator name='c_ranges_dont_match' value='59'/>
      <enumerator name='c_destination_is_over' value='60'/>
      <enumerator name='c_slice_of_noncont_array' value='61'/>
      <enumerator name='c_non_contiguous_dope_vector' value='62'/>
      <enumerator name='c_pointer_array_mismatch' value='63'/>
      <enumerator name='c_omp_invalid_device_num_env' value='64'/>
      <enumerator name='c_omp_invalid_device_num' value='65'/>
      <enumerator name='c_unknown_binary_type' value='66'/>
      <enumerator name='c_multiple_target_exes' value='67'/>
      <enumerator name='c_no_target_exe' value='68'/>
      <enumerator name='c_incorrect_affinity' value='69'/>
      <enumerator name='c_cannot_set_affinity' value='70'/>
      <enumerator name='c_report_host' value='71'/>
      <enumerator name='c_report_target' value='72'/>
      <enumerator name='c_report_title' value='73'/>
      <enumerator name='c_report_from_file' value='74'/>
      <enumerator name='c_report_file' value='75'/>
      <enumerator name='c_report_line' value='76'/>
      <enumerator name='c_report_tag' value='77'/>
      <enumerator name='c_report_seconds' value='78'/>
      <enumerator name='c_report_bytes' value='79'/>
      <enumerator name='c_report_mic' value='80'/>
      <enumerator name='c_report_cpu_time' value='81'/>
      <enumerator name='c_report_cpu_to_mic_data' value='82'/>
      <enumerator name='c_report_mic_time' value='83'/>
      <enumerator name='c_report_mic_to_cpu_data' value='84'/>
      <enumerator name='c_report_unknown_timer_node' value='85'/>
      <enumerator name='c_report_unknown_trace_node' value='86'/>
      <enumerator name='c_report_offload' value='87'/>
      <enumerator name='c_report_w_tag' value='88'/>
      <enumerator name='c_report_state' value='89'/>
      <enumerator name='c_report_start' value='90'/>
      <enumerator name='c_report_init' value='91'/>
      <enumerator name='c_report_logical_card' value='92'/>
      <enumerator name='c_report_physical_card' value='93'/>
      <enumerator name='c_report_register' value='94'/>
      <enumerator name='c_report_init_func' value='95'/>
      <enumerator name='c_report_create_buf_host' value='96'/>
      <enumerator name='c_report_create_buf_mic' value='97'/>
      <enumerator name='c_report_send_pointer_data' value='98'/>
      <enumerator name='c_report_sent_pointer_data' value='99'/>
      <enumerator name='c_report_gather_copyin_data' value='100'/>
      <enumerator name='c_report_copyin_data' value='101'/>
      <enumerator name='c_report_state_signal' value='102'/>
      <enumerator name='c_report_signal' value='103'/>
      <enumerator name='c_report_wait' value='104'/>
      <enumerator name='c_report_compute' value='105'/>
      <enumerator name='c_report_receive_pointer_data' value='106'/>
      <enumerator name='c_report_received_pointer_data' value='107'/>
      <enumerator name='c_report_start_target_func' value='108'/>
      <enumerator name='c_report_var' value='109'/>
      <enumerator name='c_report_scatter_copyin_data' value='110'/>
      <enumerator name='c_report_gather_copyout_data' value='111'/>
      <enumerator name='c_report_scatter_copyout_data' value='112'/>
      <enumerator name='c_report_copyout_data' value='113'/>
      <enumerator name='c_report_unregister' value='114'/>
      <enumerator name='c_report_destroy' value='115'/>
      <enumerator name='c_report_myoinit' value='116'/>
      <enumerator name='c_report_myoregister' value='117'/>
      <enumerator name='c_report_myofini' value='118'/>
      <enumerator name='c_report_mic_myo_shared' value='119'/>
      <enumerator name='c_report_mic_myo_fptr' value='120'/>
      <enumerator name='c_report_myosharedmalloc' value='121'/>
      <enumerator name='c_report_myosharedfree' value='122'/>
      <enumerator name='c_report_myosharedalignedmalloc' value='123'/>
      <enumerator name='c_report_myosharedalignedfree' value='124'/>
      <enumerator name='c_report_myoacquire' value='125'/>
      <enumerator name='c_report_myorelease' value='126'/>
      <enumerator name='c_report_myosupportsfeature' value='127'/>
      <enumerator name='c_report_myosharedarenacreate' value='128'/>
      <enumerator name='c_report_myosharedalignedarenamalloc' value='129'/>
      <enumerator name='c_report_myosharedalignedarenafree' value='130'/>
      <enumerator name='c_report_myoarenaacquire' value='131'/>
      <enumerator name='c_report_myoarenarelease' value='132'/>
      <enumerator name='c_coipipe_max_number' value='133'/>
      <enumerator name='c_in_with_preallocated' value='134'/>
      <enumerator name='c_report_no_host_exe' value='135'/>
      <enumerator name='c_report_path_buff_overflow' value='136'/>
      <enumerator name='c_create_pipeline_for_stream' value='137'/>
      <enumerator name='c_offload_no_stream' value='138'/>
      <enumerator name='c_get_engine_info' value='139'/>
      <enumerator name='c_clear_cpu_mask' value='140'/>
      <enumerator name='c_set_cpu_mask' value='141'/>
      <enumerator name='c_report_state_stream' value='142'/>
      <enumerator name='c_report_stream' value='143'/>
      <enumerator name='c_unload_library' value='144'/>
    </enum-decl>
    <typedef-decl name='error_types' type-id='type-id-189' filepath='../../../gcc/liboffloadmic/runtime/liboffload_error_codes.h' line='184' column='1' id='type-id-188'/>
    <enum-decl name='TARGET_TYPE' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='61' column='1' id='type-id-190'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='TARGET_NONE' value='0'/>
      <enumerator name='TARGET_HOST' value='1'/>
      <enumerator name='TARGET_MIC' value='2'/>
    </enum-decl>
    <typedef-decl name='TARGET_TYPE' type-id='type-id-190' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='65' column='1' id='type-id-191'/>
    <enum-decl name='_Offload_result' naming-typedef-id='type-id-192' linkage-name='15_Offload_result' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='80' column='1' id='type-id-193'>
      <underlying-type type-id='type-id-30'/>
      <enumerator name='OFFLOAD_SUCCESS' value='0'/>
      <enumerator name='OFFLOAD_DISABLED' value='1'/>
      <enumerator name='OFFLOAD_UNAVAILABLE' value='2'/>
      <enumerator name='OFFLOAD_OUT_OF_MEMORY' value='3'/>
      <enumerator name='OFFLOAD_PROCESS_DIED' value='4'/>
      <enumerator name='OFFLOAD_ERROR' value='5'/>
    </enum-decl>
    <typedef-decl name='_Offload_result' type-id='type-id-193' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='87' column='1' id='type-id-192'/>
    <class-decl name='_Offload_status' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-194' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='89' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='result' type-id='type-id-192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='device_number' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data_sent' type-id='type-id-196' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data_received' type-id='type-id-196' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Offload_status' type-id='type-id-195' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='94' column='1' id='type-id-194'/>
    <typedef-decl name='_Offload_stream' type-id='type-id-47' filepath='../../../gcc/liboffloadmic/runtime/offload.h' line='96' column='1' id='type-id-197'/>
    <union-decl name='OffloadFlags' size-in-bits='32' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='160' column='1' id='type-id-198'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='162' column='1' id='type-id-199'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='fortran_traceback' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='163' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='1'>
            <var-decl name='omp_async' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='flags' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='161' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='type-id-199' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='165' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='varDescFlags' size-in-bits='32' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='217' column='1' id='type-id-200'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='218' column='1' id='type-id-201'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='is_static' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='220' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='1'>
            <var-decl name='is_static_dstn' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='222' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2'>
            <var-decl name='has_length' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='224' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='3'>
            <var-decl name='is_stack_buf' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='226' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='4'>
            <var-decl name='targetptr' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='228' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='5'>
            <var-decl name='preallocated' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='230' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='6'>
            <var-decl name='is_pointer' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='232' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='7'>
            <var-decl name='sink_addr' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='8'>
            <var-decl name='alloc_disp' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='237' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='9'>
            <var-decl name='is_noncont_src' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='239' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='10'>
            <var-decl name='is_noncont_dst' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='241' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='11'>
            <var-decl name='always_copy' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='244' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='12'>
            <var-decl name='always_delete' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='246' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='13'>
            <var-decl name='pin' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='248' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='250' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='VarDesc' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='254' column='1' id='type-id-202'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='256' column='1' id='type-id-203'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='257' column='1' id='type-id-204'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='dst' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='258' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='4'>
                <var-decl name='src' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='259' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='' type-id='type-id-204' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='bits' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='261' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__1' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='265' column='1' id='type-id-205'>
          <member-type access='public'>
            <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='266' column='1' id='type-id-206'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='in' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='267' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='1'>
                <var-decl name='out' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='268' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public'>
            <var-decl name='' type-id='type-id-206' visibility='default'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='bits' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='270' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='287' column='1' id='type-id-207'>
          <data-member access='public'>
            <var-decl name='count' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='291' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='disp' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='293' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='public'>
        <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='298' column='1' id='type-id-208'>
          <data-member access='public'>
            <var-decl name='alloc' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='299' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='ptr_arr_offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='300' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-203' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='direction' type-id='type-id-205' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='alloc_if' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='free_if' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='align' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mic_offset' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-200' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-207' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='into' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ptr' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='314' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='VarDesc2' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='318' column='1' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sname' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dname' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='320' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FunctionDescriptor' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='467' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='in_datalen' type-id='type-id-211' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='out_datalen' type-id='type-id-211' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='console_enabled' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='timer_enabled' type-id='type-id-56' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='offload_report_level' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offload_number' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='vars_num' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_offset' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data' type-id='type-id-166' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='495' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='OFFLOAD' type-id='type-id-212' filepath='../../../gcc/liboffloadmic/runtime/offload_common.h' line='500' column='1' id='type-id-213'/>
    <class-decl name='MemRange' size-in-bits='128' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='46' column='1' id='type-id-214'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_start' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='76' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_length' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='77' column='1'/>
      </data-member>
      <member-function access='private' const='yes'>
        <function-decl name='overlaps' mangled-name='_ZNK8MemRange8overlapsERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange8overlapsERKS_'>
          <parameter type-id='type-id-215' is-artificial='yes'/>
          <parameter type-id='type-id-216'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='end' mangled-name='_ZNK8MemRange3endEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange3endEv'>
          <parameter type-id='type-id-215' is-artificial='yes'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='start' mangled-name='_ZNK8MemRange5startEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange5startEv'>
          <parameter type-id='type-id-215' is-artificial='yes'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-217' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8MemRangeC2EPKvm'>
          <parameter type-id='type-id-217' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='contains' mangled-name='_ZNK8MemRange8containsERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange8containsERKS_'>
          <parameter type-id='type-id-215' is-artificial='yes'/>
          <parameter type-id='type-id-216'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='length' mangled-name='_ZNK8MemRange6lengthEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8MemRange6lengthEv'>
          <parameter type-id='type-id-215' is-artificial='yes'/>
          <return type-id='type-id-47'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='MemRange' mangled-name='_ZN8MemRangeC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8MemRangeC2EPKvm'>
          <parameter type-id='type-id-217' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='PtrData' size-in-bits='832' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='81' column='1' id='type-id-218'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='cpu_addr' type-id='type-id-219' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='cpu_buf' type-id='type-id-23' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='mic_buf' type-id='type-id-23' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='mic_addr' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='alloc_disp' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='mic_offset' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='416'>
        <var-decl name='is_static' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='alloc_ptr_data_lock' type-id='type-id-220' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='ref_count' type-id='type-id-221' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='158' column='1'/>
      </data-member>
      <member-function access='private' const='yes'>
        <function-decl name='operator&lt;' mangled-name='_ZNK7PtrDataltERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK7PtrDataltERKS_'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <parameter type-id='type-id-223'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC4ERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-224' is-artificial='yes'/>
          <parameter type-id='type-id-223'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2ERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC2ERKS_'>
          <parameter type-id='type-id-224' is-artificial='yes'/>
          <parameter type-id='type-id-223'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-224' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC2EPKvm'>
          <parameter type-id='type-id-224' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='get_reference' mangled-name='_ZNK7PtrData13get_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK7PtrData13get_referenceEv'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <return type-id='type-id-221'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_reference' mangled-name='_ZN7PtrData16remove_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrData16remove_referenceEv'>
          <parameter type-id='type-id-224' is-artificial='yes'/>
          <return type-id='type-id-221'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_reference' mangled-name='_ZN7PtrData13add_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrData13add_referenceEv'>
          <parameter type-id='type-id-224' is-artificial='yes'/>
          <return type-id='type-id-221'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2ERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC2ERKS_'>
          <parameter type-id='type-id-224' is-artificial='yes'/>
          <parameter type-id='type-id-223'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='PtrData' mangled-name='_ZN7PtrDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7PtrDataC2EPKvm'>
          <parameter type-id='type-id-224' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='PtrDataList' type-id='type-id-225' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='161' column='1' id='type-id-226'/>
    <class-decl name='PtrDataTable' size-in-bits='704' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='163' column='1' id='type-id-227'>
      <member-type access='private'>
        <typedef-decl name='PtrSet' type-id='type-id-228' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='165' column='1' id='type-id-229'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='list' type-id='type-id-229' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_ptr_lock' type-id='type-id-220' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='204' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='insert_ptr_data' mangled-name='_ZN12PtrDataTable15insert_ptr_dataEPKvmRb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12PtrDataTable15insert_ptr_dataEPKvmRb'>
          <parameter type-id='type-id-230' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-231'/>
          <return type-id='type-id-224'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_ptr_data' mangled-name='_ZN12PtrDataTable15remove_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12PtrDataTable15remove_ptr_dataEPKv'>
          <parameter type-id='type-id-230' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='find_ptr_data' mangled-name='_ZN12PtrDataTable13find_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12PtrDataTable13find_ptr_dataEPKv'>
          <parameter type-id='type-id-230' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-224'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AutoData' size-in-bits='192' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='208' column='1' id='type-id-232'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='cpu_addr' type-id='type-id-219' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='ref_count' type-id='type-id-221' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='255' column='1'/>
      </data-member>
      <member-function access='private' const='yes'>
        <function-decl name='get_reference' mangled-name='_ZNK8AutoData13get_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8AutoData13get_referenceEv'>
          <parameter type-id='type-id-233' is-artificial='yes'/>
          <return type-id='type-id-221'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nullify_reference' mangled-name='_ZN8AutoData17nullify_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData17nullify_referenceEv'>
          <parameter type-id='type-id-234' is-artificial='yes'/>
          <return type-id='type-id-221'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='remove_reference' mangled-name='_ZN8AutoData16remove_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData16remove_referenceEv'>
          <parameter type-id='type-id-234' is-artificial='yes'/>
          <return type-id='type-id-221'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='add_reference' mangled-name='_ZN8AutoData13add_referenceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoData13add_referenceEv'>
          <parameter type-id='type-id-234' is-artificial='yes'/>
          <return type-id='type-id-221'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='operator&lt;' mangled-name='_ZNK8AutoDataltERKS_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8AutoDataltERKS_'>
          <parameter type-id='type-id-233' is-artificial='yes'/>
          <parameter type-id='type-id-235'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='AutoData' mangled-name='_ZN8AutoDataC4EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-234' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='AutoData' mangled-name='_ZN8AutoDataC2EPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8AutoDataC2EPKvm'>
          <parameter type-id='type-id-234' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='AutoSet' type-id='type-id-236' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='259' column='1' id='type-id-237'/>
    <class-decl name='TargetImage' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='262' column='1' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='origin' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='offset' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='279' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='TargetImage' mangled-name='_ZN11TargetImageC4EPKcPKvmS1_m' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-239' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='TargetImage' mangled-name='_ZN11TargetImageC2EPKcPKvmS1_m' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11TargetImageC2EPKcPKvmS1_m'>
          <parameter type-id='type-id-239' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='TargetImageList' type-id='type-id-240' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='282' column='1' id='type-id-241'/>
    <class-decl name='DynLib' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='285' column='1' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lib' type-id='type-id-25' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='297' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='DynLib' mangled-name='_ZN6DynLibC4EPKcPKvP10coilibrary' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-243' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='DynLib' mangled-name='_ZN6DynLibC2EPKcPKvP10coilibrary' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6DynLibC2EPKcPKvP10coilibrary'>
          <parameter type-id='type-id-243' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='DynLibList' type-id='type-id-244' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='299' column='1' id='type-id-245'/>
    <class-decl name='PersistData' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='302' column='1' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stack_cpu_addr' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='routine_id' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='thread_id' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stack_ptr_data' type-id='type-id-224' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cpu_stack_addr' type-id='type-id-247' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='320' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='PersistData' mangled-name='_ZN11PersistDataC4EPKvmmm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-248' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='PersistData' mangled-name='_ZN11PersistDataC2EPKvmmm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11PersistDataC2EPKvmmm'>
          <parameter type-id='type-id-248' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='PersistDataList' type-id='type-id-249' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='323' column='1' id='type-id-250'/>
    <class-decl name='Stream' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='326' column='1' id='type-id-251'>
      <member-type access='public'>
        <typedef-decl name='StreamMap' type-id='type-id-252' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='371' column='1' id='type-id-253'/>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='m_streams_count' type-id='type-id-47' mangled-name='_ZN6Stream15m_streams_countE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='373' column='1' elf-symbol-id='_ZN6Stream15m_streams_countE'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='all_streams' type-id='type-id-253' mangled-name='_ZN6Stream11all_streamsE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='374' column='1' elf-symbol-id='_ZN6Stream11all_streamsE'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='m_stream_lock' type-id='type-id-220' mangled-name='_ZN6Stream13m_stream_lockE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='375' column='1' elf-symbol-id='_ZN6Stream13m_stream_lockE'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_device' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_number_of_cpus' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_pipeline' type-id='type-id-16' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_last_offload' type-id='type-id-212' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_stream_cpus' type-id='type-id-254' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='389' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='get_device' mangled-name='_ZN6Stream10get_deviceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream10get_deviceEv'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <return type-id='type-id-54'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='find_stream' mangled-name='_ZN6Stream11find_streamEmb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream11find_streamEmb'>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-149'/>
          <return type-id='type-id-255'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_pipeline' mangled-name='_ZN6Stream12set_pipelineEP11coipipeline' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream12set_pipelineEP11coipipeline'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_cpu_number' mangled-name='_ZN6Stream14get_cpu_numberEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream14get_cpu_numberEv'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <return type-id='type-id-54'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_pipeline' mangled-name='_ZN6Stream12get_pipelineEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream12get_pipelineEv'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Stream' mangled-name='_ZN6StreamD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <parameter type-id='type-id-54' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Stream' mangled-name='_ZN6StreamD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6StreamD2Ev'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <parameter type-id='type-id-54' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='add_stream' mangled-name='_ZN6Stream10add_streamEii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream10add_streamEii'>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-197'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_last_offload' mangled-name='_ZN6Stream16set_last_offloadEP17OffloadDescriptor' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream16set_last_offloadEP17OffloadDescriptor'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <parameter type-id='type-id-212'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_last_offload' mangled-name='_ZN6Stream16get_last_offloadEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Stream16get_last_offloadEv'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <return type-id='type-id-212'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~Stream' mangled-name='_ZN6StreamD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6StreamD2Ev'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <parameter type-id='type-id-54' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Stream' mangled-name='_ZN6StreamC4Eii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='Stream' mangled-name='_ZN6StreamC2Eii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6StreamC2Eii'>
          <parameter type-id='type-id-255' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='StreamMap' type-id='type-id-252' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='392' column='1' id='type-id-256'/>
    <class-decl name='Engine' size-in-bits='5504' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='395' column='1' id='type-id-257'>
      <member-type access='private'>
        <typedef-decl name='SignalMap' type-id='type-id-258' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='608' column='1' id='type-id-259'/>
      </member-type>
      <member-type access='private'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='647' column='1' id='type-id-260'>
          <underlying-type type-id='type-id-30'/>
          <enumerator name='c_func_compute' value='0'/>
          <enumerator name='c_func_myo_init' value='1'/>
          <enumerator name='c_func_myo_fini' value='2'/>
          <enumerator name='c_func_init' value='3'/>
          <enumerator name='c_func_var_table_size' value='4'/>
          <enumerator name='c_func_var_table_copy' value='5'/>
          <enumerator name='c_func_set_stream_affinity' value='6'/>
          <enumerator name='c_funcs_total' value='7'/>
        </enum-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_persist_list' type-id='type-id-250' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='563' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_index' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='611' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='m_physical_index' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='612' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_proc_number' type-id='type-id-221' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='615' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_process' type-id='type-id-14' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='618' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_ready' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='622' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_lock' type-id='type-id-220' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='623' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_images' type-id='type-id-241' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='626' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='m_ptr_set' type-id='type-id-227' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='629' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='m_targetptr_set' type-id='type-id-227' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='630' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2368'>
        <var-decl name='m_signal_map' type-id='type-id-259' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='633' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2752'>
        <var-decl name='m_signal_lock' type-id='type-id-220' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='634' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3072'>
        <var-decl name='m_stream_map' type-id='type-id-256' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='637' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3456'>
        <var-decl name='m_stream_lock' type-id='type-id-220' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='638' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3776'>
        <var-decl name='m_num_cores' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='639' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3808'>
        <var-decl name='m_num_threads' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='640' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3840'>
        <var-decl name='m_cpus' type-id='type-id-254' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='641' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4864'>
        <var-decl name='m_dyn_libs' type-id='type-id-245' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='644' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='m_func_names' type-id='type-id-172' mangled-name='_ZN6Engine12m_func_namesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='659' column='1' elf-symbol-id='_ZN6Engine12m_func_namesE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5056'>
        <var-decl name='m_funcs' type-id='type-id-168' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='662' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='c_signal_max' type-id='type-id-261' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='665' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='c_signal_names' type-id='type-id-170' mangled-name='_ZN6Engine14c_signal_namesE' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='666' column='1' elf-symbol-id='_ZN6Engine14c_signal_namesE'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='destroy_thread_data' mangled-name='_ZN6Engine19destroy_thread_dataEPv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine19destroy_thread_dataEPv'>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_auto_vars' mangled-name='_ZN6Engine13get_auto_varsEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13get_auto_varsEv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-263'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_thread_id' mangled-name='_ZN6Engine13get_thread_idEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13get_thread_idEv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-47'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='stream_destroy' mangled-name='_ZN6Engine14stream_destroyEm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14stream_destroyEm'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-197'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_pipeline' mangled-name='_ZN6Engine12get_pipelineEm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12get_pipelineEm'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-197'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_pipeline' mangled-name='_ZN6Engine12get_pipelineEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12get_pipelineEv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_device' mangled-name='_ZN6Engine11init_deviceEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine11init_deviceEv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-264'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='compute' mangled-name='_ZN6Engine7computeEmRKNSt7__cxx114listIP9coibufferSaIS3_EEEPKvtPvtjPK8coieventPSB_' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine7computeEmRKNSt7__cxx114listIP9coibufferSaIS3_EEEPKvtPvtjPK8coieventPSB_'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-197'/>
          <parameter type-id='type-id-265'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-48'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-48'/>
          <parameter type-id='type-id-46'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_ptr_data' mangled-name='_ZN6Engine13init_ptr_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13init_ptr_dataEv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='unload_library' mangled-name='_ZN6Engine14unload_libraryEPKvPKc' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14unload_libraryEPKvPKc'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-152'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='load_libraries' mangled-name='_ZN6Engine14load_librariesEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14load_librariesEv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='fini_process' mangled-name='_ZN6Engine12fini_processEb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12fini_processEb'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-149'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_process' mangled-name='_ZN6Engine12init_processEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine12init_processEv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN6Engine4initEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine4initEv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='insert_ptr_data' mangled-name='_ZN6Engine15insert_ptr_dataEPKvmRb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine15insert_ptr_dataEPKvmRb'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-231'/>
          <return type-id='type-id-224'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='set_indexes' mangled-name='_ZN6Engine11set_indexesEii' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine11set_indexesEii'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Engine' mangled-name='_ZN6EngineD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-54' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~Engine' mangled-name='_ZN6EngineD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6EngineD2Ev'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-54' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Engine' mangled-name='_ZN6EngineC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='Engine' mangled-name='_ZN6EngineC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6EngineC2Ev'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_signal' mangled-name='_ZN6Engine11find_signalEPKvb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine11find_signalEPKvb'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-149'/>
          <return type-id='type-id-212'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_signal' mangled-name='_ZN6Engine10add_signalEPKvP17OffloadDescriptor' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine10add_signalEPKvP17OffloadDescriptor'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-212'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_auto_data' mangled-name='_ZN6Engine16remove_auto_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine16remove_auto_dataEPKv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='insert_auto_data' mangled-name='_ZN6Engine16insert_auto_dataEPKvm' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine16insert_auto_dataEPKvm'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-234'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_auto_data' mangled-name='_ZN6Engine14find_auto_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='504' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine14find_auto_dataEPKv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-234'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_targetptr_data' mangled-name='_ZN6Engine21remove_targetptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine21remove_targetptr_dataEPKv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_ptr_data' mangled-name='_ZN6Engine15remove_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine15remove_ptr_dataEPKv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='insert_targetptr_data' mangled-name='_ZN6Engine21insert_targetptr_dataEPKvmRb' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine21insert_targetptr_dataEPKvmRb'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-231'/>
          <return type-id='type-id-224'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_targetptr_data' mangled-name='_ZN6Engine19find_targetptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine19find_targetptr_dataEPKv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-224'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find_ptr_data' mangled-name='_ZN6Engine13find_ptr_dataEPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine13find_ptr_dataEPKv'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-224'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_lib' mangled-name='_ZN6Engine7add_libERK11TargetImage' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine7add_libERK11TargetImage'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-266'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_process' mangled-name='_ZNK6Engine11get_processEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK6Engine11get_processEv'>
          <parameter type-id='type-id-267' is-artificial='yes'/>
          <return type-id='type-id-268'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_logical_index' mangled-name='_ZNK6Engine17get_logical_indexEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK6Engine17get_logical_indexEv'>
          <parameter type-id='type-id-267' is-artificial='yes'/>
          <return type-id='type-id-54'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='fini_myo' mangled-name='_ZN6Engine8fini_myoEP8coievent' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine8fini_myoEP8coievent'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init_myo' mangled-name='_ZN6Engine8init_myoEP8coievent' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN6Engine8init_myoEP8coievent'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_physical_index' mangled-name='_ZNK6Engine18get_physical_indexEv' filepath='../../../gcc/liboffloadmic/runtime/offload_engine.h' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK6Engine18get_physical_indexEv'>
          <parameter type-id='type-id-267' is-artificial='yes'/>
          <return type-id='type-id-54'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='OffloadDescriptor' size-in-bits='2368' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='68' column='1' id='type-id-269'>
      <member-type access='public'>
        <enum-decl name='OmpAsyncLastEventType' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='71' column='1' id='type-id-270'>
          <underlying-type type-id='type-id-30'/>
          <enumerator name='c_last_not' value='0'/>
          <enumerator name='c_last_write' value='1'/>
          <enumerator name='c_last_read' value='2'/>
          <enumerator name='c_last_runfunc' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='BufferList' type-id='type-id-271' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='213' column='1' id='type-id-272'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='VarExtra' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='216' column='1' id='type-id-273'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='src_data' type-id='type-id-224' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='dst_data' type-id='type-id-224' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='218' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='auto_data' type-id='type-id-234' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='219' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='cpu_disp' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='220' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='cpu_offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='221' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='alloc' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='222' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='read_rng_src' type-id='type-id-274' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='223' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='read_rng_dst' type-id='type-id-274' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='224' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='ptr_arr_offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='225' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='is_arr_ptr_el' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='226' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='608'>
            <var-decl name='omp_last_event_type' type-id='type-id-270' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='227' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ReadArrElements&lt;long int&gt;' size-in-bits='512' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='230' column='1' id='type-id-275'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='ranges' type-id='type-id-274' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='269' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='val' type-id='type-id-221' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='270' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='el_size' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='271' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='272' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='273' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='320'>
            <var-decl name='length_cur' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='274' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='384'>
            <var-decl name='is_empty' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='275' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='416'>
            <var-decl name='count' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='276' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='base' type-id='type-id-247' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='277' column='1'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='read_next' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlE9read_nextEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIlE9read_nextEb'>
              <parameter type-id='type-id-276' is-artificial='yes'/>
              <parameter type-id='type-id-149'/>
              <return type-id='type-id-149'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlEC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-276' is-artificial='yes'/>
              <return type-id='type-id-154'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIlEC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIlEC2Ev'>
              <parameter type-id='type-id-276' is-artificial='yes'/>
              <return type-id='type-id-154'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ReadArrElements&lt;void*&gt;' size-in-bits='512' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='230' column='1' id='type-id-277'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='ranges' type-id='type-id-274' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='269' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='val' type-id='type-id-150' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='270' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='el_size' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='271' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='size' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='272' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='offset' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='273' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='320'>
            <var-decl name='length_cur' type-id='type-id-184' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='274' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='384'>
            <var-decl name='is_empty' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='275' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='416'>
            <var-decl name='count' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='276' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='base' type-id='type-id-247' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='277' column='1'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='read_next' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvE9read_nextEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIPvE9read_nextEb'>
              <parameter type-id='type-id-278' is-artificial='yes'/>
              <parameter type-id='type-id-149'/>
              <return type-id='type-id-149'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvEC4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-278' is-artificial='yes'/>
              <return type-id='type-id-154'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='ReadArrElements' mangled-name='_ZN17OffloadDescriptor15ReadArrElementsIPvEC2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15ReadArrElementsIPvEC2Ev'>
              <parameter type-id='type-id-278' is-artificial='yes'/>
              <return type-id='type-id-154'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_stack_ptr_data' type-id='type-id-224' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='281' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_destroy_stack' type-id='type-id-226' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='282' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_device' type-id='type-id-279' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='285' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_wait_all_devices' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='288' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='328'>
        <var-decl name='m_is_mandatory' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='291' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='336'>
        <var-decl name='m_is_openmp' type-id='type-id-280' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='294' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_in' type-id='type-id-281' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='297' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='m_out' type-id='type-id-281' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='300' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='m_compute_buffers' type-id='type-id-272' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='303' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_destroy_buffers' type-id='type-id-272' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='306' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <var-decl name='m_vars' type-id='type-id-282' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='309' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <var-decl name='m_vars_extra' type-id='type-id-283' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='310' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='m_vars_total' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='311' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_status' type-id='type-id-284' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='314' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='m_func_desc' type-id='type-id-285' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='317' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='m_func_desc_size' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='318' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='m_inout_buf' type-id='type-id-23' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='321' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <var-decl name='m_in_deps' type-id='type-id-60' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='324' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1792'>
        <var-decl name='m_in_deps_total' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1824'>
        <var-decl name='m_in_deps_allocated' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1856'>
        <var-decl name='m_out_deps' type-id='type-id-60' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='327' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1920'>
        <var-decl name='m_out_deps_total' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='328' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1952'>
        <var-decl name='m_out_deps_allocated' type-id='type-id-46' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='329' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1984'>
        <var-decl name='m_stream' type-id='type-id-197' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2048'>
        <var-decl name='m_timer_data' type-id='type-id-286' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='335' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2112'>
        <var-decl name='m_in_datalen' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2176'>
        <var-decl name='m_out_datalen' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2240'>
        <var-decl name='m_need_runfunction' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='343' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2248'>
        <var-decl name='m_initial_need_runfunction' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='347' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2256'>
        <var-decl name='m_out_with_preallocated' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2264'>
        <var-decl name='m_preallocated_alloc' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2272'>
        <var-decl name='m_traceback_called' type-id='type-id-149' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='360' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <var-decl name='m_omp_async_last_event_type' type-id='type-id-270' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='362' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='get_stream' mangled-name='_ZN17OffloadDescriptor10get_streamEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor10get_streamEv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <return type-id='type-id-197'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_stream' mangled-name='_ZN17OffloadDescriptor10set_streamEm' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor10set_streamEm'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-197'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD4Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-54' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorD2Ev'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-54' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorC4EiP15_Offload_statusbbP20OffloadHostTimerData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-284'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-286'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorC2EiP15_Offload_statusbbP20OffloadHostTimerData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorC2EiP15_Offload_statusbbP20OffloadHostTimerData'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-284'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-286'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='get_stream_in_dependencies' mangled-name='_ZN17OffloadDescriptor26get_stream_in_dependenciesERjRP8coievent' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor26get_stream_in_dependenciesERjRP8coievent'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-287'/>
          <parameter type-id='type-id-288'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='gen_var_descs_for_pointer_array' mangled-name='_ZN17OffloadDescriptor31gen_var_descs_for_pointer_arrayEi' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor31gen_var_descs_for_pointer_arrayEi'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='scatter_copyout_data' mangled-name='_ZN17OffloadDescriptor20scatter_copyout_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20scatter_copyout_dataEv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='receive_pointer_data' mangled-name='_ZN17OffloadDescriptor20receive_pointer_dataEbbPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20receive_pointer_dataEbbPv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='receive_noncontiguous_pointer_data' mangled-name='_ZN17OffloadDescriptor34receive_noncontiguous_pointer_dataEiP9coibufferP8coieventRmjS3_' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor34receive_noncontiguous_pointer_dataEiP9coibufferP8coieventRmjS3_'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-23'/>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-289'/>
          <parameter type-id='type-id-46'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='compute' mangled-name='_ZN17OffloadDescriptor7computeEPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor7computeEPv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='gather_copyin_data' mangled-name='_ZN17OffloadDescriptor18gather_copyin_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor18gather_copyin_dataEv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='send_pointer_data' mangled-name='_ZN17OffloadDescriptor17send_pointer_dataEbPv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor17send_pointer_dataEbPv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='send_noncontiguous_pointer_data' mangled-name='_ZN17OffloadDescriptor31send_noncontiguous_pointer_dataEiP7PtrDataS1_P8coieventRmjS3_' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor31send_noncontiguous_pointer_dataEiP7PtrDataS1_P8coieventRmjS3_'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-224'/>
          <parameter type-id='type-id-224'/>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-289'/>
          <parameter type-id='type-id-46'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='is_signaled' mangled-name='_ZN17OffloadDescriptor11is_signaledEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor11is_signaledEv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='cleanup' mangled-name='_ZN17OffloadDescriptor7cleanupEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor7cleanupEv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='offload_finish' mangled-name='_ZN17OffloadDescriptor14offload_finishEb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor14offload_finishEb'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-149'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='offload' mangled-name='_ZN17OffloadDescriptor7offloadEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor7offloadEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-282'/>
          <parameter type-id='type-id-290'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-198'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='offload_wrap' mangled-name='_ZN17OffloadDescriptor12offload_wrapEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor12offload_wrapEPKcbP7VarDescP8VarDesc2iPPKviS8_iS7_12OffloadFlags'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-282'/>
          <parameter type-id='type-id-290'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-198'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='wait_dependencies' mangled-name='_ZN17OffloadDescriptor17wait_dependenciesEPPKvim' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor17wait_dependenciesEPPKvim'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-151'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-197'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='register_omp_event_call_back' mangled-name='_ZN17OffloadDescriptor28register_omp_event_call_backEPK8coieventPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor28register_omp_event_call_backEPK8coieventPKv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setup_omp_async_info' mangled-name='_ZN17OffloadDescriptor20setup_omp_async_infoEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20setup_omp_async_infoEv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setup_misc_data' mangled-name='_ZN17OffloadDescriptor15setup_misc_dataEPKc' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor15setup_misc_dataEPKc'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-152'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='setup_descriptors' mangled-name='_ZN17OffloadDescriptor17setup_descriptorsEP7VarDescP8VarDesc2iiPKv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor17setup_descriptorsEP7VarDescP8VarDesc2iiPKv'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-282'/>
          <parameter type-id='type-id-290'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-150'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='offload_stack_memory_manager' mangled-name='_ZN17OffloadDescriptor28offload_stack_memory_managerEPKviiiPb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor28offload_stack_memory_managerEPKviiiPb'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-291'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='nullify_target_stack' mangled-name='_ZN17OffloadDescriptor20nullify_target_stackEP9coibufferm' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20nullify_target_stackEP9coibufferm'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-23'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_mic_address' mangled-name='_ZN17OffloadDescriptor16init_mic_addressEP7PtrData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor16init_mic_addressEP7PtrData'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-224'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='init_static_ptr_data' mangled-name='_ZN17OffloadDescriptor20init_static_ptr_dataEP7PtrData' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor20init_static_ptr_dataEP7PtrData'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-224'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='find_ptr_data' mangled-name='_ZN17OffloadDescriptor13find_ptr_dataERP7PtrDataPvllbb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor13find_ptr_dataERP7PtrDataPvllbb'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-292'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-184'/>
          <parameter type-id='type-id-184'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-149'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='alloc_ptr_data' mangled-name='_ZN17OffloadDescriptor14alloc_ptr_dataERP7PtrDataPvlllibbb' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor14alloc_ptr_dataERP7PtrDataPvlllibbb'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-292'/>
          <parameter type-id='type-id-150'/>
          <parameter type-id='type-id-184'/>
          <parameter type-id='type-id-184'/>
          <parameter type-id='type-id-184'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-149'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='translate_coi_error' mangled-name='_ZNK17OffloadDescriptor19translate_coi_errorE9COIRESULT' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17OffloadDescriptor19translate_coi_errorE9COIRESULT'>
          <parameter type-id='type-id-293' is-artificial='yes'/>
          <parameter type-id='type-id-32'/>
          <return type-id='type-id-192'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='report_coi_error' mangled-name='_ZN17OffloadDescriptor16report_coi_errorE11error_types9COIRESULT' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptor16report_coi_errorE11error_types9COIRESULT'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-188'/>
          <parameter type-id='type-id-32'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='get_timer_data' mangled-name='_ZNK17OffloadDescriptor14get_timer_dataEv' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17OffloadDescriptor14get_timer_dataEv'>
          <parameter type-id='type-id-293' is-artificial='yes'/>
          <return type-id='type-id-286'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~OffloadDescriptor' mangled-name='_ZN17OffloadDescriptorD2Ev' filepath='../../../gcc/liboffloadmic/runtime/offload_host.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17OffloadDescriptorD2Ev'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-54' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='OffloadTargetTimerData' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='43' column='1' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='frequency' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='phases' type-id='type-id-163' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='OffloadHostTimerData' size-in-bits='4160' is-struct='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='51' column='1' id='type-id-295'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='57' column='1' id='type-id-160'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='58' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='total' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='59' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='type-id-152' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='phases' type-id='type-id-161' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='sent_bytes' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='received_bytes' type-id='type-id-47' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='card_number' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='offload_number' type-id='type-id-54' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='target' type-id='type-id-294' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='next' type-id='type-id-286' visibility='default' filepath='../../../gcc/liboffloadmic/runtime/offload_timer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pid_t' type-id='type-id-54' filepath='/usr/include/bits/types.h' line='133' column='1' id='type-id-296'/>
    <typedef-decl name='pid_t' type-id='type-id-296' filepath='/usr/include/unistd.h' line='260' column='1' id='type-id-264'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-187'/>
    <reference-type-def kind='lvalue' type-id='type-id-232' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-234'/>
    <reference-type-def kind='lvalue' type-id='type-id-237' size-in-bits='64' id='type-id-263'/>
    <reference-type-def kind='lvalue' type-id='type-id-60' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-274'/>
    <reference-type-def kind='lvalue' type-id='type-id-242' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <reference-type-def kind='lvalue' type-id='type-id-257' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-262'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-286'/>
    <reference-type-def kind='lvalue' type-id='type-id-246' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-248'/>
    <reference-type-def kind='lvalue' type-id='type-id-218' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-224'/>
    <qualified-type-def type-id='type-id-224' const='yes' id='type-id-301'/>
    <reference-type-def kind='lvalue' type-id='type-id-301' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-303'/>
    <reference-type-def kind='lvalue' type-id='type-id-224' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-230'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-255'/>
    <reference-type-def kind='lvalue' type-id='type-id-238' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-315'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-319'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-325'/>
    <reference-type-def kind='lvalue' type-id='type-id-326' size-in-bits='64' id='type-id-327'/>
    <reference-type-def kind='lvalue' type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
    <reference-type-def kind='lvalue' type-id='type-id-330' size-in-bits='64' id='type-id-331'/>
    <reference-type-def kind='lvalue' type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <reference-type-def kind='lvalue' type-id='type-id-334' size-in-bits='64' id='type-id-335'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-337'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-339'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-341'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-343'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-353'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-357'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-359'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' id='type-id-361'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-363'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-367'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-369'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <reference-type-def kind='lvalue' type-id='type-id-149' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-291'/>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-372'/>
    <reference-type-def kind='lvalue' type-id='type-id-372' size-in-bits='64' id='type-id-373'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-374'/>
    <reference-type-def kind='lvalue' type-id='type-id-22' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-376'/>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-377'/>
    <reference-type-def kind='lvalue' type-id='type-id-377' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-233'/>
    <reference-type-def kind='lvalue' type-id='type-id-78' size-in-bits='64' id='type-id-268'/>
    <qualified-type-def type-id='type-id-242' const='yes' id='type-id-378'/>
    <reference-type-def kind='lvalue' type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-380'/>
    <qualified-type-def type-id='type-id-257' const='yes' id='type-id-381'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-267'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-219'/>
    <reference-type-def kind='lvalue' type-id='type-id-219' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-215'/>
    <qualified-type-def type-id='type-id-269' const='yes' id='type-id-382'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-293'/>
    <qualified-type-def type-id='type-id-246' const='yes' id='type-id-383'/>
    <reference-type-def kind='lvalue' type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-385'/>
    <qualified-type-def type-id='type-id-218' const='yes' id='type-id-386'/>
    <reference-type-def kind='lvalue' type-id='type-id-386' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-222'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-387'/>
    <reference-type-def kind='lvalue' type-id='type-id-387' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-388'/>
    <qualified-type-def type-id='type-id-306' const='yes' id='type-id-389'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-390'/>
    <qualified-type-def type-id='type-id-308' const='yes' id='type-id-391'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-392'/>
    <qualified-type-def type-id='type-id-310' const='yes' id='type-id-393'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-394'/>
    <qualified-type-def type-id='type-id-312' const='yes' id='type-id-395'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <qualified-type-def type-id='type-id-314' const='yes' id='type-id-397'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <qualified-type-def type-id='type-id-316' const='yes' id='type-id-399'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-400'/>
    <qualified-type-def type-id='type-id-318' const='yes' id='type-id-401'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-402'/>
    <qualified-type-def type-id='type-id-320' const='yes' id='type-id-403'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-404'/>
    <qualified-type-def type-id='type-id-322' const='yes' id='type-id-405'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-406'/>
    <qualified-type-def type-id='type-id-324' const='yes' id='type-id-407'/>
    <pointer-type-def type-id='type-id-407' size-in-bits='64' id='type-id-408'/>
    <qualified-type-def type-id='type-id-326' const='yes' id='type-id-409'/>
    <reference-type-def kind='lvalue' type-id='type-id-409' size-in-bits='64' id='type-id-410'/>
    <qualified-type-def type-id='type-id-328' const='yes' id='type-id-411'/>
    <reference-type-def kind='lvalue' type-id='type-id-411' size-in-bits='64' id='type-id-412'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-413'/>
    <reference-type-def kind='lvalue' type-id='type-id-413' size-in-bits='64' id='type-id-414'/>
    <qualified-type-def type-id='type-id-332' const='yes' id='type-id-415'/>
    <reference-type-def kind='lvalue' type-id='type-id-415' size-in-bits='64' id='type-id-416'/>
    <qualified-type-def type-id='type-id-334' const='yes' id='type-id-417'/>
    <reference-type-def kind='lvalue' type-id='type-id-417' size-in-bits='64' id='type-id-418'/>
    <qualified-type-def type-id='type-id-336' const='yes' id='type-id-419'/>
    <reference-type-def kind='lvalue' type-id='type-id-419' size-in-bits='64' id='type-id-420'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-421'/>
    <qualified-type-def type-id='type-id-338' const='yes' id='type-id-422'/>
    <reference-type-def kind='lvalue' type-id='type-id-422' size-in-bits='64' id='type-id-423'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-424'/>
    <qualified-type-def type-id='type-id-340' const='yes' id='type-id-425'/>
    <reference-type-def kind='lvalue' type-id='type-id-425' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-427'/>
    <qualified-type-def type-id='type-id-342' const='yes' id='type-id-428'/>
    <reference-type-def kind='lvalue' type-id='type-id-428' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' id='type-id-430'/>
    <qualified-type-def type-id='type-id-344' const='yes' id='type-id-431'/>
    <reference-type-def kind='lvalue' type-id='type-id-431' size-in-bits='64' id='type-id-432'/>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' id='type-id-433'/>
    <qualified-type-def type-id='type-id-346' const='yes' id='type-id-434'/>
    <reference-type-def kind='lvalue' type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-436'/>
    <qualified-type-def type-id='type-id-348' const='yes' id='type-id-437'/>
    <reference-type-def kind='lvalue' type-id='type-id-437' size-in-bits='64' id='type-id-438'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-439'/>
    <qualified-type-def type-id='type-id-350' const='yes' id='type-id-440'/>
    <reference-type-def kind='lvalue' type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-442'/>
    <qualified-type-def type-id='type-id-352' const='yes' id='type-id-443'/>
    <reference-type-def kind='lvalue' type-id='type-id-443' size-in-bits='64' id='type-id-444'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-445'/>
    <qualified-type-def type-id='type-id-354' const='yes' id='type-id-446'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-448'/>
    <qualified-type-def type-id='type-id-356' const='yes' id='type-id-449'/>
    <reference-type-def kind='lvalue' type-id='type-id-449' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' id='type-id-451'/>
    <qualified-type-def type-id='type-id-358' const='yes' id='type-id-452'/>
    <reference-type-def kind='lvalue' type-id='type-id-452' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-454'/>
    <qualified-type-def type-id='type-id-360' const='yes' id='type-id-455'/>
    <reference-type-def kind='lvalue' type-id='type-id-455' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-457'/>
    <qualified-type-def type-id='type-id-362' const='yes' id='type-id-458'/>
    <reference-type-def kind='lvalue' type-id='type-id-458' size-in-bits='64' id='type-id-459'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-460'/>
    <qualified-type-def type-id='type-id-364' const='yes' id='type-id-461'/>
    <reference-type-def kind='lvalue' type-id='type-id-461' size-in-bits='64' id='type-id-462'/>
    <pointer-type-def type-id='type-id-461' size-in-bits='64' id='type-id-463'/>
    <qualified-type-def type-id='type-id-366' const='yes' id='type-id-464'/>
    <reference-type-def kind='lvalue' type-id='type-id-464' size-in-bits='64' id='type-id-465'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' id='type-id-466'/>
    <qualified-type-def type-id='type-id-368' const='yes' id='type-id-467'/>
    <reference-type-def kind='lvalue' type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-469'/>
    <qualified-type-def type-id='type-id-370' const='yes' id='type-id-470'/>
    <reference-type-def kind='lvalue' type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-472'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-473'/>
    <qualified-type-def type-id='type-id-474' const='yes' id='type-id-475'/>
    <reference-type-def kind='lvalue' type-id='type-id-475' size-in-bits='64' id='type-id-476'/>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' id='type-id-477'/>
    <qualified-type-def type-id='type-id-478' const='yes' id='type-id-479'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <qualified-type-def type-id='type-id-481' const='yes' id='type-id-482'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <qualified-type-def type-id='type-id-484' const='yes' id='type-id-485'/>
    <reference-type-def kind='lvalue' type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <qualified-type-def type-id='type-id-487' const='yes' id='type-id-488'/>
    <reference-type-def kind='lvalue' type-id='type-id-488' size-in-bits='64' id='type-id-489'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' id='type-id-490'/>
    <qualified-type-def type-id='type-id-491' const='yes' id='type-id-492'/>
    <reference-type-def kind='lvalue' type-id='type-id-492' size-in-bits='64' id='type-id-493'/>
    <pointer-type-def type-id='type-id-492' size-in-bits='64' id='type-id-494'/>
    <qualified-type-def type-id='type-id-495' const='yes' id='type-id-496'/>
    <reference-type-def kind='lvalue' type-id='type-id-496' size-in-bits='64' id='type-id-497'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-498'/>
    <qualified-type-def type-id='type-id-499' const='yes' id='type-id-500'/>
    <reference-type-def kind='lvalue' type-id='type-id-500' size-in-bits='64' id='type-id-501'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-502'/>
    <qualified-type-def type-id='type-id-503' const='yes' id='type-id-504'/>
    <reference-type-def kind='lvalue' type-id='type-id-504' size-in-bits='64' id='type-id-505'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-506'/>
    <qualified-type-def type-id='type-id-507' const='yes' id='type-id-508'/>
    <pointer-type-def type-id='type-id-508' size-in-bits='64' id='type-id-509'/>
    <qualified-type-def type-id='type-id-510' const='yes' id='type-id-511'/>
    <reference-type-def kind='lvalue' type-id='type-id-511' size-in-bits='64' id='type-id-512'/>
    <pointer-type-def type-id='type-id-511' size-in-bits='64' id='type-id-513'/>
    <qualified-type-def type-id='type-id-514' const='yes' id='type-id-515'/>
    <reference-type-def kind='lvalue' type-id='type-id-515' size-in-bits='64' id='type-id-516'/>
    <qualified-type-def type-id='type-id-517' const='yes' id='type-id-518'/>
    <reference-type-def kind='lvalue' type-id='type-id-518' size-in-bits='64' id='type-id-519'/>
    <qualified-type-def type-id='type-id-520' const='yes' id='type-id-521'/>
    <reference-type-def kind='lvalue' type-id='type-id-521' size-in-bits='64' id='type-id-522'/>
    <qualified-type-def type-id='type-id-523' const='yes' id='type-id-524'/>
    <reference-type-def kind='lvalue' type-id='type-id-524' size-in-bits='64' id='type-id-525'/>
    <qualified-type-def type-id='type-id-526' const='yes' id='type-id-527'/>
    <reference-type-def kind='lvalue' type-id='type-id-527' size-in-bits='64' id='type-id-528'/>
    <pointer-type-def type-id='type-id-527' size-in-bits='64' id='type-id-529'/>
    <qualified-type-def type-id='type-id-530' const='yes' id='type-id-531'/>
    <reference-type-def kind='lvalue' type-id='type-id-531' size-in-bits='64' id='type-id-532'/>
    <qualified-type-def type-id='type-id-533' const='yes' id='type-id-534'/>
    <reference-type-def kind='lvalue' type-id='type-id-534' size-in-bits='64' id='type-id-535'/>
    <qualified-type-def type-id='type-id-536' const='yes' id='type-id-537'/>
    <reference-type-def kind='lvalue' type-id='type-id-537' size-in-bits='64' id='type-id-538'/>
    <qualified-type-def type-id='type-id-539' const='yes' id='type-id-540'/>
    <reference-type-def kind='lvalue' type-id='type-id-540' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-542' const='yes' id='type-id-543'/>
    <reference-type-def kind='lvalue' type-id='type-id-543' size-in-bits='64' id='type-id-544'/>
    <pointer-type-def type-id='type-id-543' size-in-bits='64' id='type-id-545'/>
    <qualified-type-def type-id='type-id-546' const='yes' id='type-id-547'/>
    <reference-type-def kind='lvalue' type-id='type-id-547' size-in-bits='64' id='type-id-548'/>
    <qualified-type-def type-id='type-id-549' const='yes' id='type-id-550'/>
    <reference-type-def kind='lvalue' type-id='type-id-550' size-in-bits='64' id='type-id-551'/>
    <qualified-type-def type-id='type-id-552' const='yes' id='type-id-553'/>
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-555' const='yes' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <qualified-type-def type-id='type-id-558' const='yes' id='type-id-559'/>
    <reference-type-def kind='lvalue' type-id='type-id-559' size-in-bits='64' id='type-id-560'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' id='type-id-561'/>
    <qualified-type-def type-id='type-id-562' const='yes' id='type-id-563'/>
    <reference-type-def kind='lvalue' type-id='type-id-563' size-in-bits='64' id='type-id-564'/>
    <qualified-type-def type-id='type-id-565' const='yes' id='type-id-566'/>
    <reference-type-def kind='lvalue' type-id='type-id-566' size-in-bits='64' id='type-id-567'/>
    <qualified-type-def type-id='type-id-568' const='yes' id='type-id-569'/>
    <reference-type-def kind='lvalue' type-id='type-id-569' size-in-bits='64' id='type-id-570'/>
    <qualified-type-def type-id='type-id-571' const='yes' id='type-id-572'/>
    <reference-type-def kind='lvalue' type-id='type-id-572' size-in-bits='64' id='type-id-573'/>
    <qualified-type-def type-id='type-id-574' const='yes' id='type-id-575'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-576'/>
    <qualified-type-def type-id='type-id-577' const='yes' id='type-id-578'/>
    <reference-type-def kind='lvalue' type-id='type-id-578' size-in-bits='64' id='type-id-579'/>
    <qualified-type-def type-id='type-id-580' const='yes' id='type-id-581'/>
    <reference-type-def kind='lvalue' type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <qualified-type-def type-id='type-id-583' const='yes' id='type-id-584'/>
    <pointer-type-def type-id='type-id-584' size-in-bits='64' id='type-id-585'/>
    <qualified-type-def type-id='type-id-586' const='yes' id='type-id-587'/>
    <reference-type-def kind='lvalue' type-id='type-id-587' size-in-bits='64' id='type-id-588'/>
    <qualified-type-def type-id='type-id-589' const='yes' id='type-id-590'/>
    <reference-type-def kind='lvalue' type-id='type-id-590' size-in-bits='64' id='type-id-591'/>
    <qualified-type-def type-id='type-id-592' const='yes' id='type-id-593'/>
    <pointer-type-def type-id='type-id-593' size-in-bits='64' id='type-id-594'/>
    <qualified-type-def type-id='type-id-595' const='yes' id='type-id-596'/>
    <reference-type-def kind='lvalue' type-id='type-id-596' size-in-bits='64' id='type-id-597'/>
    <qualified-type-def type-id='type-id-598' const='yes' id='type-id-599'/>
    <reference-type-def kind='lvalue' type-id='type-id-599' size-in-bits='64' id='type-id-600'/>
    <qualified-type-def type-id='type-id-601' const='yes' id='type-id-602'/>
    <pointer-type-def type-id='type-id-602' size-in-bits='64' id='type-id-603'/>
    <qualified-type-def type-id='type-id-604' const='yes' id='type-id-605'/>
    <reference-type-def kind='lvalue' type-id='type-id-605' size-in-bits='64' id='type-id-606'/>
    <qualified-type-def type-id='type-id-607' const='yes' id='type-id-608'/>
    <reference-type-def kind='lvalue' type-id='type-id-608' size-in-bits='64' id='type-id-609'/>
    <qualified-type-def type-id='type-id-610' const='yes' id='type-id-611'/>
    <pointer-type-def type-id='type-id-611' size-in-bits='64' id='type-id-612'/>
    <qualified-type-def type-id='type-id-613' const='yes' id='type-id-614'/>
    <reference-type-def kind='lvalue' type-id='type-id-614' size-in-bits='64' id='type-id-615'/>
    <qualified-type-def type-id='type-id-616' const='yes' id='type-id-617'/>
    <pointer-type-def type-id='type-id-617' size-in-bits='64' id='type-id-618'/>
    <qualified-type-def type-id='type-id-619' const='yes' id='type-id-620'/>
    <reference-type-def kind='lvalue' type-id='type-id-620' size-in-bits='64' id='type-id-621'/>
    <qualified-type-def type-id='type-id-622' const='yes' id='type-id-623'/>
    <pointer-type-def type-id='type-id-623' size-in-bits='64' id='type-id-624'/>
    <qualified-type-def type-id='type-id-625' const='yes' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-627'/>
    <qualified-type-def type-id='type-id-628' const='yes' id='type-id-629'/>
    <pointer-type-def type-id='type-id-629' size-in-bits='64' id='type-id-630'/>
    <qualified-type-def type-id='type-id-631' const='yes' id='type-id-632'/>
    <reference-type-def kind='lvalue' type-id='type-id-632' size-in-bits='64' id='type-id-633'/>
    <qualified-type-def type-id='type-id-634' const='yes' id='type-id-635'/>
    <reference-type-def kind='lvalue' type-id='type-id-635' size-in-bits='64' id='type-id-636'/>
    <pointer-type-def type-id='type-id-635' size-in-bits='64' id='type-id-637'/>
    <qualified-type-def type-id='type-id-638' const='yes' id='type-id-639'/>
    <reference-type-def kind='lvalue' type-id='type-id-639' size-in-bits='64' id='type-id-640'/>
    <pointer-type-def type-id='type-id-639' size-in-bits='64' id='type-id-641'/>
    <qualified-type-def type-id='type-id-642' const='yes' id='type-id-643'/>
    <reference-type-def kind='lvalue' type-id='type-id-643' size-in-bits='64' id='type-id-644'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' id='type-id-645'/>
    <qualified-type-def type-id='type-id-646' const='yes' id='type-id-647'/>
    <reference-type-def kind='lvalue' type-id='type-id-647' size-in-bits='64' id='type-id-648'/>
    <pointer-type-def type-id='type-id-647' size-in-bits='64' id='type-id-649'/>
    <qualified-type-def type-id='type-id-650' const='yes' id='type-id-651'/>
    <pointer-type-def type-id='type-id-651' size-in-bits='64' id='type-id-652'/>
    <qualified-type-def type-id='type-id-653' const='yes' id='type-id-654'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' id='type-id-655'/>
    <qualified-type-def type-id='type-id-656' const='yes' id='type-id-657'/>
    <reference-type-def kind='lvalue' type-id='type-id-657' size-in-bits='64' id='type-id-658'/>
    <qualified-type-def type-id='type-id-659' const='yes' id='type-id-660'/>
    <pointer-type-def type-id='type-id-660' size-in-bits='64' id='type-id-661'/>
    <qualified-type-def type-id='type-id-662' const='yes' id='type-id-663'/>
    <reference-type-def kind='lvalue' type-id='type-id-663' size-in-bits='64' id='type-id-664'/>
    <qualified-type-def type-id='type-id-665' const='yes' id='type-id-666'/>
    <pointer-type-def type-id='type-id-666' size-in-bits='64' id='type-id-667'/>
    <qualified-type-def type-id='type-id-668' const='yes' id='type-id-669'/>
    <reference-type-def kind='lvalue' type-id='type-id-669' size-in-bits='64' id='type-id-670'/>
    <qualified-type-def type-id='type-id-671' const='yes' id='type-id-672'/>
    <pointer-type-def type-id='type-id-672' size-in-bits='64' id='type-id-673'/>
    <qualified-type-def type-id='type-id-674' const='yes' id='type-id-675'/>
    <reference-type-def kind='lvalue' type-id='type-id-675' size-in-bits='64' id='type-id-676'/>
    <qualified-type-def type-id='type-id-677' const='yes' id='type-id-678'/>
    <pointer-type-def type-id='type-id-678' size-in-bits='64' id='type-id-679'/>
    <qualified-type-def type-id='type-id-680' const='yes' id='type-id-681'/>
    <reference-type-def kind='lvalue' type-id='type-id-681' size-in-bits='64' id='type-id-682'/>
    <qualified-type-def type-id='type-id-244' const='yes' id='type-id-683'/>
    <reference-type-def kind='lvalue' type-id='type-id-683' size-in-bits='64' id='type-id-684'/>
    <pointer-type-def type-id='type-id-683' size-in-bits='64' id='type-id-685'/>
    <qualified-type-def type-id='type-id-686' const='yes' id='type-id-687'/>
    <reference-type-def kind='lvalue' type-id='type-id-687' size-in-bits='64' id='type-id-688'/>
    <qualified-type-def type-id='type-id-689' const='yes' id='type-id-690'/>
    <reference-type-def kind='lvalue' type-id='type-id-690' size-in-bits='64' id='type-id-691'/>
    <qualified-type-def type-id='type-id-249' const='yes' id='type-id-692'/>
    <reference-type-def kind='lvalue' type-id='type-id-692' size-in-bits='64' id='type-id-693'/>
    <pointer-type-def type-id='type-id-692' size-in-bits='64' id='type-id-694'/>
    <qualified-type-def type-id='type-id-695' const='yes' id='type-id-696'/>
    <reference-type-def kind='lvalue' type-id='type-id-696' size-in-bits='64' id='type-id-697'/>
    <qualified-type-def type-id='type-id-698' const='yes' id='type-id-699'/>
    <reference-type-def kind='lvalue' type-id='type-id-699' size-in-bits='64' id='type-id-700'/>
    <qualified-type-def type-id='type-id-225' const='yes' id='type-id-701'/>
    <reference-type-def kind='lvalue' type-id='type-id-701' size-in-bits='64' id='type-id-702'/>
    <pointer-type-def type-id='type-id-701' size-in-bits='64' id='type-id-703'/>
    <qualified-type-def type-id='type-id-704' const='yes' id='type-id-705'/>
    <reference-type-def kind='lvalue' type-id='type-id-705' size-in-bits='64' id='type-id-706'/>
    <qualified-type-def type-id='type-id-707' const='yes' id='type-id-708'/>
    <reference-type-def kind='lvalue' type-id='type-id-708' size-in-bits='64' id='type-id-709'/>
    <qualified-type-def type-id='type-id-240' const='yes' id='type-id-710'/>
    <reference-type-def kind='lvalue' type-id='type-id-710' size-in-bits='64' id='type-id-711'/>
    <pointer-type-def type-id='type-id-710' size-in-bits='64' id='type-id-712'/>
    <qualified-type-def type-id='type-id-713' const='yes' id='type-id-714'/>
    <reference-type-def kind='lvalue' type-id='type-id-714' size-in-bits='64' id='type-id-715'/>
    <qualified-type-def type-id='type-id-716' const='yes' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-717' size-in-bits='64' id='type-id-718'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-719'/>
    <reference-type-def kind='lvalue' type-id='type-id-719' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-719' size-in-bits='64' id='type-id-720'/>
    <qualified-type-def type-id='type-id-721' const='yes' id='type-id-722'/>
    <reference-type-def kind='lvalue' type-id='type-id-722' size-in-bits='64' id='type-id-723'/>
    <qualified-type-def type-id='type-id-724' const='yes' id='type-id-725'/>
    <reference-type-def kind='lvalue' type-id='type-id-725' size-in-bits='64' id='type-id-726'/>
    <qualified-type-def type-id='type-id-727' const='yes' id='type-id-728'/>
    <pointer-type-def type-id='type-id-728' size-in-bits='64' id='type-id-729'/>
    <qualified-type-def type-id='type-id-730' const='yes' id='type-id-731'/>
    <reference-type-def kind='lvalue' type-id='type-id-731' size-in-bits='64' id='type-id-732'/>
    <qualified-type-def type-id='type-id-733' const='yes' id='type-id-734'/>
    <reference-type-def kind='lvalue' type-id='type-id-734' size-in-bits='64' id='type-id-735'/>
    <qualified-type-def type-id='type-id-736' const='yes' id='type-id-737'/>
    <reference-type-def kind='lvalue' type-id='type-id-737' size-in-bits='64' id='type-id-738'/>
    <qualified-type-def type-id='type-id-739' const='yes' id='type-id-740'/>
    <reference-type-def kind='lvalue' type-id='type-id-740' size-in-bits='64' id='type-id-741'/>
    <qualified-type-def type-id='type-id-742' const='yes' id='type-id-743'/>
    <reference-type-def kind='lvalue' type-id='type-id-743' size-in-bits='64' id='type-id-744'/>
    <qualified-type-def type-id='type-id-745' const='yes' id='type-id-746'/>
    <reference-type-def kind='lvalue' type-id='type-id-746' size-in-bits='64' id='type-id-747'/>
    <qualified-type-def type-id='type-id-748' const='yes' id='type-id-749'/>
    <reference-type-def kind='lvalue' type-id='type-id-749' size-in-bits='64' id='type-id-750'/>
    <qualified-type-def type-id='type-id-751' const='yes' id='type-id-752'/>
    <reference-type-def kind='lvalue' type-id='type-id-752' size-in-bits='64' id='type-id-753'/>
    <qualified-type-def type-id='type-id-754' const='yes' id='type-id-755'/>
    <reference-type-def kind='lvalue' type-id='type-id-755' size-in-bits='64' id='type-id-756'/>
    <qualified-type-def type-id='type-id-757' const='yes' id='type-id-758'/>
    <reference-type-def kind='lvalue' type-id='type-id-758' size-in-bits='64' id='type-id-759'/>
    <qualified-type-def type-id='type-id-760' const='yes' id='type-id-761'/>
    <reference-type-def kind='lvalue' type-id='type-id-761' size-in-bits='64' id='type-id-762'/>
    <qualified-type-def type-id='type-id-763' const='yes' id='type-id-764'/>
    <reference-type-def kind='lvalue' type-id='type-id-764' size-in-bits='64' id='type-id-765'/>
    <qualified-type-def type-id='type-id-766' const='yes' id='type-id-767'/>
    <reference-type-def kind='lvalue' type-id='type-id-767' size-in-bits='64' id='type-id-768'/>
    <qualified-type-def type-id='type-id-769' const='yes' id='type-id-770'/>
    <reference-type-def kind='lvalue' type-id='type-id-770' size-in-bits='64' id='type-id-771'/>
    <qualified-type-def type-id='type-id-772' const='yes' id='type-id-773'/>
    <reference-type-def kind='lvalue' type-id='type-id-773' size-in-bits='64' id='type-id-774'/>
    <qualified-type-def type-id='type-id-775' const='yes' id='type-id-776'/>
    <reference-type-def kind='lvalue' type-id='type-id-776' size-in-bits='64' id='type-id-777'/>
    <qualified-type-def type-id='type-id-778' const='yes' id='type-id-779'/>
    <reference-type-def kind='lvalue' type-id='type-id-779' size-in-bits='64' id='type-id-780'/>
    <qualified-type-def type-id='type-id-781' const='yes' id='type-id-782'/>
    <reference-type-def kind='lvalue' type-id='type-id-782' size-in-bits='64' id='type-id-783'/>
    <qualified-type-def type-id='type-id-254' const='yes' id='type-id-784'/>
    <reference-type-def kind='lvalue' type-id='type-id-784' size-in-bits='64' id='type-id-785'/>
    <pointer-type-def type-id='type-id-784' size-in-bits='64' id='type-id-786'/>
    <qualified-type-def type-id='type-id-787' const='yes' id='type-id-788'/>
    <pointer-type-def type-id='type-id-788' size-in-bits='64' id='type-id-789'/>
    <qualified-type-def type-id='type-id-790' const='yes' id='type-id-791'/>
    <pointer-type-def type-id='type-id-791' size-in-bits='64' id='type-id-792'/>
    <qualified-type-def type-id='type-id-793' const='yes' id='type-id-794'/>
    <pointer-type-def type-id='type-id-794' size-in-bits='64' id='type-id-795'/>
    <qualified-type-def type-id='type-id-796' const='yes' id='type-id-797'/>
    <reference-type-def kind='lvalue' type-id='type-id-797' size-in-bits='64' id='type-id-798'/>
    <pointer-type-def type-id='type-id-797' size-in-bits='64' id='type-id-799'/>
    <qualified-type-def type-id='type-id-800' const='yes' id='type-id-801'/>
    <reference-type-def kind='lvalue' type-id='type-id-801' size-in-bits='64' id='type-id-802'/>
    <pointer-type-def type-id='type-id-801' size-in-bits='64' id='type-id-803'/>
    <qualified-type-def type-id='type-id-804' const='yes' id='type-id-805'/>
    <reference-type-def kind='lvalue' type-id='type-id-805' size-in-bits='64' id='type-id-806'/>
    <pointer-type-def type-id='type-id-805' size-in-bits='64' id='type-id-807'/>
    <qualified-type-def type-id='type-id-808' const='yes' id='type-id-809'/>
    <reference-type-def kind='lvalue' type-id='type-id-809' size-in-bits='64' id='type-id-810'/>
    <pointer-type-def type-id='type-id-809' size-in-bits='64' id='type-id-811'/>
    <qualified-type-def type-id='type-id-252' const='yes' id='type-id-812'/>
    <reference-type-def kind='lvalue' type-id='type-id-812' size-in-bits='64' id='type-id-813'/>
    <pointer-type-def type-id='type-id-812' size-in-bits='64' id='type-id-814'/>
    <qualified-type-def type-id='type-id-815' const='yes' id='type-id-816'/>
    <reference-type-def kind='lvalue' type-id='type-id-816' size-in-bits='64' id='type-id-817'/>
    <qualified-type-def type-id='type-id-818' const='yes' id='type-id-819'/>
    <reference-type-def kind='lvalue' type-id='type-id-819' size-in-bits='64' id='type-id-820'/>
    <qualified-type-def type-id='type-id-821' const='yes' id='type-id-822'/>
    <reference-type-def kind='lvalue' type-id='type-id-822' size-in-bits='64' id='type-id-823'/>
    <qualified-type-def type-id='type-id-824' const='yes' id='type-id-825'/>
    <reference-type-def kind='lvalue' type-id='type-id-825' size-in-bits='64' id='type-id-826'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-827'/>
    <reference-type-def kind='lvalue' type-id='type-id-827' size-in-bits='64' id='type-id-828'/>
    <pointer-type-def type-id='type-id-827' size-in-bits='64' id='type-id-829'/>
    <qualified-type-def type-id='type-id-830' const='yes' id='type-id-831'/>
    <reference-type-def kind='lvalue' type-id='type-id-831' size-in-bits='64' id='type-id-832'/>
    <qualified-type-def type-id='type-id-833' const='yes' id='type-id-834'/>
    <reference-type-def kind='lvalue' type-id='type-id-834' size-in-bits='64' id='type-id-835'/>
    <qualified-type-def type-id='type-id-836' const='yes' id='type-id-837'/>
    <reference-type-def kind='lvalue' type-id='type-id-837' size-in-bits='64' id='type-id-838'/>
    <qualified-type-def type-id='type-id-839' const='yes' id='type-id-840'/>
    <reference-type-def kind='lvalue' type-id='type-id-840' size-in-bits='64' id='type-id-841'/>
    <qualified-type-def type-id='type-id-842' const='yes' id='type-id-843'/>
    <reference-type-def kind='lvalue' type-id='type-id-843' size-in-bits='64' id='type-id-844'/>
    <pointer-type-def type-id='type-id-843' size-in-bits='64' id='type-id-845'/>
    <qualified-type-def type-id='type-id-846' const='yes' id='type-id-847'/>
    <reference-type-def kind='lvalue' type-id='type-id-847' size-in-bits='64' id='type-id-848'/>
    <qualified-type-def type-id='type-id-849' const='yes' id='type-id-850'/>
    <reference-type-def kind='lvalue' type-id='type-id-850' size-in-bits='64' id='type-id-851'/>
    <qualified-type-def type-id='type-id-852' const='yes' id='type-id-853'/>
    <reference-type-def kind='lvalue' type-id='type-id-853' size-in-bits='64' id='type-id-854'/>
    <qualified-type-def type-id='type-id-855' const='yes' id='type-id-856'/>
    <reference-type-def kind='lvalue' type-id='type-id-856' size-in-bits='64' id='type-id-857'/>
    <qualified-type-def type-id='type-id-858' const='yes' id='type-id-859'/>
    <reference-type-def kind='lvalue' type-id='type-id-859' size-in-bits='64' id='type-id-860'/>
    <qualified-type-def type-id='type-id-861' const='yes' id='type-id-862'/>
    <reference-type-def kind='lvalue' type-id='type-id-862' size-in-bits='64' id='type-id-863'/>
    <pointer-type-def type-id='type-id-862' size-in-bits='64' id='type-id-864'/>
    <qualified-type-def type-id='type-id-236' const='yes' id='type-id-865'/>
    <reference-type-def kind='lvalue' type-id='type-id-865' size-in-bits='64' id='type-id-866'/>
    <pointer-type-def type-id='type-id-865' size-in-bits='64' id='type-id-867'/>
    <qualified-type-def type-id='type-id-868' const='yes' id='type-id-869'/>
    <reference-type-def kind='lvalue' type-id='type-id-869' size-in-bits='64' id='type-id-870'/>
    <qualified-type-def type-id='type-id-871' const='yes' id='type-id-872'/>
    <reference-type-def kind='lvalue' type-id='type-id-872' size-in-bits='64' id='type-id-873'/>
    <qualified-type-def type-id='type-id-874' const='yes' id='type-id-875'/>
    <reference-type-def kind='lvalue' type-id='type-id-875' size-in-bits='64' id='type-id-876'/>
    <qualified-type-def type-id='type-id-228' const='yes' id='type-id-877'/>
    <reference-type-def kind='lvalue' type-id='type-id-877' size-in-bits='64' id='type-id-878'/>
    <pointer-type-def type-id='type-id-877' size-in-bits='64' id='type-id-879'/>
    <qualified-type-def type-id='type-id-880' const='yes' id='type-id-881'/>
    <reference-type-def kind='lvalue' type-id='type-id-881' size-in-bits='64' id='type-id-882'/>
    <qualified-type-def type-id='type-id-883' const='yes' id='type-id-884'/>
    <reference-type-def kind='lvalue' type-id='type-id-884' size-in-bits='64' id='type-id-885'/>
    <qualified-type-def type-id='type-id-886' const='yes' id='type-id-887'/>
    <reference-type-def kind='lvalue' type-id='type-id-887' size-in-bits='64' id='type-id-888'/>
    <reference-type-def kind='lvalue' type-id='type-id-889' size-in-bits='64' id='type-id-890'/>
    <pointer-type-def type-id='type-id-889' size-in-bits='64' id='type-id-891'/>
    <pointer-type-def type-id='type-id-474' size-in-bits='64' id='type-id-892'/>
    <reference-type-def kind='lvalue' type-id='type-id-478' size-in-bits='64' id='type-id-893'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-894'/>
    <reference-type-def kind='lvalue' type-id='type-id-484' size-in-bits='64' id='type-id-895'/>
    <reference-type-def kind='lvalue' type-id='type-id-487' size-in-bits='64' id='type-id-896'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' id='type-id-897'/>
    <reference-type-def kind='lvalue' type-id='type-id-491' size-in-bits='64' id='type-id-898'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' id='type-id-899'/>
    <reference-type-def kind='lvalue' type-id='type-id-495' size-in-bits='64' id='type-id-900'/>
    <pointer-type-def type-id='type-id-495' size-in-bits='64' id='type-id-901'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' id='type-id-902'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-903'/>
    <reference-type-def kind='lvalue' type-id='type-id-503' size-in-bits='64' id='type-id-904'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-905'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-906'/>
    <reference-type-def kind='lvalue' type-id='type-id-510' size-in-bits='64' id='type-id-907'/>
    <pointer-type-def type-id='type-id-510' size-in-bits='64' id='type-id-908'/>
    <reference-type-def kind='lvalue' type-id='type-id-909' size-in-bits='64' id='type-id-910'/>
    <reference-type-def kind='lvalue' type-id='type-id-514' size-in-bits='64' id='type-id-911'/>
    <pointer-type-def type-id='type-id-912' size-in-bits='64' id='type-id-913'/>
    <reference-type-def kind='lvalue' type-id='type-id-526' size-in-bits='64' id='type-id-914'/>
    <pointer-type-def type-id='type-id-526' size-in-bits='64' id='type-id-915'/>
    <reference-type-def kind='lvalue' type-id='type-id-916' size-in-bits='64' id='type-id-917'/>
    <reference-type-def kind='lvalue' type-id='type-id-530' size-in-bits='64' id='type-id-918'/>
    <pointer-type-def type-id='type-id-919' size-in-bits='64' id='type-id-920'/>
    <reference-type-def kind='lvalue' type-id='type-id-542' size-in-bits='64' id='type-id-921'/>
    <pointer-type-def type-id='type-id-542' size-in-bits='64' id='type-id-922'/>
    <reference-type-def kind='lvalue' type-id='type-id-923' size-in-bits='64' id='type-id-924'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-925'/>
    <pointer-type-def type-id='type-id-926' size-in-bits='64' id='type-id-927'/>
    <reference-type-def kind='lvalue' type-id='type-id-558' size-in-bits='64' id='type-id-928'/>
    <pointer-type-def type-id='type-id-558' size-in-bits='64' id='type-id-929'/>
    <reference-type-def kind='lvalue' type-id='type-id-930' size-in-bits='64' id='type-id-931'/>
    <reference-type-def kind='lvalue' type-id='type-id-562' size-in-bits='64' id='type-id-932'/>
    <pointer-type-def type-id='type-id-933' size-in-bits='64' id='type-id-934'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-935'/>
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' id='type-id-936'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' id='type-id-937'/>
    <reference-type-def kind='lvalue' type-id='type-id-586' size-in-bits='64' id='type-id-938'/>
    <pointer-type-def type-id='type-id-592' size-in-bits='64' id='type-id-939'/>
    <reference-type-def kind='lvalue' type-id='type-id-595' size-in-bits='64' id='type-id-940'/>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' id='type-id-941'/>
    <reference-type-def kind='lvalue' type-id='type-id-604' size-in-bits='64' id='type-id-942'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-943'/>
    <reference-type-def kind='lvalue' type-id='type-id-613' size-in-bits='64' id='type-id-944'/>
    <pointer-type-def type-id='type-id-616' size-in-bits='64' id='type-id-945'/>
    <reference-type-def kind='lvalue' type-id='type-id-619' size-in-bits='64' id='type-id-946'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' id='type-id-947'/>
    <reference-type-def kind='lvalue' type-id='type-id-625' size-in-bits='64' id='type-id-948'/>
    <pointer-type-def type-id='type-id-628' size-in-bits='64' id='type-id-949'/>
    <reference-type-def kind='lvalue' type-id='type-id-631' size-in-bits='64' id='type-id-950'/>
    <reference-type-def kind='lvalue' type-id='type-id-634' size-in-bits='64' id='type-id-951'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' id='type-id-952'/>
    <reference-type-def kind='lvalue' type-id='type-id-638' size-in-bits='64' id='type-id-953'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' id='type-id-954'/>
    <reference-type-def kind='lvalue' type-id='type-id-642' size-in-bits='64' id='type-id-955'/>
    <pointer-type-def type-id='type-id-642' size-in-bits='64' id='type-id-956'/>
    <reference-type-def kind='lvalue' type-id='type-id-646' size-in-bits='64' id='type-id-957'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' id='type-id-958'/>
    <pointer-type-def type-id='type-id-650' size-in-bits='64' id='type-id-959'/>
    <reference-type-def kind='lvalue' type-id='type-id-653' size-in-bits='64' id='type-id-960'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' id='type-id-961'/>
    <pointer-type-def type-id='type-id-962' size-in-bits='64' id='type-id-963'/>
    <reference-type-def kind='lvalue' type-id='type-id-656' size-in-bits='64' id='type-id-964'/>
    <reference-type-def kind='lvalue' type-id='type-id-659' size-in-bits='64' id='type-id-965'/>
    <pointer-type-def type-id='type-id-659' size-in-bits='64' id='type-id-966'/>
    <pointer-type-def type-id='type-id-967' size-in-bits='64' id='type-id-968'/>
    <reference-type-def kind='lvalue' type-id='type-id-662' size-in-bits='64' id='type-id-969'/>
    <reference-type-def kind='lvalue' type-id='type-id-665' size-in-bits='64' id='type-id-970'/>
    <pointer-type-def type-id='type-id-665' size-in-bits='64' id='type-id-971'/>
    <pointer-type-def type-id='type-id-972' size-in-bits='64' id='type-id-973'/>
    <reference-type-def kind='lvalue' type-id='type-id-668' size-in-bits='64' id='type-id-974'/>
    <reference-type-def kind='lvalue' type-id='type-id-671' size-in-bits='64' id='type-id-975'/>
    <pointer-type-def type-id='type-id-671' size-in-bits='64' id='type-id-976'/>
    <pointer-type-def type-id='type-id-977' size-in-bits='64' id='type-id-978'/>
    <reference-type-def kind='lvalue' type-id='type-id-674' size-in-bits='64' id='type-id-979'/>
    <reference-type-def kind='lvalue' type-id='type-id-677' size-in-bits='64' id='type-id-980'/>
    <pointer-type-def type-id='type-id-677' size-in-bits='64' id='type-id-981'/>
    <pointer-type-def type-id='type-id-982' size-in-bits='64' id='type-id-983'/>
    <reference-type-def kind='lvalue' type-id='type-id-680' size-in-bits='64' id='type-id-984'/>
    <reference-type-def kind='lvalue' type-id='type-id-244' size-in-bits='64' id='type-id-985'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-986'/>
    <reference-type-def kind='lvalue' type-id='type-id-987' size-in-bits='64' id='type-id-988'/>
    <reference-type-def kind='lvalue' type-id='type-id-689' size-in-bits='64' id='type-id-989'/>
    <reference-type-def kind='lvalue' type-id='type-id-249' size-in-bits='64' id='type-id-990'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-991'/>
    <reference-type-def kind='lvalue' type-id='type-id-992' size-in-bits='64' id='type-id-993'/>
    <reference-type-def kind='lvalue' type-id='type-id-698' size-in-bits='64' id='type-id-994'/>
    <reference-type-def kind='lvalue' type-id='type-id-225' size-in-bits='64' id='type-id-995'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-996'/>
    <reference-type-def kind='lvalue' type-id='type-id-997' size-in-bits='64' id='type-id-998'/>
    <reference-type-def kind='lvalue' type-id='type-id-707' size-in-bits='64' id='type-id-999'/>
    <reference-type-def kind='lvalue' type-id='type-id-240' size-in-bits='64' id='type-id-1000'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-1001'/>
    <reference-type-def kind='lvalue' type-id='type-id-1002' size-in-bits='64' id='type-id-1003'/>
    <reference-type-def kind='lvalue' type-id='type-id-716' size-in-bits='64' id='type-id-1004'/>
    <reference-type-def kind='lvalue' type-id='type-id-271' size-in-bits='64' id='type-id-1005'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-1006'/>
    <reference-type-def kind='lvalue' type-id='type-id-1007' size-in-bits='64' id='type-id-1008'/>
    <reference-type-def kind='lvalue' type-id='type-id-724' size-in-bits='64' id='type-id-1009'/>
    <reference-type-def kind='lvalue' type-id='type-id-727' size-in-bits='64' id='type-id-1010'/>
    <pointer-type-def type-id='type-id-727' size-in-bits='64' id='type-id-1011'/>
    <reference-type-def kind='lvalue' type-id='type-id-730' size-in-bits='64' id='type-id-1012'/>
    <pointer-type-def type-id='type-id-730' size-in-bits='64' id='type-id-1013'/>
    <reference-type-def kind='lvalue' type-id='type-id-733' size-in-bits='64' id='type-id-1014'/>
    <pointer-type-def type-id='type-id-733' size-in-bits='64' id='type-id-1015'/>
    <reference-type-def kind='lvalue' type-id='type-id-736' size-in-bits='64' id='type-id-1016'/>
    <pointer-type-def type-id='type-id-736' size-in-bits='64' id='type-id-1017'/>
    <reference-type-def kind='lvalue' type-id='type-id-739' size-in-bits='64' id='type-id-1018'/>
    <pointer-type-def type-id='type-id-739' size-in-bits='64' id='type-id-1019'/>
    <reference-type-def kind='lvalue' type-id='type-id-742' size-in-bits='64' id='type-id-1020'/>
    <pointer-type-def type-id='type-id-742' size-in-bits='64' id='type-id-1021'/>
    <reference-type-def kind='lvalue' type-id='type-id-745' size-in-bits='64' id='type-id-1022'/>
    <pointer-type-def type-id='type-id-745' size-in-bits='64' id='type-id-1023'/>
    <reference-type-def kind='lvalue' type-id='type-id-748' size-in-bits='64' id='type-id-1024'/>
    <pointer-type-def type-id='type-id-748' size-in-bits='64' id='type-id-1025'/>
    <reference-type-def kind='lvalue' type-id='type-id-751' size-in-bits='64' id='type-id-1026'/>
    <pointer-type-def type-id='type-id-751' size-in-bits='64' id='type-id-1027'/>
    <reference-type-def kind='lvalue' type-id='type-id-754' size-in-bits='64' id='type-id-1028'/>
    <pointer-type-def type-id='type-id-754' size-in-bits='64' id='type-id-1029'/>
    <reference-type-def kind='lvalue' type-id='type-id-757' size-in-bits='64' id='type-id-1030'/>
    <pointer-type-def type-id='type-id-757' size-in-bits='64' id='type-id-1031'/>
    <reference-type-def kind='lvalue' type-id='type-id-760' size-in-bits='64' id='type-id-1032'/>
    <pointer-type-def type-id='type-id-760' size-in-bits='64' id='type-id-1033'/>
    <reference-type-def kind='lvalue' type-id='type-id-763' size-in-bits='64' id='type-id-1034'/>
    <pointer-type-def type-id='type-id-763' size-in-bits='64' id='type-id-1035'/>
    <pointer-type-def type-id='type-id-766' size-in-bits='64' id='type-id-1036'/>
    <pointer-type-def type-id='type-id-769' size-in-bits='64' id='type-id-1037'/>
    <pointer-type-def type-id='type-id-772' size-in-bits='64' id='type-id-1038'/>
    <pointer-type-def type-id='type-id-775' size-in-bits='64' id='type-id-1039'/>
    <reference-type-def kind='lvalue' type-id='type-id-778' size-in-bits='64' id='type-id-1040'/>
    <pointer-type-def type-id='type-id-778' size-in-bits='64' id='type-id-1041'/>
    <reference-type-def kind='lvalue' type-id='type-id-781' size-in-bits='64' id='type-id-1042'/>
    <pointer-type-def type-id='type-id-781' size-in-bits='64' id='type-id-1043'/>
    <reference-type-def kind='lvalue' type-id='type-id-254' size-in-bits='64' id='type-id-1044'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-1045'/>
    <pointer-type-def type-id='type-id-787' size-in-bits='64' id='type-id-1046'/>
    <pointer-type-def type-id='type-id-790' size-in-bits='64' id='type-id-1047'/>
    <pointer-type-def type-id='type-id-793' size-in-bits='64' id='type-id-1048'/>
    <reference-type-def kind='lvalue' type-id='type-id-252' size-in-bits='64' id='type-id-1049'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-1050'/>
    <reference-type-def kind='lvalue' type-id='type-id-818' size-in-bits='64' id='type-id-1051'/>
    <reference-type-def kind='lvalue' type-id='type-id-821' size-in-bits='64' id='type-id-1052'/>
    <reference-type-def kind='lvalue' type-id='type-id-258' size-in-bits='64' id='type-id-1053'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-1054'/>
    <reference-type-def kind='lvalue' type-id='type-id-833' size-in-bits='64' id='type-id-1055'/>
    <reference-type-def kind='lvalue' type-id='type-id-836' size-in-bits='64' id='type-id-1056'/>
    <reference-type-def kind='lvalue' type-id='type-id-842' size-in-bits='64' id='type-id-1057'/>
    <pointer-type-def type-id='type-id-842' size-in-bits='64' id='type-id-1058'/>
    <reference-type-def kind='lvalue' type-id='type-id-846' size-in-bits='64' id='type-id-1059'/>
    <pointer-type-def type-id='type-id-846' size-in-bits='64' id='type-id-1060'/>
    <reference-type-def kind='lvalue' type-id='type-id-849' size-in-bits='64' id='type-id-1061'/>
    <pointer-type-def type-id='type-id-849' size-in-bits='64' id='type-id-1062'/>
    <reference-type-def kind='lvalue' type-id='type-id-852' size-in-bits='64' id='type-id-1063'/>
    <pointer-type-def type-id='type-id-852' size-in-bits='64' id='type-id-1064'/>
    <reference-type-def kind='lvalue' type-id='type-id-855' size-in-bits='64' id='type-id-1065'/>
    <pointer-type-def type-id='type-id-855' size-in-bits='64' id='type-id-1066'/>
    <reference-type-def kind='lvalue' type-id='type-id-858' size-in-bits='64' id='type-id-1067'/>
    <pointer-type-def type-id='type-id-858' size-in-bits='64' id='type-id-1068'/>
    <reference-type-def kind='lvalue' type-id='type-id-861' size-in-bits='64' id='type-id-1069'/>
    <pointer-type-def type-id='type-id-861' size-in-bits='64' id='type-id-1070'/>
    <reference-type-def kind='lvalue' type-id='type-id-236' size-in-bits='64' id='type-id-1071'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-1072'/>
    <reference-type-def kind='lvalue' type-id='type-id-874' size-in-bits='64' id='type-id-1073'/>
    <reference-type-def kind='lvalue' type-id='type-id-228' size-in-bits='64' id='type-id-1074'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-1075'/>
    <reference-type-def kind='lvalue' type-id='type-id-886' size-in-bits='64' id='type-id-1076'/>
    <reference-type-def kind='lvalue' type-id='type-id-46' size-in-bits='64' id='type-id-287'/>
    <reference-type-def kind='lvalue' type-id='type-id-47' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-1077'/>
    <qualified-type-def type-id='type-id-150' const='yes' id='type-id-1078'/>
    <reference-type-def kind='lvalue' type-id='type-id-1078' size-in-bits='64' id='type-id-1079'/>
    <pointer-type-def type-id='type-id-1078' size-in-bits='64' id='type-id-1080'/>
    <namespace-decl name='std'>
      <class-decl name='initializer_list&lt;AutoData&gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='type-id-787'>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1081' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='type-id-1082'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='type-id-233' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='type-id-1083'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='type-id-233' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='type-id-1084'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1083' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1082' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;PtrData&gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='type-id-790'>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1081' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='type-id-1085'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='type-id-222' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='type-id-1086'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='type-id-222' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='type-id-1087'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1086' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1085' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt;' size-in-bits='128' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='47' column='1' id='type-id-793'>
        <member-type access='private'>
          <typedef-decl name='size_type' type-id='type-id-1081' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='53' column='1' id='type-id-1088'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='type-id-845' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='54' column='1' id='type-id-1089'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='type-id-845' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='55' column='1' id='type-id-1090'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1089' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1088' visibility='default' filepath='/export/users/iverbin/gcc/libstdc++-v3/libsupc++/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;AutoData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1091'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1094'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1095'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1096'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1098'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;DynLib&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1099'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1100' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1101'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1102'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1103'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1104'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1105'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PersistData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1106'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1107' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1108'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1109'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1110'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1111'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1112'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PtrData*&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1113'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1114' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1115'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1116'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1117'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1118'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1119'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;PtrData&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1120'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1121'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1122'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1123'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1124'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;TargetImage&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1125'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1126' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1127'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1128'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1129'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1130'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1131'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;coibuffer*&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1132'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1133' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1134'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1135'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1136'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1137'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1138'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;DynLib&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1139'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1140' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1141'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1142'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1143'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1144'/>
        </member-type>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;DynLib, DynLib&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE12_S_constructIS1_JS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PS9_DpOSA_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE12_S_constructIS1_JS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PS9_DpOSA_'>
            <parameter type-id='type-id-1026'/>
            <parameter type-id='type-id-243'/>
            <parameter type-id='type-id-298'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE8allocateERS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE8allocateERS3_m'>
            <parameter type-id='type-id-1026'/>
            <parameter type-id='type-id-1144'/>
            <return type-id='type-id-1142'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;DynLib, DynLib&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE9constructIS1_JS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS6_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE9constructIS1_JS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS6_'>
            <parameter type-id='type-id-1026'/>
            <parameter type-id='type-id-243'/>
            <parameter type-id='type-id-298'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE10deallocateERS3_PS2_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE10deallocateERS3_PS2_m'>
            <parameter type-id='type-id-1026'/>
            <parameter type-id='type-id-1142'/>
            <parameter type-id='type-id-1144'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;DynLib&gt; &gt;, DynLib&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='type-id-1026'/>
            <parameter type-id='type-id-243'/>
            <parameter type-id='type-id-54'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;DynLib&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE7destroyIS1_EEvRS3_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI6DynLibEEE7destroyIS1_EEvRS3_PT_'>
            <parameter type-id='type-id-1026'/>
            <parameter type-id='type-id-243'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;PersistData&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1145'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1146' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1147'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1148'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1149'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1150'/>
        </member-type>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;PersistData, const PersistData&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE12_S_constructIS1_JRKS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PSB_DpOSC_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE12_S_constructIS1_JRKS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PSB_DpOSC_'>
            <parameter type-id='type-id-1028'/>
            <parameter type-id='type-id-248'/>
            <parameter type-id='type-id-384'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE8allocateERS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE8allocateERS3_m'>
            <parameter type-id='type-id-1028'/>
            <parameter type-id='type-id-1150'/>
            <return type-id='type-id-1148'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;PersistData, const PersistData&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE9constructIS1_JRKS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS8_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE9constructIS1_JRKS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS8_'>
            <parameter type-id='type-id-1028'/>
            <parameter type-id='type-id-248'/>
            <parameter type-id='type-id-384'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE10deallocateERS3_PS2_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE10deallocateERS3_PS2_m'>
            <parameter type-id='type-id-1028'/>
            <parameter type-id='type-id-1148'/>
            <parameter type-id='type-id-1150'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;PersistData&gt; &gt;, PersistData&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='type-id-1028'/>
            <parameter type-id='type-id-248'/>
            <parameter type-id='type-id-54'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;PersistData&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE7destroyIS1_EEvRS3_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11PersistDataEEE7destroyIS1_EEvRS3_PT_'>
            <parameter type-id='type-id-1028'/>
            <parameter type-id='type-id-248'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;PtrData*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1151'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1152' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1153'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1154'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1155'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1156'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10deallocateERS4_PS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10deallocateERS4_PS3_m'>
            <parameter type-id='type-id-1030'/>
            <parameter type-id='type-id-1154'/>
            <parameter type-id='type-id-1156'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;PtrData*&gt; &gt;, PtrData*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='type-id-1030'/>
            <parameter type-id='type-id-304'/>
            <parameter type-id='type-id-54'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;PtrData*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE7destroyIS2_EEvRS4_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE7destroyIS2_EEvRS4_PT_'>
            <parameter type-id='type-id-1030'/>
            <parameter type-id='type-id-304'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;PtrData*, PtrData* const&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE12_S_constructIS2_JRKS2_EEENSt9enable_ifIXsrSt6__and_IJNS5_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS4_PSC_DpOSD_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE12_S_constructIS2_JRKS2_EEENSt9enable_ifIXsrSt6__and_IJNS5_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS4_PSC_DpOSD_'>
            <parameter type-id='type-id-1030'/>
            <parameter type-id='type-id-304'/>
            <parameter type-id='type-id-302'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE8allocateERS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE8allocateERS4_m'>
            <parameter type-id='type-id-1030'/>
            <parameter type-id='type-id-1156'/>
            <return type-id='type-id-1154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;PtrData*, PtrData* const&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE9constructIS2_JRKS2_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS4_PT_DpOS9_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP7PtrDataEEE9constructIS2_JRKS2_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS4_PT_DpOS9_'>
            <parameter type-id='type-id-1030'/>
            <parameter type-id='type-id-304'/>
            <parameter type-id='type-id-302'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;TargetImage&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1157'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1158' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1159'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1160'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1161'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1162'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE10deallocateERS3_PS2_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE10deallocateERS3_PS2_m'>
            <parameter type-id='type-id-1032'/>
            <parameter type-id='type-id-1160'/>
            <parameter type-id='type-id-1162'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;TargetImage&gt; &gt;, TargetImage&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE10_S_destroyIS3_S1_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='type-id-1032'/>
            <parameter type-id='type-id-239'/>
            <parameter type-id='type-id-54'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;TargetImage&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE7destroyIS1_EEvRS3_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE7destroyIS1_EEvRS3_PT_'>
            <parameter type-id='type-id-1032'/>
            <parameter type-id='type-id-239'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;TargetImage, TargetImage&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE12_S_constructIS1_JS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PS9_DpOSA_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE12_S_constructIS1_JS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PS9_DpOSA_'>
            <parameter type-id='type-id-1032'/>
            <parameter type-id='type-id-239'/>
            <parameter type-id='type-id-305'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;TargetImage, const TargetImage&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE12_S_constructIS1_JRKS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PSB_DpOSC_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE12_S_constructIS1_JRKS1_EEENSt9enable_ifIXsrSt6__and_IJNS4_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS3_PSB_DpOSC_'>
            <parameter type-id='type-id-1032'/>
            <parameter type-id='type-id-239'/>
            <parameter type-id='type-id-266'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE8allocateERS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE8allocateERS3_m'>
            <parameter type-id='type-id-1032'/>
            <parameter type-id='type-id-1162'/>
            <return type-id='type-id-1160'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;TargetImage, TargetImage&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE9constructIS1_JS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS6_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE9constructIS1_JS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS6_'>
            <parameter type-id='type-id-1032'/>
            <parameter type-id='type-id-239'/>
            <parameter type-id='type-id-305'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;TargetImage, const TargetImage&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE9constructIS1_JRKS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS8_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeI11TargetImageEEE9constructIS1_JRKS1_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS3_PT_DpOS8_'>
            <parameter type-id='type-id-1032'/>
            <parameter type-id='type-id-239'/>
            <parameter type-id='type-id-266'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::_List_node&lt;coibuffer*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1163'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1164' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='86' column='1' id='type-id-1165'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1166'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1167'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1168'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='deallocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10deallocateERS4_PS3_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10deallocateERS4_PS3_m'>
            <parameter type-id='type-id-1034'/>
            <parameter type-id='type-id-1166'/>
            <parameter type-id='type-id-1168'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_destroy&lt;std::allocator&lt;std::_List_node&lt;coibuffer*&gt; &gt;, coibuffer*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE10_S_destroyIS4_S2_EEDTcldtfp_7destroyfp0_EERT_PT0_i'>
            <parameter type-id='type-id-1034'/>
            <parameter type-id='type-id-376'/>
            <parameter type-id='type-id-54'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='destroy&lt;coibuffer*&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE7destroyIS2_EEvRS4_PT_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE7destroyIS2_EEvRS4_PT_'>
            <parameter type-id='type-id-1034'/>
            <parameter type-id='type-id-376'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;coibuffer*, coibuffer* const&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE12_S_constructIS2_JRKS2_EEENSt9enable_ifIXsrSt6__and_IJNS5_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS4_PSC_DpOSD_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE12_S_constructIS2_JRKS2_EEENSt9enable_ifIXsrSt6__and_IJNS5_18__construct_helperIT_JDpT0_EE4typeEEE5valueEvE4typeERS4_PSC_DpOSD_'>
            <parameter type-id='type-id-1034'/>
            <parameter type-id='type-id-376'/>
            <parameter type-id='type-id-373'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='allocate' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE8allocateERS4_m' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE8allocateERS4_m'>
            <parameter type-id='type-id-1034'/>
            <parameter type-id='type-id-1168'/>
            <return type-id='type-id-1166'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='construct&lt;coibuffer*, coibuffer* const&amp;&gt;' mangled-name='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE9constructIS2_JRKS2_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS4_PT_DpOS9_' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt16allocator_traitsISaISt10_List_nodeIP9coibufferEEE9constructIS2_JRKS2_EEEDTcl12_S_constructfp_fp0_spcl7forwardIT0_Efp1_EEERS4_PT_DpOS9_'>
            <parameter type-id='type-id-1034'/>
            <parameter type-id='type-id-376'/>
            <parameter type-id='type-id-373'/>
            <return type-id='type-id-154'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::pair&lt;long unsigned int const, Stream*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1169'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='93' column='1' id='type-id-1170'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='122' column='1' id='type-id-1171'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1093' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='142' column='1' id='type-id-1172'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-1097' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='181' column='1' id='type-id-1173'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;std::pair&lt;void const* const, OffloadDescriptor*&gt; &gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/export/users/iverbin/gcc_build_host/x86_64-pc-linux-gnu/libstdc++-v3/include/bits/alloc_traits.h' line='81' column='1' id='type-id-1174'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1092'/>
        <member-type access='public'>
