<abi-corpus version='2.1' path='data/test-read-dwarf/test19-pr19023-libtcmalloc_and_profiler.so' soname='libtcmalloc_and_profiler.so.4'>
  <elf-needed>
    <dependency name='libunwind.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='GetHeapProfile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerDump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStart' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='IsHeapProfilerRunning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetEstimatedAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTV15MallocExtension' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16MmapSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16SbrkSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18DevMemSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19DefaultSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19HugetlbSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22TCMallocImplementation' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE13kPageHeapType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE14kLargeSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE16kThreadCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE17kCentralCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE18kTransferCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE21kPageHeapUnmappedType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE22kLargeUnmappedSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__free_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__malloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__memalign_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__realloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='heap_leak_checker_bcad_variable' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sys_alloc' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/base/atomicops-internals-x86.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/dynamic_annotations.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C89'>
    <function-decl name='RunningOnValgrind' mangled-name='RunningOnValgrind' filepath='src/base/dynamic_annotations.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='RunningOnValgrind'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ValgrindSlowdown' mangled-name='ValgrindSlowdown' filepath='src/base/dynamic_annotations.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ValgrindSlowdown'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/elf_mem_image.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='128' id='type-id-4'>
      <subrange length='16' type-id='type-id-5' id='type-id-6'/>
    </array-type-def>
    <typedef-decl name='Elf64_Half' type-id='type-id-7' filepath='/usr/include/elf.h' line='34' column='1' id='type-id-8'/>
    <typedef-decl name='Elf64_Word' type-id='type-id-9' filepath='/usr/include/elf.h' line='39' column='1' id='type-id-10'/>
    <typedef-decl name='Elf64_Xword' type-id='type-id-11' filepath='/usr/include/elf.h' line='45' column='1' id='type-id-12'/>
    <typedef-decl name='Elf64_Addr' type-id='type-id-11' filepath='/usr/include/elf.h' line='50' column='1' id='type-id-13'/>
    <typedef-decl name='Elf64_Off' type-id='type-id-11' filepath='/usr/include/elf.h' line='54' column='1' id='type-id-14'/>
    <typedef-decl name='Elf64_Section' type-id='type-id-7' filepath='/usr/include/elf.h' line='58' column='1' id='type-id-15'/>
    <typedef-decl name='Elf64_Versym' type-id='type-id-8' filepath='/usr/include/elf.h' line='62' column='1' id='type-id-16'/>
    <class-decl name='Elf64_Ehdr' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='88' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e_ident' type-id='type-id-4' visibility='default' filepath='/usr/include/elf.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='e_type' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='e_machine' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='e_version' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='e_entry' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='e_phoff' type-id='type-id-14' visibility='default' filepath='/usr/include/elf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='e_shoff' type-id='type-id-14' visibility='default' filepath='/usr/include/elf.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='e_flags' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='e_ehsize' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='e_phentsize' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='e_phnum' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='e_shentsize' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='e_shnum' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='e_shstrndx' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Sym' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='389' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_name' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='st_info' type-id='type-id-3' visibility='default' filepath='/usr/include/elf.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='st_other' type-id='type-id-3' visibility='default' filepath='/usr/include/elf.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='st_shndx' type-id='type-id-15' visibility='default' filepath='/usr/include/elf.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_value' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_size' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='395' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Phdr' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='551' column='1' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_type' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='p_flags' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_offset' type-id='type-id-14' visibility='default' filepath='/usr/include/elf.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_vaddr' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_paddr' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_filesz' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_memsz' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_align' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='559' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdef' size-in-bits='160' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='812' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vd_version' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='vd_flags' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vd_ndx' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vd_cnt' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vd_hash' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vd_aux' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vd_next' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='819' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdaux' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/elf.h' line='849' column='1' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vda_name' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='850' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vda_next' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='851' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='type-id-22' filepath='/usr/include/stdint.h' line='50' column='1' id='type-id-7'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-26'/>
    <reference-type-def kind='lvalue' type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-31'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-38'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-39'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-46'/>
    <reference-type-def kind='lvalue' type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-48'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-49'/>
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-51'/>
    <namespace-decl name='base'>
      <class-decl name='ElfMemImage' size-in-bits='576' visibility='default' filepath='./src/base/elf_mem_image.h' line='56' column='1' id='type-id-23'>
        <member-type access='private'>
          <class-decl name='SymbolInfo' size-in-bits='256' is-struct='yes' visibility='default' filepath='./src/base/elf_mem_image.h' line='64' column='1' id='type-id-25'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='name' type-id='type-id-52' visibility='default' filepath='./src/base/elf_mem_image.h' line='65' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='version' type-id='type-id-52' visibility='default' filepath='./src/base/elf_mem_image.h' line='66' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='address' type-id='type-id-53' visibility='default' filepath='./src/base/elf_mem_image.h' line='68' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='symbol' type-id='type-id-35' visibility='default' filepath='./src/base/elf_mem_image.h' line='69' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='SymbolIterator' size-in-bits='384' visibility='default' filepath='./src/base/elf_mem_image.h' line='73' column='1' id='type-id-27'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='info_' type-id='type-id-25' visibility='default' filepath='./src/base/elf_mem_image.h' line='84' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <var-decl name='index_' type-id='type-id-1' visibility='default' filepath='./src/base/elf_mem_image.h' line='85' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='320'>
              <var-decl name='image_' type-id='type-id-54' visibility='default' filepath='./src/base/elf_mem_image.h' line='86' column='1'/>
            </data-member>
            <member-function access='private' constructor='yes'>
              <function-decl name='SymbolIterator' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi' filepath='./src/base/elf_mem_image.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi'>
                <parameter type-id='type-id-29' is-artificial='yes'/>
                <parameter type-id='type-id-53'/>
                <parameter type-id='type-id-1'/>
                <return type-id='type-id-55'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator-&gt;' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorptEv' filepath='./src/base/elf_mem_image.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorptEv'>
                <parameter type-id='type-id-51' is-artificial='yes'/>
                <return type-id='type-id-48'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator*' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratordeEv' filepath='./src/base/elf_mem_image.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratordeEv'>
                <parameter type-id='type-id-51' is-artificial='yes'/>
                <return type-id='type-id-47'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator==' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_' filepath='./src/base/elf_mem_image.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_'>
                <parameter type-id='type-id-51' is-artificial='yes'/>
                <parameter type-id='type-id-50'/>
                <return type-id='type-id-56'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator!=' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_' filepath='./src/base/elf_mem_image.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_'>
                <parameter type-id='type-id-51' is-artificial='yes'/>
                <parameter type-id='type-id-50'/>
                <return type-id='type-id-56'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='Update' mangled-name='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi' filepath='./src/base/elf_mem_image.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi'>
                <parameter type-id='type-id-29' is-artificial='yes'/>
                <parameter type-id='type-id-1'/>
                <return type-id='type-id-55'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator++' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorppEv' filepath='./src/base/elf_mem_image.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorppEv'>
                <parameter type-id='type-id-29' is-artificial='yes'/>
                <return type-id='type-id-28'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='kInvalidBase' type-id='type-id-54' mangled-name='_ZN4base11ElfMemImage12kInvalidBaseE' visibility='default' filepath='./src/base/elf_mem_image.h' line='59' column='1' elf-symbol-id='_ZN4base11ElfMemImage12kInvalidBaseE'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='ehdr_' type-id='type-id-31' visibility='default' filepath='./src/base/elf_mem_image.h' line='120' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='dynsym_' type-id='type-id-35' visibility='default' filepath='./src/base/elf_mem_image.h' line='121' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='versym_' type-id='type-id-41' visibility='default' filepath='./src/base/elf_mem_image.h' line='122' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='verdef_' type-id='type-id-39' visibility='default' filepath='./src/base/elf_mem_image.h' line='123' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='hash_' type-id='type-id-43' visibility='default' filepath='./src/base/elf_mem_image.h' line='124' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='dynstr_' type-id='type-id-52' visibility='default' filepath='./src/base/elf_mem_image.h' line='125' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='strsize_' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='126' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <var-decl name='verdefnum_' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='127' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='512'>
          <var-decl name='link_base_' type-id='type-id-13' visibility='default' filepath='./src/base/elf_mem_image.h' line='128' column='1'/>
        </data-member>
        <member-function access='private' constructor='yes'>
          <function-decl name='ElfMemImage' mangled-name='_ZN4base11ElfMemImageC1EPKv' filepath='./src/base/elf_mem_image.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImageC1EPKv'>
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <parameter type-id='type-id-53'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='IsPresent' mangled-name='_ZNK4base11ElfMemImage9IsPresentEv' filepath='./src/base/elf_mem_image.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetNumSymbols' mangled-name='_ZNK4base11ElfMemImage13GetNumSymbolsEv' filepath='./src/base/elf_mem_image.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage13GetNumSymbolsEv'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdefAux' mangled-name='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' filepath='./src/base/elf_mem_image.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-39'/>
            <return type-id='type-id-37'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='end' mangled-name='_ZNK4base11ElfMemImage3endEv' filepath='./src/base/elf_mem_image.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage3endEv'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <return type-id='type-id-27'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerstr' mangled-name='_ZNK4base11ElfMemImage9GetVerstrEj' filepath='./src/base/elf_mem_image.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerstrEj'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-52'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdef' mangled-name='_ZNK4base11ElfMemImage9GetVerdefEi' filepath='./src/base/elf_mem_image.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerdefEi'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-39'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetSymAddr' mangled-name='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' filepath='./src/base/elf_mem_image.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-35'/>
            <return type-id='type-id-53'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynstr' mangled-name='_ZNK4base11ElfMemImage9GetDynstrEj' filepath='./src/base/elf_mem_image.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynstrEj'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-52'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetPhdr' mangled-name='_ZNK4base11ElfMemImage7GetPhdrEi' filepath='./src/base/elf_mem_image.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage7GetPhdrEi'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-33'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Init' mangled-name='_ZN4base11ElfMemImage4InitEPKv' filepath='./src/base/elf_mem_image.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage4InitEPKv'>
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <parameter type-id='type-id-53'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVersym' mangled-name='_ZNK4base11ElfMemImage9GetVersymEi' filepath='./src/base/elf_mem_image.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVersymEi'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-41'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynsym' mangled-name='_ZNK4base11ElfMemImage9GetDynsymEi' filepath='./src/base/elf_mem_image.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynsymEi'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-35'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='begin' mangled-name='_ZNK4base11ElfMemImage5beginEv' filepath='./src/base/elf_mem_image.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage5beginEv'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <return type-id='type-id-27'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' filepath='./src/base/elf_mem_image.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-53'/>
            <parameter type-id='type-id-26'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' filepath='./src/base/elf_mem_image.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE'>
            <parameter type-id='type-id-45' is-artificial='yes'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-1'/>
            <parameter type-id='type-id-26'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/linuxthreads.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <typedef-decl name='ListAllProcessThreadsCallBack' type-id='type-id-58' filepath='./src/base/thread_lister.h' line='48' column='1' id='type-id-59'/>
    <typedef-decl name='__pid_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='143' column='1' id='type-id-60'/>
    <typedef-decl name='pid_t' type-id='type-id-60' filepath='/usr/include/sched.h' line='37' column='1' id='type-id-61'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-63'/>
    <function-decl name='TCMalloc_ListAllProcessThreads' mangled-name='TCMalloc_ListAllProcessThreads' filepath='src/base/linuxthreads.cc' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ListAllProcessThreads'>
      <parameter type-id='type-id-53' name='parameter' filepath='src/base/linuxthreads.cc' line='551' column='1'/>
      <parameter type-id='type-id-59' name='callback' filepath='src/base/linuxthreads.cc' line='552' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='TCMalloc_ResumeAllProcessThreads' mangled-name='TCMalloc_ResumeAllProcessThreads' filepath='src/base/linuxthreads.cc' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ResumeAllProcessThreads'>
      <parameter type-id='type-id-1' name='num_threads' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <parameter type-id='type-id-63' name='thread_pids' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-62'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/logging.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead'>
      <var-decl name='FLAGS_verbose' type-id='type-id-65' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE' visibility='default' filepath='./src/base/logging.h' line='76' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE'/>
      <var-decl name='FLAGS_noverbose' type-id='type-id-66' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE' visibility='default' filepath='src/base/logging.cc' line='40' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE'/>
    </namespace-decl>
    <function-decl name='RawOpenForWriting' mangled-name='_Z17RawOpenForWritingPKc' filepath='src/base/logging.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17RawOpenForWritingPKc'>
      <parameter type-id='type-id-52' name='filename' filepath='src/base/logging.cc' line='90' column='1'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='RawWrite' mangled-name='_Z8RawWriteiPKcm' filepath='src/base/logging.cc' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawWriteiPKcm'>
      <parameter type-id='type-id-67' name='fd' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='type-id-52' name='buf' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='type-id-57' name='len' filepath='src/base/logging.cc' line='94' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='RawClose' mangled-name='_Z8RawClosei' filepath='src/base/logging.cc' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawClosei'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-55'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/low_level_alloc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-68' size-in-bits='1920' id='type-id-69'>
      <subrange length='30' type-id='type-id-5' id='type-id-70'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-68'/>
    <namespace-decl name='low_level_alloc_internal'>
      <class-decl name='AllocList' size-in-bits='2240' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='67' column='1' id='type-id-71'>
        <member-type access='public'>
          <class-decl name='Header' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='68' column='1' id='type-id-72'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='type-id-73' visibility='default' filepath='src/base/low_level_alloc.cc' line='69' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='magic' type-id='type-id-73' visibility='default' filepath='src/base/low_level_alloc.cc' line='71' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='arena' type-id='type-id-74' visibility='default' filepath='src/base/low_level_alloc.cc' line='72' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='dummy_for_alignment' type-id='type-id-53' visibility='default' filepath='src/base/low_level_alloc.cc' line='73' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='header' type-id='type-id-72' visibility='default' filepath='src/base/low_level_alloc.cc' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='levels' type-id='type-id-1' visibility='default' filepath='src/base/low_level_alloc.cc' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='next' type-id='type-id-69' visibility='default' filepath='src/base/low_level_alloc.cc' line='79' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='CycleClock' size-in-bits='8' is-struct='yes' visibility='default' filepath='./src/base/cycleclock.h' line='79' column='1' id='type-id-75'>
      <member-function access='public' static='yes'>
        <function-decl name='Now' mangled-name='_ZN10CycleClock3NowEv' filepath='./src/base/cycleclock.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <return type-id='type-id-76'/>
        </function-decl>
      </member-function>
    </class-decl>
    <namespace-decl name='base'>
      <function-decl name='SubmitSpinLockProfileData' mangled-name='_ZN4base25SubmitSpinLockProfileDataEPKvl' filepath='./src/base/synchronization_profiling.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base25SubmitSpinLockProfileDataEPKvl'>
        <parameter type-id='type-id-53'/>
        <parameter type-id='type-id-76'/>
        <return type-id='type-id-55'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock_internal.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-77' const='yes' id='type-id-78'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <namespace-decl name='base'>
      <namespace-decl name='subtle'>
        <function-decl name='Acquire_Load' filepath='./src/base/atomicops-internals-x86.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-80'/>
          <return type-id='type-id-81'/>
        </function-decl>
      </namespace-decl>
      <namespace-decl name='internal'>
        <class-decl name='SpinLockWaitTransition' size-in-bits='96' is-struct='yes' visibility='default' filepath='./src/base/spinlock_internal.h' line='48' column='1' id='type-id-77'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='from' type-id='type-id-65' visibility='default' filepath='./src/base/spinlock_internal.h' line='49' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='to' type-id='type-id-65' visibility='default' filepath='./src/base/spinlock_internal.h' line='50' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='done' type-id='type-id-56' visibility='default' filepath='./src/base/spinlock_internal.h' line='51' column='1'/>
          </data-member>
        </class-decl>
        <function-decl name='SpinLockDelay' mangled-name='_ZN4base8internal13SpinLockDelayEPViii' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal13SpinLockDelayEPViii'>
          <parameter type-id='type-id-82'/>
          <parameter type-id='type-id-65'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-55'/>
        </function-decl>
        <function-decl name='SpinLockWake' mangled-name='_ZN4base8internal12SpinLockWakeEPVib' filepath='./src/base/spinlock_linux-inl.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWakeEPVib'>
          <parameter type-id='type-id-82'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-55'/>
        </function-decl>
        <function-decl name='SpinLockWait' mangled-name='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE' filepath='src/base/spinlock_internal.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE'>
          <parameter type-id='type-id-82'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-79'/>
          <return type-id='type-id-65'/>
        </function-decl>
      </namespace-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/sysinfo.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='80' id='type-id-83'>
      <subrange length='10' type-id='type-id-5' id='type-id-84'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='40960' id='type-id-85'>
      <subrange length='5120' type-id='type-id-5' id='type-id-86'/>
    </array-type-def>
    <class-decl name='ProcMapsIterator' size-in-bits='640' visibility='default' filepath='./src/base/sysinfo.h' line='102' column='1' id='type-id-87'>
      <member-type access='private'>
        <class-decl name='Buffer' size-in-bits='40960' is-struct='yes' visibility='default' filepath='./src/base/sysinfo.h' line='104' column='1' id='type-id-88'>
          <data-member access='public' static='yes'>
            <var-decl name='kBufSize' type-id='type-id-89' visibility='default' filepath='./src/base/sysinfo.h' line='110' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf_' type-id='type-id-85' visibility='default' filepath='./src/base/sysinfo.h' line='112' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='ibuf_' type-id='type-id-90' visibility='default' filepath='./src/base/sysinfo.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='stext_' type-id='type-id-90' visibility='default' filepath='./src/base/sysinfo.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='etext_' type-id='type-id-90' visibility='default' filepath='./src/base/sysinfo.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='nextline_' type-id='type-id-90' visibility='default' filepath='./src/base/sysinfo.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='ebuf_' type-id='type-id-90' visibility='default' filepath='./src/base/sysinfo.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='fd_' type-id='type-id-1' visibility='default' filepath='./src/base/sysinfo.h' line='219' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='pid_' type-id='type-id-61' visibility='default' filepath='./src/base/sysinfo.h' line='221' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='flags_' type-id='type-id-83' visibility='default' filepath='./src/base/sysinfo.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='dynamic_buffer_' type-id='type-id-91' visibility='default' filepath='./src/base/sysinfo.h' line='223' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='using_maps_backing_' type-id='type-id-56' visibility='default' filepath='./src/base/sysinfo.h' line='224' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1Ei' filepath='./src/base/sysinfo.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1Ei'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC2EiPNS_6BufferE' filepath='./src/base/sysinfo.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC2EiPNS_6BufferE'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-91'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb' filepath='./src/base/sysinfo.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-91'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorD1Ev' filepath='./src/base/sysinfo.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorD1Ev'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Valid' mangled-name='_ZNK16ProcMapsIterator5ValidEv' filepath='./src/base/sysinfo.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16ProcMapsIterator5ValidEv'>
          <parameter type-id='type-id-93' is-artificial='yes'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FormatLine' mangled-name='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m' filepath='./src/base/sysinfo.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m'>
          <parameter type-id='type-id-90'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-94'/>
          <parameter type-id='type-id-94'/>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-94'/>
          <parameter type-id='type-id-76'/>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-95'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Init' mangled-name='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb' filepath='./src/base/sysinfo.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-91'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NextExt' mangled-name='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_' filepath='./src/base/sysinfo.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-97'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-98'/>
          <parameter type-id='type-id-97'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-99'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Next' mangled-name='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_' filepath='./src/base/sysinfo.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-97'/>
          <parameter type-id='type-id-96'/>
          <parameter type-id='type-id-98'/>
          <parameter type-id='type-id-97'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-5' filepath='/usr/include/bits/types.h' line='134' column='1' id='type-id-100'/>
    <typedef-decl name='dev_t' type-id='type-id-100' filepath='/usr/include/sys/types.h' line='61' column='1' id='type-id-95'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-91'/>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-101'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-96'/>
    <namespace-decl name='tcmalloc'>
      <function-decl name='FillProcSelfMaps' mangled-name='_ZN8tcmalloc16FillProcSelfMapsEPciPb' filepath='src/base/sysinfo.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16FillProcSelfMapsEPciPb'>
        <parameter type-id='type-id-90'/>
        <parameter type-id='type-id-1'/>
        <parameter type-id='type-id-102'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='DumpProcSelfMaps' mangled-name='_ZN8tcmalloc16DumpProcSelfMapsEi' filepath='src/base/sysinfo.cc' line='1137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16DumpProcSelfMapsEi'>
        <parameter type-id='type-id-67'/>
        <return type-id='type-id-55'/>
      </function-decl>
    </namespace-decl>
    <function-decl name='GetenvBeforeMain' mangled-name='_Z16GetenvBeforeMainPKc' filepath='src/base/sysinfo.cc' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16GetenvBeforeMainPKc'>
      <parameter type-id='type-id-52' name='name' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='TCMallocGetenvSafe' mangled-name='TCMallocGetenvSafe' filepath='src/base/sysinfo.cc' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMallocGetenvSafe'>
      <parameter type-id='type-id-52' name='name' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='GetUniquePathFromEnv' mangled-name='_Z20GetUniquePathFromEnvPKcPc' filepath='src/base/sysinfo.cc' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20GetUniquePathFromEnvPKcPc'>
      <parameter type-id='type-id-52' name='env_name' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <parameter type-id='type-id-90' name='path' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='SleepForMilliseconds' mangled-name='_Z20SleepForMillisecondsi' filepath='src/base/sysinfo.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20SleepForMillisecondsi'>
      <parameter type-id='type-id-1' name='milliseconds' filepath='src/base/sysinfo.cc' line='226' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='CyclesPerSecond' mangled-name='_Z15CyclesPerSecondv' filepath='src/base/sysinfo.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15CyclesPerSecondv'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='NumCPUs' mangled-name='_Z7NumCPUsv' filepath='src/base/sysinfo.cc' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7NumCPUsv'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='HasPosixThreads' mangled-name='_Z15HasPosixThreadsv' filepath='src/base/sysinfo.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15HasPosixThreadsv'>
      <return type-id='type-id-56'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/vdso_support.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-108'/>
    <qualified-type-def type-id='type-id-105' const='yes' id='type-id-109'/>
    <reference-type-def kind='lvalue' type-id='type-id-109' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-111'/>
    <namespace-decl name='base'>
      <class-decl name='VDSOSupport' size-in-bits='576' visibility='default' filepath='./src/base/vdso_support.h' line='72' column='1' id='type-id-105'>
        <member-type access='private'>
          <typedef-decl name='SymbolInfo' type-id='type-id-25' filepath='./src/base/vdso_support.h' line='76' column='1' id='type-id-107'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='SymbolIterator' type-id='type-id-27' filepath='./src/base/vdso_support.h' line='77' column='1' id='type-id-112'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='image_' type-id='type-id-23' visibility='default' filepath='./src/base/vdso_support.h' line='112' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='vdso_base_' type-id='type-id-53' mangled-name='_ZN4base11VDSOSupport10vdso_base_E' visibility='default' filepath='./src/base/vdso_support.h' line='123' column='1' elf-symbol-id='_ZN4base11VDSOSupport10vdso_base_E'/>
        </data-member>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOSupport' mangled-name='_ZN4base11VDSOSupportC1Ev' filepath='./src/base/vdso_support.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupportC1Ev'>
            <parameter type-id='type-id-106' is-artificial='yes'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOSupport' filepath='./src/base/vdso_support.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-106' is-artificial='yes'/>
            <parameter type-id='type-id-110'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE' filepath='./src/base/vdso_support.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE'>
            <parameter type-id='type-id-111' is-artificial='yes'/>
            <parameter type-id='type-id-53'/>
            <parameter type-id='type-id-108'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE' filepath='./src/base/vdso_support.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE'>
            <parameter type-id='type-id-111' is-artificial='yes'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-1'/>
            <parameter type-id='type-id-108'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='SetBase' mangled-name='_ZN4base11VDSOSupport7SetBaseEPKv' filepath='./src/base/vdso_support.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport7SetBaseEPKv'>
            <parameter type-id='type-id-106' is-artificial='yes'/>
            <parameter type-id='type-id-53'/>
            <return type-id='type-id-53'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='Init' mangled-name='_ZN4base11VDSOSupport4InitEv' filepath='./src/base/vdso_support.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport4InitEv'>
            <return type-id='type-id-53'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='VDSOInitHelper' size-in-bits='8' visibility='default' filepath='src/base/vdso_support.cc' line='137' column='1' id='type-id-103'>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOInitHelper' filepath='src/base/vdso_support.cc' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-104' is-artificial='yes'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/central_freelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <reference-type-def kind='lvalue' type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <qualified-type-def type-id='type-id-115' const='yes' id='type-id-116'/>
    <reference-type-def kind='lvalue' type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <qualified-type-def type-id='type-id-118' const='yes' id='type-id-119'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
    <namespace-decl name='std'>
      <function-decl name='min&lt;int32_t&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-117'/>
        <parameter type-id='type-id-117'/>
        <return type-id='type-id-117'/>
      </function-decl>
      <function-decl name='max&lt;int&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-114'/>
        <parameter type-id='type-id-114'/>
        <return type-id='type-id-114'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='tcmalloc'>
      <function-decl name='SLL_PushRange' filepath='src/linked_list.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-121'/>
        <parameter type-id='type-id-53'/>
        <parameter type-id='type-id-53'/>
        <return type-id='type-id-55'/>
      </function-decl>
      <function-decl name='DLL_IsEmpty' filepath='src/span.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-120'/>
        <return type-id='type-id-56'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='tcmalloc'>
      <function-decl name='AlignmentForSize' mangled-name='_ZN8tcmalloc16AlignmentForSizeEm' filepath='src/common.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16AlignmentForSizeEm'>
        <parameter type-id='type-id-57'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='MetaDataAlloc' mangled-name='_ZN8tcmalloc13MetaDataAllocEm' filepath='src/common.cc' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc13MetaDataAllocEm'>
        <parameter type-id='type-id-57'/>
        <return type-id='type-id-53'/>
      </function-decl>
      <function-decl name='metadata_system_bytes' mangled-name='_ZN8tcmalloc21metadata_system_bytesEv' filepath='src/common.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc21metadata_system_bytesEv'>
        <return type-id='type-id-11'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker-bcad.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='HeapLeakCheckerGlobalPrePost' size-in-bits='8' visibility='default' filepath='src/heap-checker-bcad.cc' line='60' column='1' id='type-id-122'>
      <data-member access='private' static='yes'>
        <var-decl name='count_' type-id='type-id-1' mangled-name='_ZN28HeapLeakCheckerGlobalPrePost6count_E' visibility='default' filepath='src/heap-checker-bcad.cc' line='87' column='1' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePost6count_E'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakCheckerGlobalPrePost' filepath='src/heap-checker-bcad.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakCheckerGlobalPrePost' mangled-name='_ZN28HeapLeakCheckerGlobalPrePostD1Ev' filepath='src/heap-checker-bcad.cc' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePostD1Ev'>
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <var-decl name='heap_leak_checker_bcad_variable' type-id='type-id-56' mangled-name='heap_leak_checker_bcad_variable' visibility='default' filepath='src/heap-checker-bcad.cc' line='53' column='1' elf-symbol-id='heap_leak_checker_bcad_variable'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='infinite' id='type-id-124'>
      <subrange length='infinite' id='type-id-125'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-57' size-in-bits='256' id='type-id-126'>
      <subrange length='4' type-id='type-id-5' id='type-id-127'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='2048' id='type-id-128'>
      <subrange length='32' type-id='type-id-5' id='type-id-129'/>
    </array-type-def>
    <typedef-decl name='RawFD' type-id='type-id-1' filepath='./src/base/logging.h' line='251' column='1' id='type-id-67'/>
    <class-decl name='HeapCleaner' size-in-bits='8' visibility='default' filepath='./src/gperftools/heap-checker.h' line='403' column='1' id='type-id-130'>
      <member-type access='private'>
        <typedef-decl name='void_function' type-id='type-id-131' filepath='./src/gperftools/heap-checker.h' line='405' column='1' id='type-id-132'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='heap_cleanups_' type-id='type-id-133' mangled-name='_ZN11HeapCleaner14heap_cleanups_E' visibility='default' filepath='./src/gperftools/heap-checker.h' line='409' column='1' elf-symbol-id='_ZN11HeapCleaner14heap_cleanups_E'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapCleaner' mangled-name='_ZN11HeapCleanerC1EPFvvE' filepath='./src/gperftools/heap-checker.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleanerC1EPFvvE'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-132'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RunHeapCleanups' mangled-name='_ZN11HeapCleaner15RunHeapCleanupsEv' filepath='./src/gperftools/heap-checker.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleaner15RunHeapCleanupsEv'>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='MallocHook_NewHook' type-id='type-id-135' filepath='./src/gperftools/malloc_hook_c.h' line='70' column='1' id='type-id-136'/>
    <typedef-decl name='MallocHook_DeleteHook' type-id='type-id-137' filepath='./src/gperftools/malloc_hook_c.h' line='76' column='1' id='type-id-138'/>
    <typedef-decl name='MallocHook_MmapHook' type-id='type-id-139' filepath='./src/gperftools/malloc_hook_c.h' line='99' column='1' id='type-id-140'/>
    <typedef-decl name='MallocHook_SbrkHook' type-id='type-id-141' filepath='./src/gperftools/malloc_hook_c.h' line='144' column='1' id='type-id-142'/>
    <typedef-decl name='__intptr_t' type-id='type-id-143' filepath='/usr/include/bits/types.h' line='189' column='1' id='type-id-144'/>
    <typedef-decl name='off_t' type-id='type-id-145' filepath='/usr/include/sys/types.h' line='87' column='1' id='type-id-146'/>
    <typedef-decl name='_Atomic_word' type-id='type-id-1' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/x86_64-redhat-linux/bits/atomic_word.h' line='32' column='1' id='type-id-147'/>
    <class-decl name='AddressMap&lt;HeapProfileTable::AllocValue&gt;' size-in-bits='320' visibility='default' filepath='src/addressmap-inl.h' line='104' column='1' id='type-id-148'>
      <member-type access='private'>
        <class-decl name='Cluster' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-149'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-150'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Object' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-151'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='kBlockBits' type-id='type-id-113' visibility='default' filepath='src/addressmap-inl.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kBlockSize' type-id='type-id-113' visibility='default' filepath='src/addressmap-inl.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterBits' type-id='type-id-113' visibility='default' filepath='src/addressmap-inl.h' line='172' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterSize' type-id='type-id-152' visibility='default' filepath='src/addressmap-inl.h' line='173' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kClusterBlocks' type-id='type-id-113' visibility='default' filepath='src/addressmap-inl.h' line='174' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashBits' type-id='type-id-113' visibility='default' filepath='src/addressmap-inl.h' line='187' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashSize' type-id='type-id-113' visibility='default' filepath='src/addressmap-inl.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_COUNT' type-id='type-id-113' visibility='default' filepath='src/addressmap-inl.h' line='191' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='hashtable_' type-id='type-id-153' visibility='default' filepath='src/addressmap-inl.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='free_' type-id='type-id-154' visibility='default' filepath='src/addressmap-inl.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kHashMultiplier' type-id='type-id-155' visibility='default' filepath='src/addressmap-inl.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='alloc_' type-id='type-id-156' visibility='default' filepath='src/addressmap-inl.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='dealloc_' type-id='type-id-137' visibility='default' filepath='src/addressmap-inl.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='allocated_' type-id='type-id-157' visibility='default' filepath='src/addressmap-inl.h' line='253' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='AddressMap' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E' filepath='src/addressmap-inl.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-156'/>
          <parameter type-id='type-id-137'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~AddressMap' filepath='src/addressmap-inl.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;void (*)(const void*, const HeapProfileTable::AllocInfo&amp;)&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-159' is-artificial='yes'/>
          <parameter type-id='type-id-160'/>
          <parameter type-id='type-id-161'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;char*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-159' is-artificial='yes'/>
          <parameter type-id='type-id-162'/>
          <parameter type-id='type-id-90'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Cluster*&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-153'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;HeapProfileTable::AddNonLiveArgs*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-159' is-artificial='yes'/>
          <parameter type-id='type-id-163'/>
          <parameter type-id='type-id-164'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;HeapProfileTable::Snapshot*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-159' is-artificial='yes'/>
          <parameter type-id='type-id-165'/>
          <parameter type-id='type-id-166'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Cluster&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-167'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='New&lt;AddressMap&lt;HeapProfileTable::AllocValue&gt;::Entry&gt;' filepath='src/addressmap-inl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;const HeapProfileTable::DumpArgs&amp;&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-159' is-artificial='yes'/>
          <parameter type-id='type-id-168'/>
          <parameter type-id='type-id-169'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Iterate&lt;HeapProfileTable::Snapshot::ReportState*&gt;' filepath='src/addressmap-inl.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-159' is-artificial='yes'/>
          <parameter type-id='type-id-170'/>
          <parameter type-id='type-id-171'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='HashInt' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE7HashIntEm' filepath='src/addressmap-inl.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-5'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BlockID' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE7BlockIDEm' filepath='src/addressmap-inl.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-5'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Find' mangled-name='_ZNK10AddressMapIN16HeapProfileTable10AllocValueEE4FindEPKv' filepath='src/addressmap-inl.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-159' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-172'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindInside' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE10FindInsideEPFmRKS1_EmPKvPS8_' filepath='src/addressmap-inl.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-173'/>
          <parameter type-id='type-id-5'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-172'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAndRemove' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE13FindAndRemoveEPKvPS1_' filepath='src/addressmap-inl.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-174'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindMutable' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE11FindMutableEPKv' filepath='src/addressmap-inl.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-174'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindCluster' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE11FindClusterEmb' filepath='src/addressmap-inl.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-5'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-167'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Insert' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_' filepath='src/addressmap-inl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_'>
          <parameter type-id='type-id-158' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-175'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='GoogleInitializer' size-in-bits='128' visibility='default' filepath='src/base/googleinit.h' line='39' column='1' id='type-id-176'>
      <member-type access='private'>
        <typedef-decl name='VoidFunction' type-id='type-id-131' filepath='src/base/googleinit.h' line='41' column='1' id='type-id-177'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='name_' type-id='type-id-178' visibility='default' filepath='src/base/googleinit.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='destructor_' type-id='type-id-179' visibility='default' filepath='src/base/googleinit.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='GoogleInitializer' filepath='src/base/googleinit.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-180' is-artificial='yes'/>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-177'/>
          <parameter type-id='type-id-177'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev'>
          <parameter type-id='type-id-180' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='LowLevelAlloc' size-in-bits='8' visibility='default' filepath='src/base/low_level_alloc.h' line='44' column='1' id='type-id-181'>
      <member-type access='private'>
        <class-decl name='Arena' is-struct='yes' visibility='default' filepath='src/base/low_level_alloc.cc' line='184' column='1' is-declaration-only='yes' id='type-id-182'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='mu' type-id='type-id-183' visibility='default' filepath='src/base/low_level_alloc.cc' line='189' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='freelist' type-id='type-id-71' visibility='default' filepath='src/base/low_level_alloc.cc' line='191' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2304'>
            <var-decl name='allocation_count' type-id='type-id-65' visibility='default' filepath='src/base/low_level_alloc.cc' line='192' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2336'>
            <var-decl name='flags' type-id='type-id-65' visibility='default' filepath='src/base/low_level_alloc.cc' line='193' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2368'>
            <var-decl name='pagesize' type-id='type-id-57' visibility='default' filepath='src/base/low_level_alloc.cc' line='194' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2432'>
            <var-decl name='roundup' type-id='type-id-57' visibility='default' filepath='src/base/low_level_alloc.cc' line='195' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2496'>
            <var-decl name='min_size' type-id='type-id-57' visibility='default' filepath='src/base/low_level_alloc.cc' line='197' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-74' is-artificial='yes'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='Arena' filepath='src/base/low_level_alloc.cc' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-74' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-function access='private' static='yes'>
        <function-decl name='DefaultArena' mangled-name='_ZN13LowLevelAlloc12DefaultArenaEv' filepath='./src/base/low_level_alloc.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc12DefaultArenaEv'>
          <return type-id='type-id-74'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocWithArena' mangled-name='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE' filepath='./src/base/low_level_alloc.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE'>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-74'/>
          <return type-id='type-id-53'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NewArena' mangled-name='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE' filepath='./src/base/low_level_alloc.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE'>
          <parameter type-id='type-id-65'/>
          <parameter type-id='type-id-74'/>
          <return type-id='type-id-74'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Alloc' mangled-name='_ZN13LowLevelAlloc5AllocEm' filepath='./src/base/low_level_alloc.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc5AllocEm'>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-53'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Free' mangled-name='_ZN13LowLevelAlloc4FreeEPv' filepath='./src/base/low_level_alloc.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc4FreeEPv'>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DeleteArena' mangled-name='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE' filepath='./src/base/low_level_alloc.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE'>
          <parameter type-id='type-id-74'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-184'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-185' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-185' is-artificial='yes'/>
          <parameter type-id='type-id-186'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-185' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE7destroyEPS0_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-185' is-artificial='yes'/>
          <parameter type-id='type-id-187'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='max_size' mangled-name='_ZNK13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE8max_sizeEv' filepath='src/base/stl_allocator.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-188' is-artificial='yes'/>
          <return type-id='type-id-57'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-185' is-artificial='yes'/>
          <parameter type-id='type-id-5'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-187'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE9constructEPS0_RKS0_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-185' is-artificial='yes'/>
          <parameter type-id='type-id-187'/>
          <parameter type-id='type-id-189'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEE10deallocateEPS0_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-185' is-artificial='yes'/>
          <parameter type-id='type-id-187'/>
          <parameter type-id='type-id-5'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-190'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-191' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-191' is-artificial='yes'/>
          <parameter type-id='type-id-192'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-191' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorIcN15HeapLeakChecker9AllocatorEE10deallocateEPcm' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-191' is-artificial='yes'/>
          <parameter type-id='type-id-90'/>
          <parameter type-id='type-id-5'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorIcN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-191' is-artificial='yes'/>
          <parameter type-id='type-id-5'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-90'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='operator==' mangled-name='_ZNK13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEeqERKS2_' filepath='src/base/stl_allocator.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-193' is-artificial='yes'/>
          <parameter type-id='type-id-192'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-194'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-195' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-195' is-artificial='yes'/>
          <parameter type-id='type-id-196'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-195' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-195' is-artificial='yes'/>
          <parameter type-id='type-id-197'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorImN15HeapLeakChecker9AllocatorEE7destroyEPm' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-195' is-artificial='yes'/>
          <parameter type-id='type-id-198'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorImN15HeapLeakChecker9AllocatorEE9constructEPmRKm' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-195' is-artificial='yes'/>
          <parameter type-id='type-id-198'/>
          <parameter type-id='type-id-199'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-200'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-197'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeImEN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-5'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-202'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeImEN15HeapLeakChecker9AllocatorEE10deallocateEPS1_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-201' is-artificial='yes'/>
          <parameter type-id='type-id-202'/>
          <parameter type-id='type-id-5'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-203'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' is-artificial='yes'/>
          <parameter type-id='type-id-205'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKmN15HeapLeakChecker10RangeValueEEENS3_9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' is-artificial='yes'/>
          <parameter type-id='type-id-5'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-206'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKmN15HeapLeakChecker10RangeValueEEENS3_9AllocatorEE10deallocateEPS6_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-204' is-artificial='yes'/>
          <parameter type-id='type-id-206'/>
          <parameter type-id='type-id-5'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-207'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-209'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKmmEEN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-5'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-210'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKmmEEN15HeapLeakChecker9AllocatorEE10deallocateEPS4_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-208' is-artificial='yes'/>
          <parameter type-id='type-id-210'/>
          <parameter type-id='type-id-5'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-211'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-213'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKSbIcSt11char_traitsIcES_IcN15HeapLeakChecker9AllocatorEEESt6vectorI11AllocObjectS_ISA_S5_EEEES5_E8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-5'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-214'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorISt13_Rb_tree_nodeISt4pairIKSbIcSt11char_traitsIcES_IcN15HeapLeakChecker9AllocatorEEESt6vectorI11AllocObjectS_ISA_S5_EEEES5_E10deallocateEPSE_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-212' is-artificial='yes'/>
          <parameter type-id='type-id-214'/>
          <parameter type-id='type-id-5'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-215'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <parameter type-id='type-id-217'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <parameter type-id='type-id-205'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorISt4pairIKmN15HeapLeakChecker10RangeValueEENS2_9AllocatorEE9constructEPS4_RKS4_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <parameter type-id='type-id-218'/>
          <parameter type-id='type-id-219'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorISt4pairIKmN15HeapLeakChecker10RangeValueEENS2_9AllocatorEE7destroyEPS4_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <parameter type-id='type-id-218'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-220'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <parameter type-id='type-id-222'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <parameter type-id='type-id-209'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorISt4pairIKmmEN15HeapLeakChecker9AllocatorEE7destroyEPS2_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <parameter type-id='type-id-223'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorISt4pairIKmmEN15HeapLeakChecker9AllocatorEE9constructEPS2_RKS2_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <parameter type-id='type-id-223'/>
          <parameter type-id='type-id-224'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-225'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-227'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt; &gt;' filepath='src/base/stl_allocator.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-213'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorISt4pairIKSbIcSt11char_traitsIcES_IcN15HeapLeakChecker9AllocatorEEESt6vectorI11AllocObjectS_IS9_S4_EEES4_E7destroyEPSC_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-228'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorISt4pairIKSbIcSt11char_traitsIcES_IcN15HeapLeakChecker9AllocatorEEESt6vectorI11AllocObjectS_IS9_S4_EEES4_E9constructEPSC_RKSC_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-228'/>
          <parameter type-id='type-id-229'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;void*, HeapLeakChecker::Allocator&gt;' size-in-bits='8' visibility='default' filepath='src/base/stl_allocator.h' line='60' column='1' id='type-id-230'>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='STL_Allocator' filepath='src/base/stl_allocator.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <parameter type-id='type-id-232'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~STL_Allocator' filepath='src/base/stl_allocator.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='destroy' mangled-name='_ZN13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE7destroyEPS0_' filepath='src/base/stl_allocator.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='max_size' mangled-name='_ZNK13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE8max_sizeEv' filepath='src/base/stl_allocator.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-233' is-artificial='yes'/>
          <return type-id='type-id-57'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='allocate' mangled-name='_ZN13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE8allocateEmPKv' filepath='src/base/stl_allocator.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <parameter type-id='type-id-5'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-121'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='construct' mangled-name='_ZN13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE9constructEPS0_RKS0_' filepath='src/base/stl_allocator.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-234'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='deallocate' mangled-name='_ZN13STL_AllocatorIPvN15HeapLeakChecker9AllocatorEE10deallocateEPS0_m' filepath='src/base/stl_allocator.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-5'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='HeapLeakChecker' size-in-bits='448' visibility='default' filepath='src/gperftools/heap-checker.h' line='78' column='1' id='type-id-235'>
      <member-type access='private'>
        <class-decl name='Disabler' size-in-bits='8' visibility='default' filepath='./src/gperftools/heap-checker.h' line='175' column='1' id='type-id-236'>
          <member-function access='private' constructor='yes'>
            <function-decl name='Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerC1Ev' filepath='./src/gperftools/heap-checker.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerC1Ev'>
              <parameter type-id='type-id-237' is-artificial='yes'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <function-decl name='~Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerD1Ev' filepath='./src/gperftools/heap-checker.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerD1Ev'>
              <parameter type-id='type-id-237' is-artificial='yes'/>
              <parameter type-id='type-id-1' is-artificial='yes'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='Disabler' filepath='./src/gperftools/heap-checker.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-237' is-artificial='yes'/>
              <parameter type-id='type-id-238'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ShouldSymbolize' filepath='./src/gperftools/heap-checker.h' line='225' column='1' id='type-id-239'>
          <underlying-type type-id='type-id-240'/>
          <enumerator name='SYMBOLIZE' value='0'/>
          <enumerator name='DO_NOT_SYMBOLIZE' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsTask' filepath='./src/gperftools/heap-checker.h' line='295' column='1' id='type-id-241'>
          <underlying-type type-id='type-id-240'/>
          <enumerator name='RECORD_GLOBAL_DATA' value='0'/>
          <enumerator name='DISABLE_LIBRARY_ALLOCS' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsResult' filepath='./src/gperftools/heap-checker.h' line='301' column='1' id='type-id-242'>
          <underlying-type type-id='type-id-240'/>
          <enumerator name='PROC_MAPS_USED' value='0'/>
          <enumerator name='CANT_OPEN_PROC_MAPS' value='1'/>
          <enumerator name='NO_SHARED_LIBS_IN_PROC_MAPS' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Allocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='292' column='1' id='type-id-243'>
          <data-member access='private' static='yes'>
            <var-decl name='arena_' type-id='type-id-74' mangled-name='_ZN15HeapLeakChecker9Allocator6arena_E' visibility='default' filepath='src/heap-checker.cc' line='333' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator6arena_E'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='alloc_count_' type-id='type-id-1' mangled-name='_ZN15HeapLeakChecker9Allocator12alloc_count_E' visibility='default' filepath='src/heap-checker.cc' line='334' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator12alloc_count_E'/>
          </data-member>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;DisabledRangeMap&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-244'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;GlobalRegionCallerRangeMap&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-245'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;HeapProfileTable&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-246'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNullIfNot&lt;DisabledRangeMap&gt;' filepath='src/heap-checker.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-244'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;LibraryLiveObjectsStacks&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-247'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;LiveObjectsStack&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNull&lt;StackTopSet&gt;' filepath='src/heap-checker.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-249'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='DeleteAndNullIfNot&lt;GlobalRegionCallerRangeMap&gt;' filepath='src/heap-checker.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-245'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Free' mangled-name='_ZN15HeapLeakChecker9Allocator4FreeEPvm' filepath='src/heap-checker.cc' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-53'/>
              <parameter type-id='type-id-57'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Shutdown' mangled-name='_ZN15HeapLeakChecker9Allocator8ShutdownEv' filepath='src/heap-checker.cc' line='299' column='1' visibility='default' binding='global' size-in-bits='64'>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Init' mangled-name='_ZN15HeapLeakChecker9Allocator4InitEv' filepath='src/heap-checker.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='alloc_count' mangled-name='_ZN15HeapLeakChecker9Allocator11alloc_countEv' filepath='src/heap-checker.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Allocate' mangled-name='_ZN15HeapLeakChecker9Allocator8AllocateEm' filepath='src/heap-checker.cc' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator8AllocateEm'>
              <parameter type-id='type-id-57'/>
              <return type-id='type-id-53'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Free' mangled-name='_ZN15HeapLeakChecker9Allocator4FreeEPv' filepath='src/heap-checker.cc' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator4FreeEPv'>
              <parameter type-id='type-id-53'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RangeValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='404' column='1' id='type-id-250'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_address' type-id='type-id-251' visibility='default' filepath='src/heap-checker.cc' line='405' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='max_depth' type-id='type-id-1' visibility='default' filepath='src/heap-checker.cc' line='406' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='lock_' type-id='type-id-252' visibility='default' filepath='./src/gperftools/heap-checker.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='name_' type-id='type-id-52' visibility='default' filepath='./src/gperftools/heap-checker.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='start_snapshot_' type-id='type-id-53' visibility='default' filepath='./src/gperftools/heap-checker.h' line='365' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='has_checked_' type-id='type-id-56' visibility='default' filepath='./src/gperftools/heap-checker.h' line='367' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='inuse_bytes_increase_' type-id='type-id-253' visibility='default' filepath='./src/gperftools/heap-checker.h' line='368' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='inuse_allocs_increase_' type-id='type-id-253' visibility='default' filepath='./src/gperftools/heap-checker.h' line='369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='keep_profiles_' type-id='type-id-56' visibility='default' filepath='./src/gperftools/heap-checker.h' line='371' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1EPKc' filepath='./src/gperftools/heap-checker.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1EPKc'>
          <parameter type-id='type-id-254' is-artificial='yes'/>
          <parameter type-id='type-id-52'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerD1Ev' filepath='./src/gperftools/heap-checker.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerD1Ev'>
          <parameter type-id='type-id-254' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1Ev' filepath='./src/gperftools/heap-checker.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1Ev'>
          <parameter type-id='type-id-254' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' filepath='./src/gperftools/heap-checker.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-254' is-artificial='yes'/>
          <parameter type-id='type-id-255'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreObject&lt;char&gt;' filepath='./src/gperftools/heap-checker.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-90'/>
          <return type-id='type-id-90'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksIn' mangled-name='_ZN15HeapLeakChecker15DisableChecksInEPKc' filepath='./src/gperftools/heap-checker.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DisableChecksInEPKc'>
          <parameter type-id='type-id-52'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeforeConstructorsLocked' mangled-name='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv' filepath='./src/gperftools/heap-checker.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv'>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeProfileNameLocked' mangled-name='_ZN15HeapLeakChecker21MakeProfileNameLockedEv' filepath='./src/gperftools/heap-checker.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker21MakeProfileNameLockedEv'>
          <parameter type-id='type-id-254' is-artificial='yes'/>
          <return type-id='type-id-90'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksFromToLocked' mangled-name='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i' filepath='./src/gperftools/heap-checker.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableLibraryAllocsLocked' mangled-name='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm' filepath='./src/gperftools/heap-checker.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm'>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-251'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='TurnItselfOffLocked' mangled-name='_ZN15HeapLeakChecker19TurnItselfOffLockedEv' filepath='./src/gperftools/heap-checker.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker19TurnItselfOffLockedEv'>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='HaveOnHeapLocked' mangled-name='_ZN15HeapLeakChecker16HaveOnHeapLockedEPPKvPm' filepath='./src/gperftools/heap-checker.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-256'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_' filepath='./src/gperftools/heap-checker.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_'>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-52'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetAllocCaller' mangled-name='_ZN15HeapLeakChecker14GetAllocCallerEPv' filepath='./src/gperftools/heap-checker.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14GetAllocCallerEPv'>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-53'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CancelGlobalCheck' mangled-name='_ZN15HeapLeakChecker17CancelGlobalCheckEv' filepath='./src/gperftools/heap-checker.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17CancelGlobalCheckEv'>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GlobalChecker' mangled-name='_ZN15HeapLeakChecker13GlobalCheckerEv' filepath='./src/gperftools/heap-checker.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13GlobalCheckerEv'>
          <return type-id='type-id-254'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsActive' mangled-name='_ZN15HeapLeakChecker8IsActiveEv' filepath='./src/gperftools/heap-checker.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8IsActiveEv'>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ObjectsLeaked' mangled-name='_ZNK15HeapLeakChecker13ObjectsLeakedEv' filepath='./src/gperftools/heap-checker.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker13ObjectsLeakedEv'>
          <parameter type-id='type-id-257' is-artificial='yes'/>
          <return type-id='type-id-253'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='BytesLeaked' mangled-name='_ZNK15HeapLeakChecker11BytesLeakedEv' filepath='./src/gperftools/heap-checker.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker11BytesLeakedEv'>
          <parameter type-id='type-id-257' is-artificial='yes'/>
          <return type-id='type-id-253'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnIgnoreObject' mangled-name='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv' filepath='./src/gperftools/heap-checker.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv'>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreNonThreadLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv' filepath='./src/gperftools/heap-checker.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv'>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoIgnoreObject' mangled-name='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv' filepath='./src/gperftools/heap-checker.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv'>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Create' mangled-name='_ZN15HeapLeakChecker6CreateEPKcb' filepath='./src/gperftools/heap-checker.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker6CreateEPKcb'>
          <parameter type-id='type-id-254' is-artificial='yes'/>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UseProcMapsLocked' mangled-name='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE' filepath='./src/gperftools/heap-checker.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE'>
          <parameter type-id='type-id-241'/>
          <return type-id='type-id-242'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveThreadsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag' filepath='./src/gperftools/heap-checker.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-63'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreAllLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv' filepath='./src/gperftools/heap-checker.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv'>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoNoLeaks' mangled-name='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE' filepath='./src/gperftools/heap-checker.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE'>
          <parameter type-id='type-id-254' is-artificial='yes'/>
          <parameter type-id='type-id-239'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaksMaybeSymbolize' mangled-name='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE' filepath='./src/gperftools/heap-checker.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE'>
          <parameter type-id='type-id-239'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaks' mangled-name='_ZN15HeapLeakChecker13NoGlobalLeaksEv' filepath='./src/gperftools/heap-checker.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13NoGlobalLeaksEv'>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoMainHeapCheck' mangled-name='_ZN15HeapLeakChecker15DoMainHeapCheckEv' filepath='./src/gperftools/heap-checker.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DoMainHeapCheckEv'>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreObject&lt;MallocExtension&gt;' filepath='src/gperftools/heap-checker.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-258'/>
          <return type-id='type-id-258'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='ObjectPlacement' filepath='src/heap-checker.cc' line='345' column='1' id='type-id-259'>
      <underlying-type type-id='type-id-240'/>
      <enumerator name='MUST_BE_ON_HEAP' value='0'/>
      <enumerator name='IGNORED_ON_HEAP' value='1'/>
      <enumerator name='MAYBE_LIVE' value='2'/>
      <enumerator name='IN_GLOBAL_DATA' value='3'/>
      <enumerator name='THREAD_DATA' value='4'/>
      <enumerator name='THREAD_REGISTERS' value='5'/>
    </enum-decl>
    <class-decl name='AllocObject' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-checker.cc' line='356' column='1' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-53' visibility='default' filepath='src/heap-checker.cc' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-251' visibility='default' filepath='src/heap-checker.cc' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='place' type-id='type-id-259' visibility='default' filepath='src/heap-checker.cc' line='359' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AllocObject' filepath='src/heap-checker.cc' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-187' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-259'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='LiveObjectsStack' type-id='type-id-261' filepath='src/heap-checker.cc' line='384' column='1' id='type-id-262'/>
    <typedef-decl name='LibraryLiveObjectsStacks' type-id='type-id-263' filepath='src/heap-checker.cc' line='397' column='1' id='type-id-264'/>
    <typedef-decl name='DisabledRangeMap' type-id='type-id-265' filepath='src/heap-checker.cc' line='411' column='1' id='type-id-266'/>
    <typedef-decl name='StackTopSet' type-id='type-id-267' filepath='src/heap-checker.cc' line='422' column='1' id='type-id-268'/>
    <typedef-decl name='GlobalRegionCallerRangeMap' type-id='type-id-269' filepath='src/heap-checker.cc' line='432' column='1' id='type-id-270'/>
    <class-decl name='HeapProfileStats' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='54' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocs' type-id='type-id-65' visibility='default' filepath='src/heap-profile-stats.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='frees' type-id='type-id-65' visibility='default' filepath='src/heap-profile-stats.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='alloc_size' type-id='type-id-76' visibility='default' filepath='src/heap-profile-stats.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='free_size' type-id='type-id-76' visibility='default' filepath='src/heap-profile-stats.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileBucket' size-in-bits='448' is-struct='yes' visibility='default' filepath='src/heap-profile-stats.h' line='68' column='1' id='type-id-272'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-271'/>
      <data-member access='public' static='yes'>
        <var-decl name='kMaxStackDepth' type-id='type-id-113' visibility='default' filepath='src/heap-profile-stats.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-251' visibility='default' filepath='src/heap-profile-stats.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-stats.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stack' type-id='type-id-121' visibility='default' filepath='src/heap-profile-stats.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='next' type-id='type-id-273' visibility='default' filepath='src/heap-profile-stats.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileTable' size-in-bits='832' visibility='default' filepath='src/heap-profile-table.h' line='51' column='1' id='type-id-274'>
      <member-type access='private'>
        <class-decl name='AllocInfo' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='66' column='1' id='type-id-275'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='object_size' type-id='type-id-57' visibility='default' filepath='src/heap-profile-table.h' line='67' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='call_stack' type-id='type-id-276' visibility='default' filepath='src/heap-profile-table.h' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='69' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='live' type-id='type-id-56' visibility='default' filepath='src/heap-profile-table.h' line='70' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='168'>
            <var-decl name='ignored' type-id='type-id-56' visibility='default' filepath='src/heap-profile-table.h' line='71' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocContextInfo' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='77' column='1' id='type-id-277'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-271'/>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='78' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='call_stack' type-id='type-id-276' visibility='default' filepath='src/heap-profile-table.h' line='79' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='Allocator' type-id='type-id-278' filepath='src/heap-profile-table.h' line='83' column='1' id='type-id-279'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='DeAllocator' type-id='type-id-137' filepath='src/heap-profile-table.h' line='84' column='1' id='type-id-280'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocIterator' type-id='type-id-161' filepath='src/heap-profile-table.h' line='138' column='1' id='type-id-281'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocContextIterator' type-id='type-id-282' filepath='src/heap-profile-table.h' line='147' column='1' id='type-id-283'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocValue' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='190' column='1' id='type-id-175'>
          <member-type access='private'>
            <typedef-decl name='Bucket' type-id='type-id-272' filepath='src/heap-profile-table.h' line='187' column='1' id='type-id-284'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='bytes' type-id='type-id-57' visibility='default' filepath='src/heap-profile-table.h' line='197' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kLive' type-id='type-id-113' visibility='default' filepath='src/heap-profile-table.h' line='214' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kIgnore' type-id='type-id-113' visibility='default' filepath='src/heap-profile-table.h' line='215' column='1'/>
          </data-member>
          <data-member access='private' static='yes'>
            <var-decl name='kMask' type-id='type-id-113' visibility='default' filepath='src/heap-profile-table.h' line='216' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='bucket_rep' type-id='type-id-251' visibility='default' filepath='src/heap-profile-table.h' line='218' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='bucket' mangled-name='_ZNK16HeapProfileTable10AllocValue6bucketEv' filepath='src/heap-profile-table.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-172' is-artificial='yes'/>
              <return type-id='type-id-285'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='live' mangled-name='_ZNK16HeapProfileTable10AllocValue4liveEv' filepath='src/heap-profile-table.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-172' is-artificial='yes'/>
              <return type-id='type-id-56'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ignore' mangled-name='_ZNK16HeapProfileTable10AllocValue6ignoreEv' filepath='src/heap-profile-table.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-172' is-artificial='yes'/>
              <return type-id='type-id-56'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='set_ignore' mangled-name='_ZN16HeapProfileTable10AllocValue10set_ignoreEb' filepath='src/heap-profile-table.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-174' is-artificial='yes'/>
              <parameter type-id='type-id-56'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='set_live' mangled-name='_ZN16HeapProfileTable10AllocValue8set_liveEb' filepath='src/heap-profile-table.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-174' is-artificial='yes'/>
              <parameter type-id='type-id-56'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='set_bucket' mangled-name='_ZN16HeapProfileTable10AllocValue10set_bucketEP17HeapProfileBucket' filepath='src/heap-profile-table.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-174' is-artificial='yes'/>
              <parameter type-id='type-id-285'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocationMap' type-id='type-id-148' filepath='src/heap-profile-table.h' line='224' column='1' id='type-id-286'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='BufferArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='227' column='1' id='type-id-287'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf' type-id='type-id-90' visibility='default' filepath='src/heap-profile-table.h' line='234' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='buflen' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='bufsize' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='236' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='BufferArgs' filepath='src/heap-profile-table.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-90'/>
              <parameter type-id='type-id-1'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='BufferArgs' filepath='src/heap-profile-table.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-288' is-artificial='yes'/>
              <parameter type-id='type-id-289'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='DumpArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='242' column='1' id='type-id-290'>
          <member-type access='public'>
            <typedef-decl name='Stats' type-id='type-id-271' filepath='src/heap-profile-table.h' line='63' column='1' id='type-id-291'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='fd' type-id='type-id-67' visibility='default' filepath='src/heap-profile-table.h' line='248' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='profile_stats' type-id='type-id-292' visibility='default' filepath='src/heap-profile-table.h' line='249' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='DumpArgs' filepath='src/heap-profile-table.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-293' is-artificial='yes'/>
              <parameter type-id='type-id-67'/>
              <parameter type-id='type-id-292'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AddNonLiveArgs' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='305' column='1' id='type-id-294'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='dest' type-id='type-id-166' visibility='default' filepath='src/heap-profile-table.h' line='306' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='base' type-id='type-id-166' visibility='default' filepath='src/heap-profile-table.h' line='307' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Snapshot' size-in-bits='768' is-struct='yes' visibility='default' filepath='src/heap-profile-table.h' line='347' column='1' id='type-id-295'>
          <member-type access='private'>
            <class-decl name='Entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='514' column='1' id='type-id-296'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='count' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='515' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='bytes' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='516' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='bucket' type-id='type-id-285' visibility='default' filepath='src/heap-profile-table.cc' line='517' column='1'/>
              </data-member>
              <member-function access='public' constructor='yes'>
                <function-decl name='Entry' filepath='src/heap-profile-table.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64'>
                  <parameter type-id='type-id-297' is-artificial='yes'/>
                  <return type-id='type-id-55'/>
                </function-decl>
              </member-function>
              <member-function access='public'>
                <function-decl name='operator&lt;' mangled-name='_ZNK16HeapProfileTable8Snapshot5EntryltERKS1_' filepath='src/heap-profile-table.cc' line='521' column='1' visibility='default' binding='global' size-in-bits='64'>
                  <parameter type-id='type-id-298' is-artificial='yes'/>
                  <parameter type-id='type-id-299'/>
                  <return type-id='type-id-56'/>
                </function-decl>
              </member-function>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <class-decl name='ReportState' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/heap-profile-table.cc' line='528' column='1' id='type-id-300'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='buckets_' type-id='type-id-301' visibility='default' filepath='src/heap-profile-table.cc' line='529' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='total_' type-id='type-id-284' visibility='default' filepath='src/heap-profile-table.h' line='372' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='map_' type-id='type-id-286' visibility='default' filepath='src/heap-profile-table.h' line='376' column='1'/>
          </data-member>
          <member-function access='private' constructor='yes'>
            <function-decl name='Snapshot' filepath='src/heap-profile-table.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-166' is-artificial='yes'/>
              <parameter type-id='type-id-279'/>
              <parameter type-id='type-id-280'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='Snapshot' filepath='src/heap-profile-table.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-166' is-artificial='yes'/>
              <parameter type-id='type-id-302'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='total' mangled-name='_ZNK16HeapProfileTable8Snapshot5totalEv' filepath='src/heap-profile-table.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-303' is-artificial='yes'/>
              <return type-id='type-id-304'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='Empty' mangled-name='_ZNK16HeapProfileTable8Snapshot5EmptyEv' filepath='src/heap-profile-table.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-303' is-artificial='yes'/>
              <return type-id='type-id-56'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='Add' mangled-name='_ZN16HeapProfileTable8Snapshot3AddEPKvRKNS_10AllocValueE' filepath='src/heap-profile-table.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-166' is-artificial='yes'/>
              <parameter type-id='type-id-53'/>
              <parameter type-id='type-id-305'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='ReportObject' mangled-name='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc' filepath='src/heap-profile-table.h' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc'>
              <parameter type-id='type-id-53'/>
              <parameter type-id='type-id-174'/>
              <parameter type-id='type-id-90'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportIndividualObjects' mangled-name='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv' filepath='src/heap-profile-table.h' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv'>
              <parameter type-id='type-id-166' is-artificial='yes'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='ReportCallback' mangled-name='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE' filepath='src/heap-profile-table.h' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE'>
              <parameter type-id='type-id-53'/>
              <parameter type-id='type-id-174'/>
              <parameter type-id='type-id-171'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportLeaks' mangled-name='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b' filepath='src/heap-profile-table.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b'>
              <parameter type-id='type-id-166' is-artificial='yes'/>
              <parameter type-id='type-id-52'/>
              <parameter type-id='type-id-52'/>
              <parameter type-id='type-id-56'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='kFileExt' type-id='type-id-124' mangled-name='_ZN16HeapProfileTable8kFileExtE' visibility='default' filepath='src/heap-profile-table.h' line='55' column='1' elf-symbol-id='_ZN16HeapProfileTable8kFileExtE'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='kMaxStackDepth' type-id='type-id-113' mangled-name='_ZN16HeapProfileTable14kMaxStackDepthE' visibility='default' filepath='src/heap-profile-table.h' line='58' column='1' elf-symbol-id='_ZN16HeapProfileTable14kMaxStackDepthE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='alloc_' type-id='type-id-279' visibility='default' filepath='src/heap-profile-table.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='dealloc_' type-id='type-id-280' visibility='default' filepath='src/heap-profile-table.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='total_' type-id='type-id-284' visibility='default' filepath='src/heap-profile-table.h' line='330' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='profile_mmap_' type-id='type-id-56' visibility='default' filepath='src/heap-profile-table.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='bucket_table_' type-id='type-id-306' visibility='default' filepath='src/heap-profile-table.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='num_buckets_' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='address_map_' type-id='type-id-307' visibility='default' filepath='src/heap-profile-table.h' line='342' column='1'/>
      </data-member>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapProfileTable' mangled-name='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb' filepath='src/heap-profile-table.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-279'/>
          <parameter type-id='type-id-280'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapProfileTable' mangled-name='_ZN16HeapProfileTableD1Ev' filepath='src/heap-profile-table.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableD1Ev'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapProfileTable' filepath='src/heap-profile-table.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-309'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='total' mangled-name='_ZNK16HeapProfileTable5totalEv' filepath='src/heap-profile-table.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-310' is-artificial='yes'/>
          <return type-id='type-id-304'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='IterateAllocs' mangled-name='_ZNK16HeapProfileTable13IterateAllocsEPFvPKvRKNS_9AllocInfoEE' filepath='src/heap-profile-table.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-310' is-artificial='yes'/>
          <parameter type-id='type-id-281'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MapArgsAllocIterator' mangled-name='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE' filepath='src/heap-profile-table.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-174'/>
          <parameter type-id='type-id-281'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocValueSize' mangled-name='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE' filepath='src/heap-profile-table.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE'>
          <parameter type-id='type-id-305'/>
          <return type-id='type-id-57'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ReleaseSnapshot' mangled-name='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-166'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnparseBucket' mangled-name='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats' filepath='src/heap-profile-table.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats'>
          <parameter type-id='type-id-311'/>
          <parameter type-id='type-id-90'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-292'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpNonLiveIterator' mangled-name='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE' filepath='src/heap-profile-table.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-174'/>
          <parameter type-id='type-id-169'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpBucketIterator' mangled-name='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE' filepath='src/heap-profile-table.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE'>
          <parameter type-id='type-id-312'/>
          <parameter type-id='type-id-288'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='GetBucket' mangled-name='_ZN16HeapProfileTable9GetBucketEiPKPKv' filepath='src/heap-profile-table.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable9GetBucketEiPKPKv'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-276'/>
          <return type-id='type-id-285'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetCallerStackTrace' mangled-name='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv' filepath='src/heap-profile-table.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeSortedBucketList' mangled-name='_ZNK16HeapProfileTable20MakeSortedBucketListEv' filepath='src/heap-profile-table.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable20MakeSortedBucketListEv'>
          <parameter type-id='type-id-310' is-artificial='yes'/>
          <return type-id='type-id-306'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='IterateOrderedAllocContexts' mangled-name='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE' filepath='src/heap-profile-table.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE'>
          <parameter type-id='type-id-310' is-artificial='yes'/>
          <parameter type-id='type-id-283'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FillOrderedProfile' mangled-name='_ZNK16HeapProfileTable18FillOrderedProfileEPci' filepath='src/heap-profile-table.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable18FillOrderedProfileEPci'>
          <parameter type-id='type-id-310' is-artificial='yes'/>
          <parameter type-id='type-id-90'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsIgnored' mangled-name='_ZN16HeapProfileTable13MarkAsIgnoredEPKv' filepath='src/heap-profile-table.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13MarkAsIgnoredEPKv'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='WriteProfile' mangled-name='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE' filepath='src/heap-profile-table.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE'>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-311'/>
          <parameter type-id='type-id-307'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindInsideAlloc' mangled-name='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm' filepath='src/heap-profile-table.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm'>
          <parameter type-id='type-id-310' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-256'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddToSnapshot' mangled-name='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE' filepath='src/heap-profile-table.h' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-174'/>
          <parameter type-id='type-id-166'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TakeSnapshot' mangled-name='_ZN16HeapProfileTable12TakeSnapshotEv' filepath='src/heap-profile-table.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12TakeSnapshotEv'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <return type-id='type-id-166'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordAlloc' mangled-name='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_' filepath='src/heap-profile-table.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-276'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordFree' mangled-name='_ZN16HeapProfileTable10RecordFreeEPKv' filepath='src/heap-profile-table.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10RecordFreeEPKv'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddIfNonLive' mangled-name='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE' filepath='src/heap-profile-table.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-174'/>
          <parameter type-id='type-id-164'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NonLiveSnapshot' mangled-name='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-166'/>
          <return type-id='type-id-166'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsLive' mangled-name='_ZN16HeapProfileTable10MarkAsLiveEPKv' filepath='src/heap-profile-table.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10MarkAsLiveEPKv'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CleanupOldProfiles' mangled-name='_ZN16HeapProfileTable18CleanupOldProfilesEPKc' filepath='src/heap-profile-table.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18CleanupOldProfilesEPKc'>
          <parameter type-id='type-id-52'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAllocDetails' mangled-name='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE' filepath='src/heap-profile-table.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE'>
          <parameter type-id='type-id-310' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-313'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAlloc' mangled-name='_ZNK16HeapProfileTable9FindAllocEPKvPm' filepath='src/heap-profile-table.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable9FindAllocEPKvPm'>
          <parameter type-id='type-id-310' is-artificial='yes'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-256'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MemoryRegionMap' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='69' column='1' id='type-id-314'>
      <member-type access='private'>
        <union-decl name='RegionSetRep' size-in-bits='384' visibility='default' filepath='src/memory_region_map.cc' line='177' column='1' id='type-id-315'>
          <data-member access='public'>
            <var-decl name='rep' type-id='type-id-316' visibility='default' filepath='src/memory_region_map.cc' line='178' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='align_it' type-id='type-id-53' visibility='default' filepath='src/memory_region_map.cc' line='179' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='LockHolder' size-in-bits='8' visibility='default' filepath='src/memory_region_map.h' line='126' column='1' id='type-id-317'>
          <member-function access='private' constructor='yes'>
            <function-decl name='LockHolder' filepath='src/memory_region_map.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-318' is-artificial='yes'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private' destructor='yes'>
            <function-decl name='~LockHolder' filepath='src/memory_region_map.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-318' is-artificial='yes'/>
              <parameter type-id='type-id-1' is-artificial='yes'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='LockHolder' filepath='src/memory_region_map.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-318' is-artificial='yes'/>
              <parameter type-id='type-id-319'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Region' size-in-bits='2304' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='137' column='1' id='type-id-320'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_addr' type-id='type-id-251' visibility='default' filepath='src/memory_region_map.h' line='138' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='end_addr' type-id='type-id-251' visibility='default' filepath='src/memory_region_map.h' line='139' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='call_stack_depth' type-id='type-id-1' visibility='default' filepath='src/memory_region_map.h' line='140' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='call_stack' type-id='type-id-128' visibility='default' filepath='src/memory_region_map.h' line='141' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2240'>
            <var-decl name='is_stack' type-id='type-id-56' visibility='default' filepath='src/memory_region_map.h' line='143' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='caller' mangled-name='_ZNK15MemoryRegionMap6Region6callerEv' filepath='src/memory_region_map.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-321' is-artificial='yes'/>
              <return type-id='type-id-251'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='AssertIsConsistent' mangled-name='_ZNK15MemoryRegionMap6Region18AssertIsConsistentEv' filepath='src/memory_region_map.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-321' is-artificial='yes'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='SetRegionSetKey' mangled-name='_ZN15MemoryRegionMap6Region15SetRegionSetKeyEm' filepath='src/memory_region_map.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-322' is-artificial='yes'/>
              <parameter type-id='type-id-251'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='set_end_addr' mangled-name='_ZN15MemoryRegionMap6Region12set_end_addrEm' filepath='src/memory_region_map.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-322' is-artificial='yes'/>
              <parameter type-id='type-id-251'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='set_start_addr' mangled-name='_ZN15MemoryRegionMap6Region14set_start_addrEm' filepath='src/memory_region_map.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-322' is-artificial='yes'/>
              <parameter type-id='type-id-251'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='Create' mangled-name='_ZN15MemoryRegionMap6Region6CreateEPKvm' filepath='src/memory_region_map.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-322' is-artificial='yes'/>
              <parameter type-id='type-id-53'/>
              <parameter type-id='type-id-57'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='set_call_stack_depth' mangled-name='_ZN15MemoryRegionMap6Region20set_call_stack_depthEi' filepath='src/memory_region_map.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-322' is-artificial='yes'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='set_is_stack' mangled-name='_ZN15MemoryRegionMap6Region12set_is_stackEv' filepath='src/memory_region_map.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-322' is-artificial='yes'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RegionCmp' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='245' column='1' id='type-id-323'>
          <member-function access='public'>
            <function-decl name='operator()' mangled-name='_ZNK15MemoryRegionMap9RegionCmpclERKNS_6RegionES3_' filepath='src/memory_region_map.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-324' is-artificial='yes'/>
              <parameter type-id='type-id-325'/>
              <parameter type-id='type-id-325'/>
              <return type-id='type-id-56'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='MyAllocator' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/memory_region_map.h' line='252' column='1' id='type-id-326'>
          <member-function access='public' static='yes'>
            <function-decl name='Free' mangled-name='_ZN15MemoryRegionMap11MyAllocator4FreeEPKvm' filepath='src/memory_region_map.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-53'/>
              <parameter type-id='type-id-57'/>
              <return type-id='type-id-55'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Allocate' mangled-name='_ZN15MemoryRegionMap11MyAllocator8AllocateEm' filepath='src/memory_region_map.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-57'/>
              <return type-id='type-id-53'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionSet' type-id='type-id-327' filepath='src/memory_region_map.h' line='263' column='1' id='type-id-328'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionIterator' type-id='type-id-329' filepath='src/memory_region_map.h' line='268' column='1' id='type-id-330'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='client_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap13client_count_E' visibility='default' filepath='src/memory_region_map.h' line='292' column='1' elf-symbol-id='_ZN15MemoryRegionMap13client_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='max_stack_depth_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16max_stack_depth_E' visibility='default' filepath='src/memory_region_map.h' line='295' column='1' elf-symbol-id='_ZN15MemoryRegionMap16max_stack_depth_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='arena_' type-id='type-id-74' mangled-name='_ZN15MemoryRegionMap6arena_E' visibility='default' filepath='src/memory_region_map.h' line='298' column='1' elf-symbol-id='_ZN15MemoryRegionMap6arena_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='regions_' type-id='type-id-331' mangled-name='_ZN15MemoryRegionMap8regions_E' visibility='default' filepath='src/memory_region_map.h' line='306' column='1' elf-symbol-id='_ZN15MemoryRegionMap8regions_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='lock_' type-id='type-id-183' mangled-name='_ZN15MemoryRegionMap5lock_E' visibility='default' filepath='src/memory_region_map.h' line='309' column='1' elf-symbol-id='_ZN15MemoryRegionMap5lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='owner_lock_' type-id='type-id-183' mangled-name='_ZN15MemoryRegionMap11owner_lock_E' visibility='default' filepath='src/memory_region_map.h' line='311' column='1' elf-symbol-id='_ZN15MemoryRegionMap11owner_lock_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='recursion_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16recursion_count_E' visibility='default' filepath='src/memory_region_map.h' line='314' column='1' elf-symbol-id='_ZN15MemoryRegionMap16recursion_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='lock_owner_tid_' type-id='type-id-332' mangled-name='_ZN15MemoryRegionMap15lock_owner_tid_E' visibility='default' filepath='src/memory_region_map.h' line='316' column='1' elf-symbol-id='_ZN15MemoryRegionMap15lock_owner_tid_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='map_size_' type-id='type-id-76' mangled-name='_ZN15MemoryRegionMap9map_size_E' visibility='default' filepath='src/memory_region_map.h' line='319' column='1' elf-symbol-id='_ZN15MemoryRegionMap9map_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='unmap_size_' type-id='type-id-76' mangled-name='_ZN15MemoryRegionMap11unmap_size_E' visibility='default' filepath='src/memory_region_map.h' line='321' column='1' elf-symbol-id='_ZN15MemoryRegionMap11unmap_size_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='bucket_table_' type-id='type-id-333' mangled-name='_ZN15MemoryRegionMap13bucket_table_E' visibility='default' filepath='src/memory_region_map.h' line='324' column='1' elf-symbol-id='_ZN15MemoryRegionMap13bucket_table_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='num_buckets_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap12num_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='325' column='1' elf-symbol-id='_ZN15MemoryRegionMap12num_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap20saved_buckets_count_E' visibility='default' filepath='src/memory_region_map.h' line='337' column='1' elf-symbol-id='_ZN15MemoryRegionMap20saved_buckets_count_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_' type-id='type-id-334' mangled-name='_ZN15MemoryRegionMap14saved_buckets_E' visibility='default' filepath='src/memory_region_map.h' line='343' column='1' elf-symbol-id='_ZN15MemoryRegionMap14saved_buckets_E'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='saved_buckets_keys_' type-id='type-id-335' mangled-name='_ZN15MemoryRegionMap19saved_buckets_keys_E' visibility='default' filepath='src/memory_region_map.h' line='345' column='1' elf-symbol-id='_ZN15MemoryRegionMap19saved_buckets_keys_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='IterateBuckets&lt;HeapProfileTable::BufferArgs*&gt;' filepath='src/memory_region_map.h' line='402' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-336'/>
          <parameter type-id='type-id-288'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='HandleSavedRegionsLocked' mangled-name='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE' filepath='src/memory_region_map.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE'>
          <parameter type-id='type-id-337'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Unlock' mangled-name='_ZN15MemoryRegionMap6UnlockEv' filepath='src/memory_region_map.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap6UnlockEv'>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LockIsHeld' mangled-name='_ZN15MemoryRegionMap10LockIsHeldEv' filepath='src/memory_region_map.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10LockIsHeldEv'>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LogAllLocked' mangled-name='_ZN15MemoryRegionMap12LogAllLockedEv' filepath='src/memory_region_map.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap12LogAllLockedEv'>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoInsertRegionLocked' mangled-name='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.h' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE'>
          <parameter type-id='type-id-325'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='EndRegionLocked' mangled-name='_ZN15MemoryRegionMap15EndRegionLockedEv' filepath='src/memory_region_map.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap15EndRegionLockedEv'>
          <return type-id='type-id-330'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeginRegionLocked' mangled-name='_ZN15MemoryRegionMap17BeginRegionLockedEv' filepath='src/memory_region_map.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17BeginRegionLockedEv'>
          <return type-id='type-id-330'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoFindRegionLocked' mangled-name='_ZN15MemoryRegionMap18DoFindRegionLockedEm' filepath='src/memory_region_map.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18DoFindRegionLockedEm'>
          <parameter type-id='type-id-251'/>
          <return type-id='type-id-321'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsRecordingLocked' mangled-name='_ZN15MemoryRegionMap17IsRecordingLockedEv' filepath='src/memory_region_map.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17IsRecordingLockedEv'>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Lock' mangled-name='_ZN15MemoryRegionMap4LockEv' filepath='src/memory_region_map.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4LockEv'>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindAndMarkStackRegion' mangled-name='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE' filepath='src/memory_region_map.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE'>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-322'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindRegion' mangled-name='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE' filepath='src/memory_region_map.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE'>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-322'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Shutdown' mangled-name='_ZN15MemoryRegionMap8ShutdownEv' filepath='src/memory_region_map.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8ShutdownEv'>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Init' mangled-name='_ZN15MemoryRegionMap4InitEib' filepath='src/memory_region_map.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4InitEib'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RestoreSavedBucketsLocked' mangled-name='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv' filepath='src/memory_region_map.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv'>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetBucket' mangled-name='_ZN15MemoryRegionMap9GetBucketEiPKPKv' filepath='src/memory_region_map.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap9GetBucketEiPKPKv'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-276'/>
          <return type-id='type-id-273'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemovalInBucket' mangled-name='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm' filepath='src/memory_region_map.h' line='379' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-276'/>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='InsertRegionLocked' mangled-name='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE'>
          <parameter type-id='type-id-325'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionAddition' mangled-name='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm' filepath='src/memory_region_map.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MmapHook' mangled-name='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil' filepath='src/memory_region_map.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-146'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemoval' mangled-name='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm' filepath='src/memory_region_map.h' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MunmapHook' mangled-name='_ZN15MemoryRegionMap10MunmapHookEPKvm' filepath='src/memory_region_map.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MunmapHookEPKvm'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-57'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='SbrkHook' mangled-name='_ZN15MemoryRegionMap8SbrkHookEPKvl' filepath='src/memory_region_map.h' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8SbrkHookEPKvl'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-338'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MremapHook' mangled-name='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_' filepath='src/memory_region_map.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_'>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-53'/>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-57'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-53'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-157'/>
    <reference-type-def kind='lvalue' type-id='type-id-260' size-in-bits='64' id='type-id-339'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-187'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-340'/>
    <reference-type-def kind='lvalue' type-id='type-id-340' size-in-bits='64' id='type-id-341'/>
    <reference-type-def kind='lvalue' type-id='type-id-187' size-in-bits='64' id='type-id-342'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-343'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-244'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-344'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-245'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-237'/>
    <reference-type-def kind='lvalue' type-id='type-id-250' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-346'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-318'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-322'/>
    <reference-type-def kind='lvalue' type-id='type-id-184' size-in-bits='64' id='type-id-348'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <reference-type-def kind='lvalue' type-id='type-id-200' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <reference-type-def kind='lvalue' type-id='type-id-203' size-in-bits='64' id='type-id-350'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <reference-type-def kind='lvalue' type-id='type-id-207' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <reference-type-def kind='lvalue' type-id='type-id-211' size-in-bits='64' id='type-id-352'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-221'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <reference-type-def kind='lvalue' type-id='type-id-230' size-in-bits='64' id='type-id-353'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-249'/>
    <reference-type-def kind='lvalue' type-id='type-id-355' size-in-bits='64' id='type-id-356'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-357'/>
    <reference-type-def kind='lvalue' type-id='type-id-358' size-in-bits='64' id='type-id-359'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-360'/>
    <reference-type-def kind='lvalue' type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-363'/>
    <reference-type-def kind='lvalue' type-id='type-id-364' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-366'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-370'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-372'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-373'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-159'/>
    <qualified-type-def type-id='type-id-260' const='yes' id='type-id-374'/>
    <reference-type-def kind='lvalue' type-id='type-id-374' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-375'/>
    <qualified-type-def type-id='type-id-375' const='yes' id='type-id-376'/>
    <reference-type-def kind='lvalue' type-id='type-id-376' size-in-bits='64' id='type-id-377'/>
    <qualified-type-def type-id='type-id-177' const='yes' id='type-id-179'/>
    <qualified-type-def type-id='type-id-235' const='yes' id='type-id-378'/>
    <reference-type-def kind='lvalue' type-id='type-id-378' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-257'/>
    <qualified-type-def type-id='type-id-236' const='yes' id='type-id-379'/>
    <reference-type-def kind='lvalue' type-id='type-id-379' size-in-bits='64' id='type-id-238'/>
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-380'/>
    <reference-type-def kind='lvalue' type-id='type-id-380' size-in-bits='64' id='type-id-381'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-382'/>
    <reference-type-def kind='lvalue' type-id='type-id-382' size-in-bits='64' id='type-id-383'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-384'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-385'/>
    <reference-type-def kind='lvalue' type-id='type-id-385' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-310'/>
    <qualified-type-def type-id='type-id-277' const='yes' id='type-id-386'/>
    <reference-type-def kind='lvalue' type-id='type-id-386' size-in-bits='64' id='type-id-387'/>
    <qualified-type-def type-id='type-id-275' const='yes' id='type-id-388'/>
    <reference-type-def kind='lvalue' type-id='type-id-388' size-in-bits='64' id='type-id-389'/>
    <qualified-type-def type-id='type-id-175' const='yes' id='type-id-390'/>
    <reference-type-def kind='lvalue' type-id='type-id-390' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-172'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-391'/>
    <reference-type-def kind='lvalue' type-id='type-id-391' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-312'/>
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-392'/>
    <reference-type-def kind='lvalue' type-id='type-id-392' size-in-bits='64' id='type-id-289'/>
    <qualified-type-def type-id='type-id-290' const='yes' id='type-id-393'/>
    <reference-type-def kind='lvalue' type-id='type-id-393' size-in-bits='64' id='type-id-169'/>
    <qualified-type-def type-id='type-id-291' const='yes' id='type-id-394'/>
    <reference-type-def kind='lvalue' type-id='type-id-394' size-in-bits='64' id='type-id-304'/>
    <qualified-type-def type-id='type-id-295' const='yes' id='type-id-395'/>
    <reference-type-def kind='lvalue' type-id='type-id-395' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-303'/>
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-396'/>
    <reference-type-def kind='lvalue' type-id='type-id-396' size-in-bits='64' id='type-id-319'/>
    <qualified-type-def type-id='type-id-320' const='yes' id='type-id-397'/>
    <reference-type-def kind='lvalue' type-id='type-id-397' size-in-bits='64' id='type-id-325'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-321'/>
    <qualified-type-def type-id='type-id-184' const='yes' id='type-id-398'/>
    <reference-type-def kind='lvalue' type-id='type-id-398' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-188'/>
    <qualified-type-def type-id='type-id-190' const='yes' id='type-id-399'/>
    <reference-type-def kind='lvalue' type-id='type-id-399' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-193'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-400'/>
    <reference-type-def kind='lvalue' type-id='type-id-400' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-401'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-402'/>
    <reference-type-def kind='lvalue' type-id='type-id-402' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-403'/>
    <qualified-type-def type-id='type-id-203' const='yes' id='type-id-404'/>
    <reference-type-def kind='lvalue' type-id='type-id-404' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-405'/>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-406'/>
    <reference-type-def kind='lvalue' type-id='type-id-406' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-407'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-408'/>
    <reference-type-def kind='lvalue' type-id='type-id-408' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-410'/>
    <reference-type-def kind='lvalue' type-id='type-id-410' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-411'/>
    <qualified-type-def type-id='type-id-220' const='yes' id='type-id-412'/>
    <reference-type-def kind='lvalue' type-id='type-id-412' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-413'/>
    <qualified-type-def type-id='type-id-225' const='yes' id='type-id-414'/>
    <reference-type-def kind='lvalue' type-id='type-id-414' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <qualified-type-def type-id='type-id-230' const='yes' id='type-id-416'/>
    <reference-type-def kind='lvalue' type-id='type-id-416' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-233'/>
    <qualified-type-def type-id='type-id-355' const='yes' id='type-id-417'/>
    <reference-type-def kind='lvalue' type-id='type-id-417' size-in-bits='64' id='type-id-418'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-419'/>
    <qualified-type-def type-id='type-id-358' const='yes' id='type-id-420'/>
    <reference-type-def kind='lvalue' type-id='type-id-420' size-in-bits='64' id='type-id-421'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-422'/>
    <qualified-type-def type-id='type-id-361' const='yes' id='type-id-423'/>
    <reference-type-def kind='lvalue' type-id='type-id-423' size-in-bits='64' id='type-id-424'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-425'/>
    <qualified-type-def type-id='type-id-364' const='yes' id='type-id-426'/>
    <reference-type-def kind='lvalue' type-id='type-id-426' size-in-bits='64' id='type-id-427'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-428'/>
    <qualified-type-def type-id='type-id-367' const='yes' id='type-id-429'/>
    <reference-type-def kind='lvalue' type-id='type-id-429' size-in-bits='64' id='type-id-430'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-431'/>
    <qualified-type-def type-id='type-id-369' const='yes' id='type-id-432'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-433'/>
    <qualified-type-def type-id='type-id-371' const='yes' id='type-id-434'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <reference-type-def kind='lvalue' type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-178'/>
    <reference-type-def kind='lvalue' type-id='type-id-178' size-in-bits='64' id='type-id-438'/>
    <reference-type-def kind='lvalue' type-id='type-id-89' size-in-bits='64' id='type-id-439'/>
    <qualified-type-def type-id='type-id-440' const='yes' id='type-id-441'/>
    <pointer-type-def type-id='type-id-441' size-in-bits='64' id='type-id-442'/>
    <qualified-type-def type-id='type-id-443' const='yes' id='type-id-444'/>
    <reference-type-def kind='lvalue' type-id='type-id-444' size-in-bits='64' id='type-id-445'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' id='type-id-446'/>
    <qualified-type-def type-id='type-id-447' const='yes' id='type-id-448'/>
    <reference-type-def kind='lvalue' type-id='type-id-448' size-in-bits='64' id='type-id-449'/>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-450'/>
    <qualified-type-def type-id='type-id-451' const='yes' id='type-id-452'/>
    <reference-type-def kind='lvalue' type-id='type-id-452' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-454'/>
    <qualified-type-def type-id='type-id-455' const='yes' id='type-id-456'/>
    <reference-type-def kind='lvalue' type-id='type-id-456' size-in-bits='64' id='type-id-457'/>
    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-458'/>
    <qualified-type-def type-id='type-id-329' const='yes' id='type-id-459'/>
    <reference-type-def kind='lvalue' type-id='type-id-459' size-in-bits='64' id='type-id-460'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' id='type-id-461'/>
    <qualified-type-def type-id='type-id-462' const='yes' id='type-id-463'/>
    <reference-type-def kind='lvalue' type-id='type-id-463' size-in-bits='64' id='type-id-464'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-465'/>
    <qualified-type-def type-id='type-id-466' const='yes' id='type-id-467'/>
    <reference-type-def kind='lvalue' type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-469'/>
    <qualified-type-def type-id='type-id-470' const='yes' id='type-id-471'/>
    <reference-type-def kind='lvalue' type-id='type-id-471' size-in-bits='64' id='type-id-472'/>
    <pointer-type-def type-id='type-id-471' size-in-bits='64' id='type-id-473'/>
    <qualified-type-def type-id='type-id-474' const='yes' id='type-id-475'/>
    <reference-type-def kind='lvalue' type-id='type-id-475' size-in-bits='64' id='type-id-476'/>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' id='type-id-477'/>
    <qualified-type-def type-id='type-id-478' const='yes' id='type-id-479'/>
    <reference-type-def kind='lvalue' type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <qualified-type-def type-id='type-id-481' const='yes' id='type-id-482'/>
    <reference-type-def kind='lvalue' type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-484'/>
    <qualified-type-def type-id='type-id-485' const='yes' id='type-id-486'/>
    <reference-type-def kind='lvalue' type-id='type-id-486' size-in-bits='64' id='type-id-487'/>
    <pointer-type-def type-id='type-id-486' size-in-bits='64' id='type-id-488'/>
    <qualified-type-def type-id='type-id-489' const='yes' id='type-id-490'/>
    <reference-type-def kind='lvalue' type-id='type-id-490' size-in-bits='64' id='type-id-491'/>
    <pointer-type-def type-id='type-id-490' size-in-bits='64' id='type-id-492'/>
    <qualified-type-def type-id='type-id-493' const='yes' id='type-id-494'/>
    <reference-type-def kind='lvalue' type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-496'/>
    <qualified-type-def type-id='type-id-497' const='yes' id='type-id-498'/>
    <pointer-type-def type-id='type-id-498' size-in-bits='64' id='type-id-499'/>
    <qualified-type-def type-id='type-id-500' const='yes' id='type-id-501'/>
    <reference-type-def kind='lvalue' type-id='type-id-501' size-in-bits='64' id='type-id-502'/>
    <pointer-type-def type-id='type-id-501' size-in-bits='64' id='type-id-503'/>
    <qualified-type-def type-id='type-id-504' const='yes' id='type-id-505'/>
    <reference-type-def kind='lvalue' type-id='type-id-505' size-in-bits='64' id='type-id-506'/>
    <pointer-type-def type-id='type-id-505' size-in-bits='64' id='type-id-507'/>
    <qualified-type-def type-id='type-id-508' const='yes' id='type-id-509'/>
    <reference-type-def kind='lvalue' type-id='type-id-509' size-in-bits='64' id='type-id-510'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' id='type-id-511'/>
    <qualified-type-def type-id='type-id-512' const='yes' id='type-id-513'/>
    <reference-type-def kind='lvalue' type-id='type-id-513' size-in-bits='64' id='type-id-514'/>
    <pointer-type-def type-id='type-id-513' size-in-bits='64' id='type-id-515'/>
    <qualified-type-def type-id='type-id-516' const='yes' id='type-id-517'/>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' id='type-id-518'/>
    <qualified-type-def type-id='type-id-519' const='yes' id='type-id-520'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' id='type-id-521'/>
    <qualified-type-def type-id='type-id-522' const='yes' id='type-id-523'/>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <qualified-type-def type-id='type-id-525' const='yes' id='type-id-526'/>
    <pointer-type-def type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <qualified-type-def type-id='type-id-528' const='yes' id='type-id-529'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-530'/>
    <qualified-type-def type-id='type-id-531' const='yes' id='type-id-532'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <qualified-type-def type-id='type-id-534' const='yes' id='type-id-535'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <qualified-type-def type-id='type-id-537' const='yes' id='type-id-538'/>
    <reference-type-def kind='lvalue' type-id='type-id-538' size-in-bits='64' id='type-id-539'/>
    <qualified-type-def type-id='type-id-540' const='yes' id='type-id-541'/>
    <reference-type-def kind='lvalue' type-id='type-id-541' size-in-bits='64' id='type-id-542'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-543'/>
    <qualified-type-def type-id='type-id-544' const='yes' id='type-id-545'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' id='type-id-546'/>
    <qualified-type-def type-id='type-id-547' const='yes' id='type-id-548'/>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-549'/>
    <qualified-type-def type-id='type-id-550' const='yes' id='type-id-551'/>
    <reference-type-def kind='lvalue' type-id='type-id-551' size-in-bits='64' id='type-id-552'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-553'/>
    <qualified-type-def type-id='type-id-554' const='yes' id='type-id-555'/>
    <reference-type-def kind='lvalue' type-id='type-id-555' size-in-bits='64' id='type-id-556'/>
    <qualified-type-def type-id='type-id-557' const='yes' id='type-id-558'/>
    <reference-type-def kind='lvalue' type-id='type-id-558' size-in-bits='64' id='type-id-559'/>
    <pointer-type-def type-id='type-id-558' size-in-bits='64' id='type-id-560'/>
    <qualified-type-def type-id='type-id-561' const='yes' id='type-id-562'/>
    <reference-type-def kind='lvalue' type-id='type-id-562' size-in-bits='64' id='type-id-563'/>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' id='type-id-564'/>
    <qualified-type-def type-id='type-id-265' const='yes' id='type-id-565'/>
    <reference-type-def kind='lvalue' type-id='type-id-565' size-in-bits='64' id='type-id-566'/>
    <pointer-type-def type-id='type-id-565' size-in-bits='64' id='type-id-567'/>
    <qualified-type-def type-id='type-id-269' const='yes' id='type-id-568'/>
    <reference-type-def kind='lvalue' type-id='type-id-568' size-in-bits='64' id='type-id-569'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-570'/>
    <qualified-type-def type-id='type-id-263' const='yes' id='type-id-571'/>
    <reference-type-def kind='lvalue' type-id='type-id-571' size-in-bits='64' id='type-id-572'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' id='type-id-573'/>
    <qualified-type-def type-id='type-id-574' const='yes' id='type-id-575'/>
    <reference-type-def kind='lvalue' type-id='type-id-575' size-in-bits='64' id='type-id-219'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-576'/>
    <qualified-type-def type-id='type-id-577' const='yes' id='type-id-578'/>
    <reference-type-def kind='lvalue' type-id='type-id-578' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-578' size-in-bits='64' id='type-id-579'/>
    <qualified-type-def type-id='type-id-580' const='yes' id='type-id-581'/>
    <reference-type-def kind='lvalue' type-id='type-id-581' size-in-bits='64' id='type-id-229'/>
    <pointer-type-def type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <qualified-type-def type-id='type-id-583' const='yes' id='type-id-584'/>
    <reference-type-def kind='lvalue' type-id='type-id-584' size-in-bits='64' id='type-id-585'/>
    <qualified-type-def type-id='type-id-586' const='yes' id='type-id-587'/>
    <reference-type-def kind='lvalue' type-id='type-id-587' size-in-bits='64' id='type-id-588'/>
    <qualified-type-def type-id='type-id-267' const='yes' id='type-id-589'/>
    <reference-type-def kind='lvalue' type-id='type-id-589' size-in-bits='64' id='type-id-590'/>
    <pointer-type-def type-id='type-id-589' size-in-bits='64' id='type-id-591'/>
    <qualified-type-def type-id='type-id-261' const='yes' id='type-id-592'/>
    <reference-type-def kind='lvalue' type-id='type-id-592' size-in-bits='64' id='type-id-593'/>
    <pointer-type-def type-id='type-id-592' size-in-bits='64' id='type-id-594'/>
    <qualified-type-def type-id='type-id-595' const='yes' id='type-id-596'/>
    <reference-type-def kind='lvalue' type-id='type-id-596' size-in-bits='64' id='type-id-597'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' id='type-id-598'/>
    <qualified-type-def type-id='type-id-599' const='yes' id='type-id-600'/>
    <reference-type-def kind='lvalue' type-id='type-id-600' size-in-bits='64' id='type-id-601'/>
    <pointer-type-def type-id='type-id-600' size-in-bits='64' id='type-id-602'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-155'/>
    <pointer-type-def type-id='type-id-603' size-in-bits='64' id='type-id-604'/>
    <reference-type-def kind='lvalue' type-id='type-id-443' size-in-bits='64' id='type-id-605'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-606'/>
    <pointer-type-def type-id='type-id-607' size-in-bits='64' id='type-id-608'/>
    <reference-type-def kind='lvalue' type-id='type-id-447' size-in-bits='64' id='type-id-609'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-610'/>
    <pointer-type-def type-id='type-id-611' size-in-bits='64' id='type-id-612'/>
    <reference-type-def kind='lvalue' type-id='type-id-451' size-in-bits='64' id='type-id-613'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' id='type-id-614'/>
    <pointer-type-def type-id='type-id-615' size-in-bits='64' id='type-id-616'/>
    <reference-type-def kind='lvalue' type-id='type-id-455' size-in-bits='64' id='type-id-617'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-618'/>
    <pointer-type-def type-id='type-id-619' size-in-bits='64' id='type-id-620'/>
    <reference-type-def kind='lvalue' type-id='type-id-329' size-in-bits='64' id='type-id-621'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-622'/>
    <reference-type-def kind='lvalue' type-id='type-id-462' size-in-bits='64' id='type-id-623'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' id='type-id-624'/>
    <reference-type-def kind='lvalue' type-id='type-id-466' size-in-bits='64' id='type-id-625'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-470' size-in-bits='64' id='type-id-627'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-628'/>
    <reference-type-def kind='lvalue' type-id='type-id-474' size-in-bits='64' id='type-id-629'/>
    <pointer-type-def type-id='type-id-474' size-in-bits='64' id='type-id-630'/>
    <reference-type-def kind='lvalue' type-id='type-id-481' size-in-bits='64' id='type-id-631'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-632'/>
    <reference-type-def kind='lvalue' type-id='type-id-485' size-in-bits='64' id='type-id-633'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-634'/>
    <reference-type-def kind='lvalue' type-id='type-id-489' size-in-bits='64' id='type-id-635'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-636'/>
    <reference-type-def kind='lvalue' type-id='type-id-493' size-in-bits='64' id='type-id-637'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' id='type-id-638'/>
    <reference-type-def kind='lvalue' type-id='type-id-500' size-in-bits='64' id='type-id-639'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-202'/>
    <reference-type-def kind='lvalue' type-id='type-id-504' size-in-bits='64' id='type-id-640'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-206'/>
    <reference-type-def kind='lvalue' type-id='type-id-508' size-in-bits='64' id='type-id-641'/>
    <pointer-type-def type-id='type-id-508' size-in-bits='64' id='type-id-210'/>
    <reference-type-def kind='lvalue' type-id='type-id-512' size-in-bits='64' id='type-id-642'/>
    <pointer-type-def type-id='type-id-512' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-516' size-in-bits='64' id='type-id-643'/>
    <reference-type-def kind='lvalue' type-id='type-id-643' size-in-bits='64' id='type-id-644'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-645'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' id='type-id-647'/>
    <pointer-type-def type-id='type-id-531' size-in-bits='64' id='type-id-648'/>
    <pointer-type-def type-id='type-id-649' size-in-bits='64' id='type-id-650'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' id='type-id-651'/>
    <pointer-type-def type-id='type-id-652' size-in-bits='64' id='type-id-653'/>
    <reference-type-def kind='lvalue' type-id='type-id-537' size-in-bits='64' id='type-id-654'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' id='type-id-655'/>
    <reference-type-def kind='lvalue' type-id='type-id-540' size-in-bits='64' id='type-id-656'/>
    <pointer-type-def type-id='type-id-540' size-in-bits='64' id='type-id-657'/>
    <pointer-type-def type-id='type-id-658' size-in-bits='64' id='type-id-659'/>
    <reference-type-def kind='lvalue' type-id='type-id-544' size-in-bits='64' id='type-id-660'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-661'/>
    <reference-type-def kind='lvalue' type-id='type-id-550' size-in-bits='64' id='type-id-662'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-663'/>
    <reference-type-def kind='lvalue' type-id='type-id-265' size-in-bits='64' id='type-id-664'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-665'/>
    <reference-type-def kind='lvalue' type-id='type-id-269' size-in-bits='64' id='type-id-666'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-667'/>
    <reference-type-def kind='lvalue' type-id='type-id-263' size-in-bits='64' id='type-id-668'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-669'/>
    <reference-type-def kind='lvalue' type-id='type-id-574' size-in-bits='64' id='type-id-670'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-218'/>
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' id='type-id-671'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' id='type-id-223'/>
    <reference-type-def kind='lvalue' type-id='type-id-580' size-in-bits='64' id='type-id-672'/>
    <pointer-type-def type-id='type-id-580' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' id='type-id-673'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-674'/>
    <pointer-type-def type-id='type-id-675' size-in-bits='64' id='type-id-676'/>
    <pointer-type-def type-id='type-id-677' size-in-bits='64' id='type-id-678'/>
    <pointer-type-def type-id='type-id-679' size-in-bits='64' id='type-id-680'/>
    <pointer-type-def type-id='type-id-681' size-in-bits='64' id='type-id-682'/>
    <pointer-type-def type-id='type-id-683' size-in-bits='64' id='type-id-684'/>
    <reference-type-def kind='lvalue' type-id='type-id-267' size-in-bits='64' id='type-id-685'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-686'/>
    <reference-type-def kind='lvalue' type-id='type-id-261' size-in-bits='64' id='type-id-687'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-688'/>
    <reference-type-def kind='lvalue' type-id='type-id-595' size-in-bits='64' id='type-id-689'/>
    <pointer-type-def type-id='type-id-595' size-in-bits='64' id='type-id-133'/>
    <reference-type-def kind='lvalue' type-id='type-id-599' size-in-bits='64' id='type-id-690'/>
    <pointer-type-def type-id='type-id-599' size-in-bits='64' id='type-id-691'/>
    <pointer-type-def type-id='type-id-692' size-in-bits='64' id='type-id-173'/>
    <reference-type-def kind='lvalue' type-id='type-id-5' size-in-bits='64' id='type-id-693'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-198'/>
    <qualified-type-def type-id='type-id-131' const='yes' id='type-id-694'/>
    <reference-type-def kind='lvalue' type-id='type-id-694' size-in-bits='64' id='type-id-695'/>
    <pointer-type-def type-id='type-id-694' size-in-bits='64' id='type-id-696'/>
    <reference-type-def kind='lvalue' type-id='type-id-131' size-in-bits='64' id='type-id-697'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-698'/>
    <qualified-type-def type-id='type-id-698' const='yes' id='type-id-699'/>
    <reference-type-def kind='lvalue' type-id='type-id-699' size-in-bits='64' id='type-id-700'/>
    <pointer-type-def type-id='type-id-701' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-702' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-703' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-704' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-705'/>
    <pointer-type-def type-id='type-id-706' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-707'/>
    <pointer-type-def type-id='type-id-708' size-in-bits='64' id='type-id-278'/>
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-54'/>
    <reference-type-def kind='lvalue' type-id='type-id-54' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-276'/>
    <reference-type-def kind='lvalue' type-id='type-id-53' size-in-bits='64' id='type-id-709'/>
    <qualified-type-def type-id='type-id-121' const='yes' id='type-id-710'/>
    <reference-type-def kind='lvalue' type-id='type-id-710' size-in-bits='64' id='type-id-711'/>
    <namespace-decl name='std'>
      <class-decl name='allocator&lt;void (*)()&gt;' size-in-bits='8' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='87' column='1' id='type-id-537'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-367'/>
        <member-function access='private'>
          <function-decl name='allocator' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-655' is-artificial='yes'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='allocator' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-655' is-artificial='yes'/>
            <parameter type-id='type-id-539'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~allocator' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-655' is-artificial='yes'/>
            <parameter type-id='type-id-1' is-artificial='yes'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__alloc_swap&lt;STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='148' column='1' id='type-id-712'>
        <member-function access='public' static='yes'>
          <function-decl name='_S_do_it' mangled-name='_ZNSt12__alloc_swapI13STL_AllocatorI11AllocObjectN15HeapLeakChecker9AllocatorEELb1EE8_S_do_itERS4_S6_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/allocator.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-348'/>
            <parameter type-id='type-id-348'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='105' column='1' id='type-id-540'>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='141' column='1' id='type-id-713'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='type-id-57' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='142' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='type-id-57' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='143' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='type-id-147' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='144' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='148' column='1' id='type-id-544'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-713'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='type-id-89' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='51' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='type-id-714' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep11_S_terminalE' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='56' column='1' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep11_S_terminalE'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='type-id-126' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep20_S_empty_rep_storageE' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='68' column='1' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep20_S_empty_rep_storageE'/>
            </data-member>
            <member-function access='public' static='yes'>
              <function-decl name='_S_empty_rep' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep12_S_empty_repEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
                <return type-id='type-id-660'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_set_sharable' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep15_M_set_sharableEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-661' is-artificial='yes'/>
                <return type-id='type-id-55'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_refdata' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_refdataEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-661' is-artificial='yes'/>
                <return type-id='type-id-90'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_dispose' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_disposeERKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-661' is-artificial='yes'/>
                <parameter type-id='type-id-192'/>
                <return type-id='type-id-55'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_set_length_and_sharable' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep26_M_set_length_and_sharableEm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-661' is-artificial='yes'/>
                <parameter type-id='type-id-5'/>
                <return type-id='type-id-55'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_is_leaked' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep12_M_is_leakedEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-546' is-artificial='yes'/>
                <return type-id='type-id-56'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_refcopy' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_refcopyEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-661' is-artificial='yes'/>
                <return type-id='type-id-90'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_clone' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep8_M_cloneERKS4_m' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='624' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-661' is-artificial='yes'/>
                <parameter type-id='type-id-192'/>
                <parameter type-id='type-id-5'/>
                <return type-id='type-id-90'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_grab' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep7_M_grabERKS4_S8_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-661' is-artificial='yes'/>
                <parameter type-id='type-id-192'/>
                <parameter type-id='type-id-192'/>
                <return type-id='type-id-90'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='_M_destroy' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_destroyERKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep10_M_destroyERKS4_'>
                <parameter type-id='type-id-661' is-artificial='yes'/>
                <parameter type-id='type-id-192'/>
                <return type-id='type-id-55'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='_S_create' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep9_S_createEmmRKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4_Rep9_S_createEmmRKS4_'>
                <parameter type-id='type-id-5'/>
                <parameter type-id='type-id-5'/>
                <parameter type-id='type-id-192'/>
                <return type-id='type-id-661'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='258' column='1' id='type-id-658'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-190'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-90' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='262' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Alloc_hider' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-659' is-artificial='yes'/>
                <parameter type-id='type-id-90'/>
                <parameter type-id='type-id-192'/>
                <return type-id='type-id-55'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='npos' type-id='type-id-89' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='270' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-658' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='274' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='2144' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-657' is-artificial='yes'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-657' is-artificial='yes'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC1ERKS5_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC1ERKS5_'>
            <parameter type-id='type-id-657' is-artificial='yes'/>
            <parameter type-id='type-id-542'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-657' is-artificial='yes'/>
            <parameter type-id='type-id-542'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-5'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-657' is-artificial='yes'/>
            <parameter type-id='type-id-542'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-657' is-artificial='yes'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC2EPKcRKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEEC2EPKcRKS4_'>
            <parameter type-id='type-id-657' is-artificial='yes'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='basic_string' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='220' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-657' is-artificial='yes'/>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-66'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private' destructor='yes'>
          <function-decl name='~basic_string' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEED1Ev' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEED1Ev'>
            <parameter type-id='type-id-657' is-artificial='yes'/>
            <parameter type-id='type-id-1' is-artificial='yes'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;const char*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.tcc' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-192'/>
            <parameter type-id='type-id-715'/>
            <return type-id='type-id-90'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct_aux&lt;const char*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1539' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-192'/>
            <parameter type-id='type-id-716'/>
            <return type-id='type-id-90'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;const char*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1556' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-90'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_data' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE7_M_dataEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-543' is-artificial='yes'/>
            <return type-id='type-id-90'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_rep' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE6_M_repEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-543' is-artificial='yes'/>
            <return type-id='type-id-661'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='get_allocator' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE13get_allocatorEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1629' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-543' is-artificial='yes'/>
            <return type-id='type-id-190'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_M_copy' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE7_M_copyEPcPKcm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-90'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-5'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='c_str' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE5c_strEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1612' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-543' is-artificial='yes'/>
            <return type-id='type-id-52'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_empty_rep' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE12_S_empty_repEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64'>
            <return type-id='type-id-660'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_copy_chars' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE13_S_copy_charsEPcPKcS8_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-90'/>
            <parameter type-id='type-id-52'/>
            <parameter type-id='type-id-52'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='size' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4sizeEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-543' is-artificial='yes'/>
            <return type-id='type-id-57'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='data' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE4dataEv' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='1622' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-543' is-artificial='yes'/>
            <return type-id='type-id-52'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_compare' mangled-name='_ZNSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE10_S_compareEmm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='392' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-5'/>
            <parameter type-id='type-id-5'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='compare' mangled-name='_ZNKSbIcSt11char_traitsIcE13STL_AllocatorIcN15HeapLeakChecker9AllocatorEEE7compareERKS5_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/basic_string.h' line='2019' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-543' is-artificial='yes'/>
            <parameter type-id='type-id-542'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='char_traits&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='238' column='1' id='type-id-717'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-66' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='239' column='1' id='type-id-550'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-1' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='240' column='1' id='type-id-554'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='assign' mangled-name='_ZNSt11char_traitsIcE6assignERcRKc' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-662'/>
            <parameter type-id='type-id-552'/>
            <return type-id='type-id-55'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='length' mangled-name='_ZNSt11char_traitsIcE6lengthEPKc' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-553'/>
            <return type-id='type-id-57'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='copy' mangled-name='_ZNSt11char_traitsIcE4copyEPcPKcm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-663'/>
            <parameter type-id='type-id-553'/>
            <parameter type-id='type-id-57'/>
            <return type-id='type-id-663'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='compare' mangled-name='_ZNSt11char_traitsIcE7compareEPKcS2_m' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/char_traits.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-553'/>
            <parameter type-id='type-id-553'/>
            <parameter type-id='type-id-57'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__false_type' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/cpp_type_traits.h' line='79' column='1' id='type-id-716'/>
      <class-decl name='__niter_base&lt;AllocObject*, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-718'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__niter_baseIP11AllocObjectLb0EE3__bES1_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-187'/>
            <return type-id='type-id-187'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__niter_base&lt;__gnu_cxx::__normal_iterator&lt;AllocObject*, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-719'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__niter_baseIN9__gnu_cxx17__normal_iteratorIP11AllocObjectSt6vectorIS2_13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEEEELb1EE3__bESA_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-355'/>
            <return type-id='type-id-187'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__niter_base&lt;void (**)(), false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-720'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__niter_baseIPPFvvELb0EE3__bES2_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-698'/>
            <return type-id='type-id-698'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__niter_base&lt;void**, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='267' column='1' id='type-id-721'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__niter_baseIPPvLb0EE3__bES1_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-121'/>
            <return type-id='type-id-121'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__miter_base&lt;AllocObject*, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-722'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__miter_baseIP11AllocObjectLb0EE3__bES1_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-187'/>
            <return type-id='type-id-187'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__miter_base&lt;__gnu_cxx::__normal_iterator&lt;AllocObject*, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-723'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__miter_baseIN9__gnu_cxx17__normal_iteratorIP11AllocObjectSt6vectorIS2_13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEEEELb0EE3__bESA_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-355'/>
            <return type-id='type-id-355'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__miter_base&lt;void (**)(), false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-724'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__miter_baseIPPFvvELb0EE3__bES2_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-698'/>
            <return type-id='type-id-698'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__miter_base&lt;void**, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='285' column='1' id='type-id-725'>
        <member-function access='public' static='yes'>
          <function-decl name='__b' mangled-name='_ZNSt12__miter_baseIPPvLb0EE3__bES1_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-121'/>
            <return type-id='type-id-121'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__copy_move&lt;false, false, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='335' column='1' id='type-id-726'>
        <member-function access='public' static='yes'>
          <function-decl name='__copy_m&lt;AllocObject*, AllocObject*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-187'/>
            <parameter type-id='type-id-187'/>
            <parameter type-id='type-id-187'/>
            <return type-id='type-id-187'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__copy_move_backward&lt;false, false, std::random_access_iterator_tag&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='539' column='1' id='type-id-727'>
        <member-function access='public' static='yes'>
          <function-decl name='__copy_move_b&lt;AllocObject*, AllocObject*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-187'/>
            <parameter type-id='type-id-187'/>
            <parameter type-id='type-id-187'/>
            <return type-id='type-id-187'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='__copy_move_b&lt;HeapProfileTable::Snapshot::Entry*, HeapProfileTable::Snapshot::Entry*&gt;' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_algobase.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-297'/>
            <parameter type-id='type-id-297'/>
            <parameter type-id='type-id-297'/>
            <return type-id='type-id-297'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='unary_function&lt;long unsigned int, long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='type-id-728'/>
      <class-decl name='unary_function&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, const long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_function.h' line='101' column='1' id='type-id-729'/>
