<abi-corpus version='2.1' path='data/test-read-dwarf/test17-pr19027.so' soname='libharfbuzz.so.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libfreetype.so.6'/>
    <dependency name='libpng16.so.16'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libbz2.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_create_sub_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_blob_get_data_writable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='hb_unicode_eastasian_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_default' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_empty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_get_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_is_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_make_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_reference' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_combining_class_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_compose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_decompose_compatibility_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_decompose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_eastasian_width_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_general_category_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_mirroring_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_script_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_funcs_set_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_general_category' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_mirroring' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_unicode_script' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_version_atleast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='hb_version_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='hb-blob.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='320' id='type-id-3'>
      <subrange length='40' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='384' id='type-id-7'>
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-9'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-10'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-11'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-12'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <typedef-decl name='hb_atomic_int_t' type-id='type-id-9' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-atomic-private.hh' line='94' column='1' id='type-id-13'/>
    <enum-decl name='hb_memory_mode_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='58' column='1' id='type-id-14'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_MEMORY_MODE_DUPLICATE' value='0'/>
      <enumerator name='HB_MEMORY_MODE_READONLY' value='1'/>
      <enumerator name='HB_MEMORY_MODE_WRITABLE' value='2'/>
      <enumerator name='HB_MEMORY_MODE_READONLY_MAY_MAKE_WRITABLE' value='3'/>
    </enum-decl>
    <typedef-decl name='hb_blob_t' type-id='type-id-15' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='65' column='1' id='type-id-16'/>
    <typedef-decl name='hb_bool_t' type-id='type-id-9' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='73' column='1' id='type-id-17'/>
    <class-decl name='hb_user_data_key_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='334' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='unused' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_user_data_key_t' type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='337' column='1' id='type-id-19'/>
    <typedef-decl name='hb_destroy_func_t' type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='339' column='1' id='type-id-21'/>
    <typedef-decl name='hb_mutex_impl_t' type-id='type-id-22' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='59' column='1' id='type-id-23'/>
    <class-decl name='hb_mutex_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='117' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m' type-id='type-id-23' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='120' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='lock' mangled-name='_ZN10hb_mutex_t4lockEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='unlock' mangled-name='_ZN10hb_mutex_t6unlockEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN10hb_mutex_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN10hb_mutex_t4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-25' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_reference_count_t' size-in-bits='32' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='53' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-13' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='54' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='is_invalid' mangled-name='_ZNK20hb_reference_count_t10is_invalidEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-28' is-artificial='yes'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='inc' mangled-name='_ZN20hb_reference_count_t3incEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-29' is-artificial='yes'/>
          <return type-id='type-id-9'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='dec' mangled-name='_ZN20hb_reference_count_t3decEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-29' is-artificial='yes'/>
          <return type-id='type-id-9'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN20hb_reference_count_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-29' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN20hb_reference_count_t4initEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-29' is-artificial='yes'/>
          <parameter type-id='type-id-9'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_user_data_array_t' size-in-bits='832' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='70' column='1' id='type-id-30'>
      <member-type access='public'>
        <class-decl name='hb_user_data_item_t' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='71' column='1' id='type-id-6'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='key' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='72' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='data' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='73' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='74' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='finish' mangled-name='_ZN20hb_user_data_array_t19hb_user_data_item_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-33' is-artificial='yes'/>
              <return type-id='type-id-26'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator==' mangled-name='_ZNK20hb_user_data_array_t19hb_user_data_item_teqEP18hb_user_data_key_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-34' is-artificial='yes'/>
              <parameter type-id='type-id-31'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator==' mangled-name='_ZNK20hb_user_data_array_t19hb_user_data_item_teqERS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-34' is-artificial='yes'/>
              <parameter type-id='type-id-35'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='items' type-id='type-id-36' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='83' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN20hb_user_data_array_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN20hb_user_data_array_t4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get' mangled-name='_ZN20hb_user_data_array_t3getEP18hb_user_data_key_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set' mangled-name='_ZN20hb_user_data_array_t3setEP18hb_user_data_key_tPvPFvS2_Ei' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-32'/>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_object_header_t' size-in-bits='896' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='101' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-27' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='user_data' type-id='type-id-30' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hb_prealloced_array_t&lt;hb_user_data_array_t::hb_user_data_item_t, 2u&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='329' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='allocated' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='array' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='static_array' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='333' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='429' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator[]' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EEixEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='337' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-35'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='pop' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE3popEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='335' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-33'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find&lt;hb_user_data_array_t::hb_user_data_item_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-33'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='push' mangled-name='_ZN21hb_prealloced_array_tIN20hb_user_data_array_t19hb_user_data_item_tELj2EE4pushEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <return type-id='type-id-33'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_lockable_set_t&lt;hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t&gt;' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='449' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='items' type-id='type-id-39' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='450' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN17hb_lockable_set_tIN20hb_user_data_array_t19hb_user_data_item_tE10hb_mutex_tE6finishERS2_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='520' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-41' is-artificial='yes'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='init' mangled-name='_ZN17hb_lockable_set_tIN20hb_user_data_array_t19hb_user_data_item_tE10hb_mutex_tE4initEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='452' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-41' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='find&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='496' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-41' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove&lt;hb_user_data_key_t*&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='480' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-41' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='replace_or_insert&lt;hb_user_data_array_t::hb_user_data_item_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='455' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-41' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-42'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-33'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='62' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-44' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-44' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-43' filepath='/usr/include/bits/pthreadtypes.h' line='65' column='1' id='type-id-45'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1' id='type-id-22'>
      <member-type access='public'>
        <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1' id='type-id-46'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='__lock' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='__count' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='81' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='__owner' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='82' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='__nusers' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='84' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='__kind' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='88' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='__spins' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='90' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='__list' type-id='type-id-45' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='91' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='101' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='102' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='103' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-47'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-48'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-55'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-28'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-57'/>
    <reference-type-def kind='lvalue' type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-41'/>
    <reference-type-def kind='lvalue' type-id='type-id-24' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-37'/>
    <reference-type-def kind='lvalue' type-id='type-id-6' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-32'/>
    <class-decl name='hb_blob_t' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='53' column='1' is-declaration-only='yes' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='data' type-id='type-id-49' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='length' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='mode' type-id='type-id-14' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='user_data' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='64' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='hb_blob_create' mangled-name='hb_blob_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create'>
      <parameter type-id='type-id-49' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1'/>
      <parameter type-id='type-id-12' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='98' column='1'/>
      <parameter type-id='type-id-14' name='mode' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='99' column='1'/>
      <parameter type-id='type-id-32' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='100' column='1'/>
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='101' column='1'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='hb_blob_create_sub_blob' mangled-name='hb_blob_create_sub_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create_sub_blob'>
      <parameter type-id='type-id-59' name='parent' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1'/>
      <parameter type-id='type-id-12' name='offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='151' column='1'/>
      <parameter type-id='type-id-12' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='152' column='1'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='hb_blob_get_empty' mangled-name='hb_blob_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_empty'>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='hb_blob_reference' mangled-name='hb_blob_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_reference'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='hb_blob_destroy' mangled-name='hb_blob_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_destroy'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_blob_set_user_data' mangled-name='hb_blob_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_set_user_data'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1'/>
      <parameter type-id='type-id-31' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='254' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='255' column='1'/>
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='256' column='1'/>
      <parameter type-id='type-id-17' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='257' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_blob_get_user_data' mangled-name='hb_blob_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_user_data'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1'/>
      <parameter type-id='type-id-31' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='275' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='hb_blob_make_immutable' mangled-name='hb_blob_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_make_immutable'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_blob_is_immutable' mangled-name='hb_blob_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_is_immutable'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_blob_get_length' mangled-name='hb_blob_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_length'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='hb_blob_get_data' mangled-name='hb_blob_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <parameter type-id='type-id-60' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='hb_blob_get_data_writable' mangled-name='hb_blob_get_data_writable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data_writable'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <parameter type-id='type-id-60' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-61'>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-26'/>
    </function-type>
    <type-decl name='void' id='type-id-26'/>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer-serialize.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-49' size-in-bits='512' id='type-id-62'>
      <subrange length='8' type-id='type-id-4' id='type-id-63'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='type-id-64' size-in-bits='320' id='type-id-65'>
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
      <subrange length='5' type-id='type-id-4' id='type-id-66'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-67' size-in-bits='32' id='type-id-68'>
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='32' id='type-id-70'>
      <subrange length='4' type-id='type-id-4' id='type-id-71'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-72'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-73'/>
    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='32' id='type-id-75'>
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='32' id='type-id-77'>
      <subrange length='4' type-id='type-id-4' id='type-id-71'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='64' id='type-id-78'>
      <subrange length='8' type-id='type-id-4' id='type-id-63'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-79'/>
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='64' id='type-id-80'>
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-81'/>
    <class-decl name='hb_buffer_t' size-in-bits='2752' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='46' column='1' id='type-id-82'>
      <member-type access='public'>
        <typedef-decl name='scratch_buffer_t' type-id='type-id-10' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='190' column='1' id='type-id-83'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='unicode' type-id='type-id-84' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='flags' type-id='type-id-85' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='replacement' type-id='type-id-64' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='content_type' type-id='type-id-86' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='props' type-id='type-id-87' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='in_error' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1352'>
        <var-decl name='have_output' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <var-decl name='have_positions' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='idx' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='len' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='out_len' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='allocated' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='info' type-id='type-id-88' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='out_info' type-id='type-id-88' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='pos' type-id='type-id-89' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='serial' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='allocated_var_bytes' type-id='type-id-78' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='allocated_var_owner' type-id='type-id-62' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='87' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='CONTEXT_LENGTH' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='context' type-id='type-id-65' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='context_len' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='94' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='clear_context' mangled-name='_ZN11hb_buffer_t13clear_contextEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='set_masks' mangled-name='_ZN11hb_buffer_t9set_masksEjjjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-92'/>
          <parameter type-id='type-id-92'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reverse_range' mangled-name='_ZN11hb_buffer_t13reverse_rangeEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='allocate_var' mangled-name='_ZN11hb_buffer_t12allocate_varEjjPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_scratch_buffer' mangled-name='_ZN11hb_buffer_t18get_scratch_bufferEPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='merge_out_clusters' mangled-name='_ZN11hb_buffer_t18merge_out_clustersEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='merge_clusters' mangled-name='_ZN11hb_buffer_t14merge_clustersEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reverse' mangled-name='_ZN11hb_buffer_t7reverseEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reverse_clusters' mangled-name='_ZN11hb_buffer_t16reverse_clustersEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='swap_buffers' mangled-name='_ZN11hb_buffer_t12swap_buffersEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clear_output' mangled-name='_ZN11hb_buffer_t12clear_outputEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='remove_output' mangled-name='_ZN11hb_buffer_t13remove_outputEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='deallocate_var_all' mangled-name='_ZN11hb_buffer_t18deallocate_var_allEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clear_positions' mangled-name='_ZN11hb_buffer_t15clear_positionsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='clear' mangled-name='_ZN11hb_buffer_t5clearEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reset' mangled-name='_ZN11hb_buffer_t5resetEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='assert_var' mangled-name='_ZN11hb_buffer_t10assert_varEjjPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='deallocate_var' mangled-name='_ZN11hb_buffer_t14deallocate_varEjjPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='guess_segment_properties' mangled-name='_ZN11hb_buffer_t24guess_segment_propertiesEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='enlarge' mangled-name='_ZN11hb_buffer_t7enlargeEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ensure' mangled-name='_ZN11hb_buffer_t6ensureEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='make_room_for' mangled-name='_ZN11hb_buffer_t13make_room_forEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='replace_glyph' mangled-name='_ZN11hb_buffer_t13replace_glyphEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='copy_glyph' mangled-name='_ZN11hb_buffer_t10copy_glyphEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='output_info' mangled-name='_ZN11hb_buffer_t11output_infoERK15hb_glyph_info_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-94'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='output_glyph' mangled-name='_ZN11hb_buffer_t12output_glyphEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='replace_glyphs' mangled-name='_ZN11hb_buffer_t14replace_glyphsEjjPKj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-95'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_info' mangled-name='_ZN11hb_buffer_t8add_infoERK15hb_glyph_info_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-94'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add' mangled-name='_ZN11hb_buffer_t3addEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='shift_forward' mangled-name='_ZN11hb_buffer_t13shift_forwardEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='move_to' mangled-name='_ZN11hb_buffer_t7move_toEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='cur' mangled-name='_ZN11hb_buffer_t3curEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-96'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='next_serial' mangled-name='_ZN11hb_buffer_t11next_serialEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='skip_glyph' mangled-name='_ZN11hb_buffer_t10skip_glyphEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='backtrack_len' mangled-name='_ZNK11hb_buffer_t13backtrack_lenEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-97' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='lookahead_len' mangled-name='_ZNK11hb_buffer_t13lookahead_lenEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-97' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='cur_pos' mangled-name='_ZN11hb_buffer_t7cur_posEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-98'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='has_separate_output' mangled-name='_ZNK11hb_buffer_t19has_separate_outputEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-97' is-artificial='yes'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='next_glyph' mangled-name='_ZN11hb_buffer_t10next_glyphEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reset_masks' mangled-name='_ZN11hb_buffer_t11reset_masksEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-92'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='prev' mangled-name='_ZN11hb_buffer_t4prevEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-96'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_glyph_info_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='44' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='codepoint' type-id='type-id-64' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mask' type-id='type-id-92' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cluster' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='var1' type-id='type-id-101' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='var2' type-id='type-id-101' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_glyph_info_t' type-id='type-id-99' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='52' column='1' id='type-id-102'/>
    <class-decl name='hb_glyph_position_t' size-in-bits='160' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='54' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_advance' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y_advance' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_offset' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='y_offset' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='var' type-id='type-id-101' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_glyph_position_t' type-id='type-id-103' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='62' column='1' id='type-id-105'/>
    <class-decl name='hb_segment_properties_t' size-in-bits='256' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='65' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='direction' type-id='type-id-107' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='script' type-id='type-id-108' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='language' type-id='type-id-109' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved1' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved2' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_segment_properties_t' type-id='type-id-106' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='72' column='1' id='type-id-87'/>
    <typedef-decl name='hb_buffer_t' type-id='type-id-82' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='93' column='1' id='type-id-110'/>
    <enum-decl name='hb_buffer_content_type_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='119' column='1' id='type-id-86'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_INVALID' value='0'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_UNICODE' value='1'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_GLYPHS' value='2'/>
    </enum-decl>
    <enum-decl name='hb_buffer_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='174' column='1' id='type-id-85'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_BUFFER_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_FLAG_BOT' value='1'/>
      <enumerator name='HB_BUFFER_FLAG_EOT' value='2'/>
      <enumerator name='HB_BUFFER_FLAG_PRESERVE_DEFAULT_IGNORABLES' value='4'/>
    </enum-decl>
    <enum-decl name='hb_buffer_serialize_flags_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='298' column='1' id='type-id-111'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_CLUSTERS' value='1'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_POSITIONS' value='2'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_GLYPH_NAMES' value='4'/>
    </enum-decl>
    <enum-decl name='hb_buffer_serialize_format_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='305' column='1' id='type-id-112'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_TEXT' value='1413830740'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_JSON' value='1246973774'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_INVALID' value='0'/>
    </enum-decl>
    <typedef-decl name='hb_codepoint_t' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='75' column='1' id='type-id-64'/>
    <typedef-decl name='hb_position_t' type-id='type-id-113' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='76' column='1' id='type-id-104'/>
    <typedef-decl name='hb_mask_t' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='77' column='1' id='type-id-92'/>
    <union-decl name='_hb_var_int_t' size-in-bits='32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='79' column='1' id='type-id-114'>
      <data-member access='public'>
        <var-decl name='u32' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i32' type-id='type-id-113' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='81' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u16' type-id='type-id-75' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='82' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i16' type-id='type-id-68' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u8' type-id='type-id-77' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='84' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i8' type-id='type-id-70' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='hb_var_int_t' type-id='type-id-114' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='86' column='1' id='type-id-101'/>
    <enum-decl name='hb_direction_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='111' column='1' id='type-id-107'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_DIRECTION_INVALID' value='0'/>
      <enumerator name='HB_DIRECTION_LTR' value='4'/>
      <enumerator name='HB_DIRECTION_RTL' value='5'/>
      <enumerator name='HB_DIRECTION_TTB' value='6'/>
      <enumerator name='HB_DIRECTION_BTT' value='7'/>
    </enum-decl>
    <typedef-decl name='hb_language_t' type-id='type-id-115' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='137' column='1' id='type-id-109'/>
    <enum-decl name='hb_script_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='157' column='1' id='type-id-108'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_SCRIPT_COMMON' value='1517910393'/>
      <enumerator name='HB_SCRIPT_INHERITED' value='1516858984'/>
      <enumerator name='HB_SCRIPT_UNKNOWN' value='1517976186'/>
      <enumerator name='HB_SCRIPT_ARABIC' value='1098015074'/>
      <enumerator name='HB_SCRIPT_ARMENIAN' value='1098018158'/>
      <enumerator name='HB_SCRIPT_BENGALI' value='1113943655'/>
      <enumerator name='HB_SCRIPT_CYRILLIC' value='1132032620'/>
      <enumerator name='HB_SCRIPT_DEVANAGARI' value='1147500129'/>
      <enumerator name='HB_SCRIPT_GEORGIAN' value='1197830002'/>
      <enumerator name='HB_SCRIPT_GREEK' value='1198679403'/>
      <enumerator name='HB_SCRIPT_GUJARATI' value='1198877298'/>
      <enumerator name='HB_SCRIPT_GURMUKHI' value='1198879349'/>
      <enumerator name='HB_SCRIPT_HANGUL' value='1214344807'/>
      <enumerator name='HB_SCRIPT_HAN' value='1214344809'/>
      <enumerator name='HB_SCRIPT_HEBREW' value='1214603890'/>
      <enumerator name='HB_SCRIPT_HIRAGANA' value='1214870113'/>
      <enumerator name='HB_SCRIPT_KANNADA' value='1265525857'/>
      <enumerator name='HB_SCRIPT_KATAKANA' value='1264676449'/>
      <enumerator name='HB_SCRIPT_LAO' value='1281453935'/>
      <enumerator name='HB_SCRIPT_LATIN' value='1281455214'/>
      <enumerator name='HB_SCRIPT_MALAYALAM' value='1298954605'/>
      <enumerator name='HB_SCRIPT_ORIYA' value='1332902241'/>
      <enumerator name='HB_SCRIPT_TAMIL' value='1415671148'/>
      <enumerator name='HB_SCRIPT_TELUGU' value='1415933045'/>
      <enumerator name='HB_SCRIPT_THAI' value='1416126825'/>
      <enumerator name='HB_SCRIPT_TIBETAN' value='1416192628'/>
      <enumerator name='HB_SCRIPT_BOPOMOFO' value='1114599535'/>
      <enumerator name='HB_SCRIPT_BRAILLE' value='1114792297'/>
      <enumerator name='HB_SCRIPT_CANADIAN_SYLLABICS' value='1130458739'/>
      <enumerator name='HB_SCRIPT_CHEROKEE' value='1130915186'/>
      <enumerator name='HB_SCRIPT_ETHIOPIC' value='1165256809'/>
      <enumerator name='HB_SCRIPT_KHMER' value='1265134962'/>
      <enumerator name='HB_SCRIPT_MONGOLIAN' value='1299148391'/>
      <enumerator name='HB_SCRIPT_MYANMAR' value='1299803506'/>
      <enumerator name='HB_SCRIPT_OGHAM' value='1332175213'/>
      <enumerator name='HB_SCRIPT_RUNIC' value='1383427698'/>
      <enumerator name='HB_SCRIPT_SINHALA' value='1399418472'/>
      <enumerator name='HB_SCRIPT_SYRIAC' value='1400468067'/>
      <enumerator name='HB_SCRIPT_THAANA' value='1416126817'/>
      <enumerator name='HB_SCRIPT_YI' value='1500080489'/>
      <enumerator name='HB_SCRIPT_DESERET' value='1148416628'/>
      <enumerator name='HB_SCRIPT_GOTHIC' value='1198486632'/>
      <enumerator name='HB_SCRIPT_OLD_ITALIC' value='1232363884'/>
      <enumerator name='HB_SCRIPT_BUHID' value='1114990692'/>
      <enumerator name='HB_SCRIPT_HANUNOO' value='1214344815'/>
      <enumerator name='HB_SCRIPT_TAGALOG' value='1416064103'/>
      <enumerator name='HB_SCRIPT_TAGBANWA' value='1415669602'/>
      <enumerator name='HB_SCRIPT_CYPRIOT' value='1131442804'/>
      <enumerator name='HB_SCRIPT_LIMBU' value='1281977698'/>
      <enumerator name='HB_SCRIPT_LINEAR_B' value='1281977954'/>
      <enumerator name='HB_SCRIPT_OSMANYA' value='1332964705'/>
      <enumerator name='HB_SCRIPT_SHAVIAN' value='1399349623'/>
      <enumerator name='HB_SCRIPT_TAI_LE' value='1415670885'/>
      <enumerator name='HB_SCRIPT_UGARITIC' value='1432838514'/>
      <enumerator name='HB_SCRIPT_BUGINESE' value='1114990441'/>
      <enumerator name='HB_SCRIPT_COPTIC' value='1131376756'/>
      <enumerator name='HB_SCRIPT_GLAGOLITIC' value='1198285159'/>
      <enumerator name='HB_SCRIPT_KHAROSHTHI' value='1265131890'/>
      <enumerator name='HB_SCRIPT_NEW_TAI_LUE' value='1415670901'/>
      <enumerator name='HB_SCRIPT_OLD_PERSIAN' value='1483761007'/>
      <enumerator name='HB_SCRIPT_SYLOTI_NAGRI' value='1400466543'/>
      <enumerator name='HB_SCRIPT_TIFINAGH' value='1415999079'/>
      <enumerator name='HB_SCRIPT_BALINESE' value='1113681001'/>
      <enumerator name='HB_SCRIPT_CUNEIFORM' value='1483961720'/>
      <enumerator name='HB_SCRIPT_NKO' value='1315663727'/>
      <enumerator name='HB_SCRIPT_PHAGS_PA' value='1349017959'/>
      <enumerator name='HB_SCRIPT_PHOENICIAN' value='1349021304'/>
      <enumerator name='HB_SCRIPT_CARIAN' value='1130459753'/>
      <enumerator name='HB_SCRIPT_CHAM' value='1130914157'/>
      <enumerator name='HB_SCRIPT_KAYAH_LI' value='1264675945'/>
      <enumerator name='HB_SCRIPT_LEPCHA' value='1281716323'/>
      <enumerator name='HB_SCRIPT_LYCIAN' value='1283023721'/>
      <enumerator name='HB_SCRIPT_LYDIAN' value='1283023977'/>
      <enumerator name='HB_SCRIPT_OL_CHIKI' value='1332503403'/>
      <enumerator name='HB_SCRIPT_REJANG' value='1382706791'/>
      <enumerator name='HB_SCRIPT_SAURASHTRA' value='1398895986'/>
      <enumerator name='HB_SCRIPT_SUNDANESE' value='1400204900'/>
      <enumerator name='HB_SCRIPT_VAI' value='1449224553'/>
      <enumerator name='HB_SCRIPT_AVESTAN' value='1098281844'/>
      <enumerator name='HB_SCRIPT_BAMUM' value='1113681269'/>
      <enumerator name='HB_SCRIPT_EGYPTIAN_HIEROGLYPHS' value='1164409200'/>
      <enumerator name='HB_SCRIPT_IMPERIAL_ARAMAIC' value='1098018153'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PAHLAVI' value='1349020777'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PARTHIAN' value='1349678185'/>
      <enumerator name='HB_SCRIPT_JAVANESE' value='1247901281'/>
      <enumerator name='HB_SCRIPT_KAITHI' value='1265920105'/>
      <enumerator name='HB_SCRIPT_LISU' value='1281979253'/>
      <enumerator name='HB_SCRIPT_MEETEI_MAYEK' value='1299473769'/>
      <enumerator name='HB_SCRIPT_OLD_SOUTH_ARABIAN' value='1398895202'/>
      <enumerator name='HB_SCRIPT_OLD_TURKIC' value='1332898664'/>
      <enumerator name='HB_SCRIPT_SAMARITAN' value='1398893938'/>
      <enumerator name='HB_SCRIPT_TAI_THAM' value='1281453665'/>
      <enumerator name='HB_SCRIPT_TAI_VIET' value='1415673460'/>
      <enumerator name='HB_SCRIPT_BATAK' value='1113683051'/>
      <enumerator name='HB_SCRIPT_BRAHMI' value='1114792296'/>
      <enumerator name='HB_SCRIPT_MANDAIC' value='1298230884'/>
      <enumerator name='HB_SCRIPT_CHAKMA' value='1130457965'/>
      <enumerator name='HB_SCRIPT_MEROITIC_CURSIVE' value='1298494051'/>
      <enumerator name='HB_SCRIPT_MEROITIC_HIEROGLYPHS' value='1298494063'/>
      <enumerator name='HB_SCRIPT_MIAO' value='1349284452'/>
      <enumerator name='HB_SCRIPT_SHARADA' value='1399353956'/>
      <enumerator name='HB_SCRIPT_SORA_SOMPENG' value='1399812705'/>
      <enumerator name='HB_SCRIPT_TAKRI' value='1415670642'/>
      <enumerator name='HB_SCRIPT_BASSA_VAH' value='1113682803'/>
      <enumerator name='HB_SCRIPT_CAUCASIAN_ALBANIAN' value='1097295970'/>
      <enumerator name='HB_SCRIPT_DUPLOYAN' value='1148547180'/>
      <enumerator name='HB_SCRIPT_ELBASAN' value='1164730977'/>
      <enumerator name='HB_SCRIPT_GRANTHA' value='1198678382'/>
      <enumerator name='HB_SCRIPT_KHOJKI' value='1265135466'/>
      <enumerator name='HB_SCRIPT_KHUDAWADI' value='1399418468'/>
      <enumerator name='HB_SCRIPT_LINEAR_A' value='1281977953'/>
      <enumerator name='HB_SCRIPT_MAHAJANI' value='1298229354'/>
      <enumerator name='HB_SCRIPT_MANICHAEAN' value='1298230889'/>
      <enumerator name='HB_SCRIPT_MENDE_KIKAKUI' value='1298493028'/>
      <enumerator name='HB_SCRIPT_MODI' value='1299145833'/>
      <enumerator name='HB_SCRIPT_MRO' value='1299345263'/>
      <enumerator name='HB_SCRIPT_NABATAEAN' value='1315070324'/>
      <enumerator name='HB_SCRIPT_OLD_NORTH_ARABIAN' value='1315009122'/>
      <enumerator name='HB_SCRIPT_OLD_PERMIC' value='1348825709'/>
      <enumerator name='HB_SCRIPT_PAHAWH_HMONG' value='1215131239'/>
      <enumerator name='HB_SCRIPT_PALMYRENE' value='1348562029'/>
      <enumerator name='HB_SCRIPT_PAU_CIN_HAU' value='1348564323'/>
      <enumerator name='HB_SCRIPT_PSALTER_PAHLAVI' value='1349020784'/>
      <enumerator name='HB_SCRIPT_SIDDHAM' value='1399415908'/>
      <enumerator name='HB_SCRIPT_TIRHUTA' value='1416196712'/>
      <enumerator name='HB_SCRIPT_WARANG_CITI' value='1466004065'/>
      <enumerator name='HB_SCRIPT_INVALID' value='0'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE' value='4294967295'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE_SIGNED' value='2147483647'/>
    </enum-decl>
    <class-decl name='hb_font_t' size-in-bits='1536' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='91' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='parent' type-id='type-id-117' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='face' type-id='type-id-118' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='x_scale' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='y_scale' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='x_ppem' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='y_ppem' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='klass' type-id='type-id-119' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='user_data' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='shaper_data' type-id='type-id-120' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='110' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='get_glyph_h_advance' mangled-name='_ZN9hb_font_t19get_glyph_h_advanceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph' mangled-name='_ZN9hb_font_t9get_glyphEjjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_name' mangled-name='_ZN9hb_font_t14get_glyph_nameEjPcj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_v_advance' mangled-name='_ZN9hb_font_t19get_glyph_v_advanceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_h_origin' mangled-name='_ZN9hb_font_t18get_glyph_h_originEjPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_v_origin' mangled-name='_ZN9hb_font_t18get_glyph_v_originEjPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_h_kerning' mangled-name='_ZN9hb_font_t19get_glyph_h_kerningEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_v_kerning' mangled-name='_ZN9hb_font_t19get_glyph_v_kerningEjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_contour_point' mangled-name='_ZN9hb_font_t23get_glyph_contour_pointEjjPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='parent_scale_x_position' mangled-name='_ZN9hb_font_t23parent_scale_x_positionEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='parent_scale_y_position' mangled-name='_ZN9hb_font_t23parent_scale_y_positionEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='guess_v_origin_minus_h_origin' mangled-name='_ZN9hb_font_t29guess_v_origin_minus_h_originEjPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='266' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='subtract_glyph_origin_for_direction' mangled-name='_ZN9hb_font_t35subtract_glyph_origin_for_directionEj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_contour_point_for_origin' mangled-name='_ZN9hb_font_t34get_glyph_contour_point_for_originEjj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='add_glyph_origin_for_direction' mangled-name='_ZN9hb_font_t30add_glyph_origin_for_directionEj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_kerning_for_direction' mangled-name='_ZN9hb_font_t31get_glyph_kerning_for_directionEjj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='325' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_advance_for_direction' mangled-name='_ZN9hb_font_t31get_glyph_advance_for_directionEj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='parent_scale_distance' mangled-name='_ZN9hb_font_t21parent_scale_distanceEPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_extents_for_origin' mangled-name='_ZN9hb_font_t28get_glyph_extents_for_originEj14hb_direction_tP18hb_glyph_extents_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-123'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='glyph_from_string' mangled-name='_ZN9hb_font_t17glyph_from_stringEPKciPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <parameter type-id='type-id-9'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='glyph_to_string' mangled-name='_ZN9hb_font_t15glyph_to_stringEjPcj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='364' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_origin_for_direction' mangled-name='_ZN9hb_font_t30get_glyph_origin_for_directionEj14hb_direction_tPiS1_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='275' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_from_name' mangled-name='_ZN9hb_font_t19get_glyph_from_nameEPKciPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <parameter type-id='type-id-9'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='parent_scale_position' mangled-name='_ZN9hb_font_t21parent_scale_positionEPiS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='parent_scale_x_distance' mangled-name='_ZN9hb_font_t23parent_scale_x_distanceEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='parent_scale_y_distance' mangled-name='_ZN9hb_font_t23parent_scale_y_distanceEi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_glyph_extents' mangled-name='_ZN9hb_font_t17get_glyph_extentsEjP18hb_glyph_extents_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='208' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-123'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='em_scale' mangled-name='_ZN9hb_font_t8em_scaleEsi' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='405' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-67'/>
          <parameter type-id='type-id-9'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='em_scale_y' mangled-name='_ZN9hb_font_t10em_scale_yEs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-67'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='em_scale_x' mangled-name='_ZN9hb_font_t10em_scale_xEs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-67'/>
          <return type-id='type-id-104'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='has_glyph' mangled-name='_ZN9hb_font_t9has_glyphEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='hb_font_t' type-id='type-id-116' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='40' column='1' id='type-id-124'/>
    <class-decl name='hb_unicode_funcs_t' size-in-bits='2560' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='64' column='1' id='type-id-125'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='203' column='1' id='type-id-126'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='type-id-127' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='type-id-128' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='type-id-129' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='type-id-130' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='type-id-131' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='type-id-132' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='type-id-133' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='type-id-134' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__1' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='209' column='1' id='type-id-135'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__2' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='215' column='1' id='type-id-136'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='combining_class' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eastasian_width' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='general_category' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='mirroring' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='script' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='compose' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='decompose' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='decompose_compatibility' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='parent' type-id='type-id-84' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='immutable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='func' type-id='type-id-126' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='user_data' type-id='type-id-135' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='destroy' type-id='type-id-136' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='219' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='script' mangled-name='_ZN18hb_unicode_funcs_t6scriptEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-108'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='combining_class' mangled-name='_ZN18hb_unicode_funcs_t15combining_classEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-137'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='eastasian_width' mangled-name='_ZN18hb_unicode_funcs_t15eastasian_widthEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='general_category' mangled-name='_ZN18hb_unicode_funcs_t16general_categoryEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='mirroring' mangled-name='_ZN18hb_unicode_funcs_t9mirroringEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-64'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='decompose' mangled-name='_ZN18hb_unicode_funcs_t9decomposeEjPjS0_' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='decompose_compatibility' mangled-name='_ZN18hb_unicode_funcs_t23decompose_compatibilityEjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='compose' mangled-name='_ZN18hb_unicode_funcs_t7composeEjjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-64'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='is_default_ignorable' mangled-name='_ZN18hb_unicode_funcs_t20is_default_ignorableEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='modified_combining_class' mangled-name='_ZN18hb_unicode_funcs_t24modified_combining_classEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='is_variation_selector' mangled-name='_ZN18hb_unicode_funcs_t21is_variation_selectorEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='hb_unicode_general_category_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='46' column='1' id='type-id-138'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONTROL' value='0'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FORMAT' value='1'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UNASSIGNED' value='2'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PRIVATE_USE' value='3'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SURROGATE' value='4'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LOWERCASE_LETTER' value='5'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_LETTER' value='6'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_LETTER' value='7'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_TITLECASE_LETTER' value='8'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UPPERCASE_LETTER' value='9'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACING_MARK' value='10'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_ENCLOSING_MARK' value='11'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_NON_SPACING_MARK' value='12'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DECIMAL_NUMBER' value='13'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LETTER_NUMBER' value='14'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_NUMBER' value='15'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONNECT_PUNCTUATION' value='16'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DASH_PUNCTUATION' value='17'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CLOSE_PUNCTUATION' value='18'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FINAL_PUNCTUATION' value='19'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_INITIAL_PUNCTUATION' value='20'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_PUNCTUATION' value='21'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OPEN_PUNCTUATION' value='22'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CURRENCY_SYMBOL' value='23'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_SYMBOL' value='24'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MATH_SYMBOL' value='25'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_SYMBOL' value='26'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LINE_SEPARATOR' value='27'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PARAGRAPH_SEPARATOR' value='28'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACE_SEPARATOR' value='29'/>
    </enum-decl>
    <enum-decl name='hb_unicode_combining_class_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='87' column='1' id='type-id-137'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NOT_REORDERED' value='0'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_OVERLAY' value='1'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NUKTA' value='7'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_KANA_VOICING' value='8'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_VIRAMA' value='9'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC10' value='10'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC11' value='11'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC12' value='12'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC13' value='13'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC14' value='14'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC15' value='15'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC16' value='16'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC17' value='17'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC18' value='18'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC19' value='19'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC20' value='20'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC21' value='21'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC22' value='22'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC23' value='23'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC24' value='24'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC25' value='25'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC26' value='26'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC27' value='27'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC28' value='28'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC29' value='29'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC30' value='30'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC31' value='31'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC32' value='32'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC33' value='33'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC34' value='34'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC35' value='35'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC36' value='36'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC84' value='84'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC91' value='91'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC103' value='103'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC107' value='107'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC118' value='118'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC122' value='122'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC129' value='129'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC130' value='130'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC133' value='132'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW_LEFT' value='200'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW' value='202'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE' value='214'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE_RIGHT' value='216'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_LEFT' value='218'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW' value='220'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_RIGHT' value='222'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_LEFT' value='224'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_RIGHT' value='226'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_LEFT' value='228'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE' value='230'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_RIGHT' value='232'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_BELOW' value='233'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_ABOVE' value='234'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_IOTA_SUBSCRIPT' value='240'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_INVALID' value='255'/>
    </enum-decl>
    <typedef-decl name='hb_unicode_funcs_t' type-id='type-id-125' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='171' column='1' id='type-id-139'/>
    <typedef-decl name='hb_unicode_combining_class_func_t' type-id='type-id-140' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='224' column='1' id='type-id-127'/>
    <typedef-decl name='hb_unicode_eastasian_width_func_t' type-id='type-id-141' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='227' column='1' id='type-id-128'/>
    <typedef-decl name='hb_unicode_general_category_func_t' type-id='type-id-142' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='230' column='1' id='type-id-129'/>
    <typedef-decl name='hb_unicode_mirroring_func_t' type-id='type-id-143' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='233' column='1' id='type-id-130'/>
    <typedef-decl name='hb_unicode_script_func_t' type-id='type-id-144' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='236' column='1' id='type-id-131'/>
    <typedef-decl name='hb_unicode_compose_func_t' type-id='type-id-145' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='242' column='1' id='type-id-132'/>
    <typedef-decl name='hb_unicode_decompose_func_t' type-id='type-id-146' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='247' column='1' id='type-id-133'/>
    <typedef-decl name='hb_unicode_decompose_compatibility_func_t' type-id='type-id-147' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='270' column='1' id='type-id-134'/>
    <typedef-decl name='int8_t' type-id='type-id-73' filepath='/usr/include/stdint.h' line='37' column='1' id='type-id-69'/>
    <typedef-decl name='int16_t' type-id='type-id-72' filepath='/usr/include/stdint.h' line='38' column='1' id='type-id-67'/>
    <typedef-decl name='int32_t' type-id='type-id-9' filepath='/usr/include/stdint.h' line='39' column='1' id='type-id-113'/>
    <typedef-decl name='uint8_t' type-id='type-id-79' filepath='/usr/include/stdint.h' line='49' column='1' id='type-id-76'/>
    <typedef-decl name='uint16_t' type-id='type-id-81' filepath='/usr/include/stdint.h' line='50' column='1' id='type-id-74'/>
    <typedef-decl name='uint32_t' type-id='type-id-12' filepath='/usr/include/stdint.h' line='52' column='1' id='type-id-100'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-148'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-149'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-97'/>
    <qualified-type-def type-id='type-id-64' const='yes' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-95'/>
    <qualified-type-def type-id='type-id-102' const='yes' id='type-id-151'/>
    <reference-type-def kind='lvalue' type-id='type-id-151' size-in-bits='64' id='type-id-94'/>
    <qualified-type-def type-id='type-id-152' const='yes' id='type-id-153'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-115'/>
    <qualified-type-def type-id='type-id-125' const='yes' id='type-id-154'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-90'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-117'/>
    <reference-type-def kind='lvalue' type-id='type-id-102' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-88'/>
    <reference-type-def kind='lvalue' type-id='type-id-105' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-141'/>
    <function-decl name='hb_buffer_serialize_list_formats' mangled-name='hb_buffer_serialize_list_formats' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_list_formats'>
      <return type-id='type-id-148'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_format_from_string' mangled-name='hb_buffer_serialize_format_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_from_string'>
      <parameter type-id='type-id-49' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_format_to_string' mangled-name='hb_buffer_serialize_format_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_to_string'>
      <parameter type-id='type-id-112' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='hb_buffer_serialize_glyphs' mangled-name='hb_buffer_serialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_glyphs'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1'/>
      <parameter type-id='type-id-12' name='start' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='247' column='1'/>
      <parameter type-id='type-id-12' name='end' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='248' column='1'/>
      <parameter type-id='type-id-47' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='249' column='1'/>
      <parameter type-id='type-id-12' name='buf_size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='250' column='1'/>
      <parameter type-id='type-id-60' name='buf_consumed' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='251' column='1'/>
      <parameter type-id='type-id-117' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='252' column='1'/>
      <parameter type-id='type-id-112' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='253' column='1'/>
      <parameter type-id='type-id-111' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='254' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='hb_buffer_deserialize_glyphs' mangled-name='hb_buffer_deserialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_deserialize_glyphs'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1'/>
      <parameter type-id='type-id-49' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='354' column='1'/>
      <parameter type-id='type-id-9' name='buf_len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='355' column='1'/>
      <parameter type-id='type-id-148' name='end_ptr' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='356' column='1'/>
      <parameter type-id='type-id-117' name='font' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='357' column='1'/>
      <parameter type-id='type-id-112' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='358' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <class-decl name='hb_language_impl_t' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='167' column='1' is-declaration-only='yes' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-164' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='168' column='1'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='64' id='type-id-156'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-108'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-157'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-137'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-158'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-138'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-159'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-161'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-64'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-162'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-12'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-163'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-12'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <class-decl name='hb_utf_t&lt;unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='32' column='1' id='type-id-165'>
      <member-function access='public' static='yes'>
        <function-decl name='next' mangled-name='_ZN8hb_utf_tIjLb1EE4nextEPKjS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-166'/>
          <parameter type-id='type-id-166'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-166'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='strlen' mangled-name='_ZN8hb_utf_tIjLb1EE6strlenEPKj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-166'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='prev' mangled-name='_ZN8hb_utf_tIjLb1EE4prevEPKjS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-166'/>
          <parameter type-id='type-id-166'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-166'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_utf_t&lt;unsigned char, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='39' column='1' id='type-id-167'>
      <member-function access='public' static='yes'>
        <function-decl name='strlen' mangled-name='_ZN8hb_utf_tIhLb1EE6strlenEPKh' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='prev' mangled-name='_ZN8hb_utf_tIhLb1EE4prevEPKhS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168'/>
          <parameter type-id='type-id-168'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-168'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='next' mangled-name='_ZN8hb_utf_tIhLb1EE4nextEPKhS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-168'/>
          <parameter type-id='type-id-168'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-168'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_utf_t&lt;short unsigned int, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='138' column='1' id='type-id-169'>
      <member-function access='public' static='yes'>
        <function-decl name='strlen' mangled-name='_ZN8hb_utf_tItLb1EE6strlenEPKt' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-170'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='prev' mangled-name='_ZN8hb_utf_tItLb1EE4prevEPKtS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-170'/>
          <parameter type-id='type-id-170'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-170'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='next' mangled-name='_ZN8hb_utf_tItLb1EE4nextEPKtS2_Pjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-170'/>
          <parameter type-id='type-id-170'/>
          <parameter type-id='type-id-121'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-170'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-171'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-172'/>
    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-173'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-170'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-174'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-166'/>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-176'/>
    <function-decl name='hb_segment_properties_equal' mangled-name='hb_segment_properties_equal' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_equal'>
      <parameter type-id='type-id-172' name='a' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1'/>
      <parameter type-id='type-id-172' name='b' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='41' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_segment_properties_hash' mangled-name='hb_segment_properties_hash' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_hash'>
      <parameter type-id='type-id-172' name='p' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='hb_buffer_create' mangled-name='hb_buffer_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_create'>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='hb_buffer_get_empty' mangled-name='hb_buffer_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_empty'>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='hb_buffer_reference' mangled-name='hb_buffer_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reference'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='hb_buffer_destroy' mangled-name='hb_buffer_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_destroy'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_set_user_data' mangled-name='hb_buffer_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_user_data'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1'/>
      <parameter type-id='type-id-31' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='773' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='774' column='1'/>
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='775' column='1'/>
      <parameter type-id='type-id-17' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='776' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_buffer_get_user_data' mangled-name='hb_buffer_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_user_data'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1'/>
      <parameter type-id='type-id-31' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='794' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='hb_buffer_set_content_type' mangled-name='hb_buffer_set_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_content_type'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1'/>
      <parameter type-id='type-id-86' name='content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='811' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_get_content_type' mangled-name='hb_buffer_get_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_content_type'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='hb_buffer_set_unicode_funcs' mangled-name='hb_buffer_set_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_unicode_funcs'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1'/>
      <parameter type-id='type-id-84' name='unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='844' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_get_unicode_funcs' mangled-name='hb_buffer_get_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_unicode_funcs'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='hb_buffer_set_direction' mangled-name='hb_buffer_set_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_direction'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1'/>
      <parameter type-id='type-id-107' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='885' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_get_direction' mangled-name='hb_buffer_get_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_direction'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='hb_buffer_set_script' mangled-name='hb_buffer_set_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_script'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1'/>
      <parameter type-id='type-id-108' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='921' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_get_script' mangled-name='hb_buffer_get_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_script'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='hb_buffer_set_language' mangled-name='hb_buffer_set_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_language'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1'/>
      <parameter type-id='type-id-109' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='956' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_get_language' mangled-name='hb_buffer_get_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_language'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='hb_buffer_set_segment_properties' mangled-name='hb_buffer_set_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_segment_properties'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1'/>
      <parameter type-id='type-id-172' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='991' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_get_segment_properties' mangled-name='hb_buffer_get_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_segment_properties'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1'/>
      <parameter type-id='type-id-176' name='props' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1010' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_set_flags' mangled-name='hb_buffer_set_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_flags'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1'/>
      <parameter type-id='type-id-85' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1027' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_get_flags' mangled-name='hb_buffer_get_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_flags'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='hb_buffer_set_replacement_codepoint' mangled-name='hb_buffer_set_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_replacement_codepoint'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1'/>
      <parameter type-id='type-id-64' name='replacement' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1063' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_get_replacement_codepoint' mangled-name='hb_buffer_get_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_replacement_codepoint'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='hb_buffer_reset' mangled-name='hb_buffer_reset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reset'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_clear_contents' mangled-name='hb_buffer_clear_contents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_clear_contents'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_pre_allocate' mangled-name='hb_buffer_pre_allocate' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_pre_allocate'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <parameter type-id='type-id-12' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_buffer_allocation_successful' mangled-name='hb_buffer_allocation_successful' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_allocation_successful'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_buffer_add' mangled-name='hb_buffer_add' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1'/>
      <parameter type-id='type-id-64' name='codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1161' column='1'/>
      <parameter type-id='type-id-12' name='cluster' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1162' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_set_length' mangled-name='hb_buffer_set_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_length'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <parameter type-id='type-id-12' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_buffer_get_length' mangled-name='hb_buffer_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_length'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='hb_buffer_get_glyph_infos' mangled-name='hb_buffer_get_glyph_infos' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_infos'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1'/>
      <parameter type-id='type-id-60' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1238' column='1'/>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-decl name='hb_buffer_get_glyph_positions' mangled-name='hb_buffer_get_glyph_positions' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_positions'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1'/>
      <parameter type-id='type-id-60' name='length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1260' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='hb_buffer_reverse' mangled-name='hb_buffer_reverse' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_reverse_clusters' mangled-name='hb_buffer_reverse_clusters' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse_clusters'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_guess_segment_properties' mangled-name='hb_buffer_guess_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_guess_segment_properties'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf8' mangled-name='hb_buffer_add_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf8'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1'/>
      <parameter type-id='type-id-49' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1414' column='1'/>
      <parameter type-id='type-id-9' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1415' column='1'/>
      <parameter type-id='type-id-12' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1416' column='1'/>
      <parameter type-id='type-id-9' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1417' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf16' mangled-name='hb_buffer_add_utf16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf16'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1'/>
      <parameter type-id='type-id-170' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1436' column='1'/>
      <parameter type-id='type-id-9' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1437' column='1'/>
      <parameter type-id='type-id-12' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1438' column='1'/>
      <parameter type-id='type-id-9' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1439' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_add_utf32' mangled-name='hb_buffer_add_utf32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf32'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1'/>
      <parameter type-id='type-id-166' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1458' column='1'/>
      <parameter type-id='type-id-9' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1459' column='1'/>
      <parameter type-id='type-id-12' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1460' column='1'/>
      <parameter type-id='type-id-9' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1461' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_add_codepoints' mangled-name='hb_buffer_add_codepoints' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_codepoints'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1'/>
      <parameter type-id='type-id-95' name='text' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1480' column='1'/>
      <parameter type-id='type-id-9' name='text_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1481' column='1'/>
      <parameter type-id='type-id-12' name='item_offset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1482' column='1'/>
      <parameter type-id='type-id-9' name='item_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1483' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_buffer_normalize_glyphs' mangled-name='hb_buffer_normalize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_normalize_glyphs'>
      <parameter type-id='type-id-91' name='buffer' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8' id='type-id-177'>
      <subrange length='1' type-id='type-id-4' id='type-id-178'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='8' id='type-id-164'>
      <subrange length='1' type-id='type-id-4' id='type-id-178'/>
    </array-type-def>
    <class-decl name='hb_language_item_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='212' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-180' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lang' type-id='type-id-109' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='215' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='finish' mangled-name='_ZN18hb_language_item_t6finishEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-180' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator==' mangled-name='_ZNK18hb_language_item_teqEPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-181' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator=' mangled-name='_ZN18hb_language_item_taSEPKc' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-180' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-182'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='hb_tag_t' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='91' column='1' id='type-id-183'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-184'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-181'/>
    <reference-type-def kind='lvalue' type-id='type-id-179' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <function-decl name='hb_tag_from_string' mangled-name='hb_tag_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_from_string'>
      <parameter type-id='type-id-49' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <return type-id='type-id-183'/>
    </function-decl>
    <function-decl name='hb_tag_to_string' mangled-name='hb_tag_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_to_string'>
      <parameter type-id='type-id-183' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <parameter type-id='type-id-47' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_direction_from_string' mangled-name='hb_direction_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_from_string'>
      <parameter type-id='type-id-49' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='hb_direction_to_string' mangled-name='hb_direction_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_to_string'>
      <parameter type-id='type-id-107' name='direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='hb_language_from_string' mangled-name='hb_language_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_from_string'>
      <parameter type-id='type-id-49' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='hb_language_to_string' mangled-name='hb_language_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_to_string'>
      <parameter type-id='type-id-109' name='language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='hb_language_get_default' mangled-name='hb_language_get_default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_get_default'>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='hb_script_from_iso15924_tag' mangled-name='hb_script_from_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_iso15924_tag'>
      <parameter type-id='type-id-183' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='hb_script_from_string' mangled-name='hb_script_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_string'>
      <parameter type-id='type-id-49' name='s' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='hb_script_to_iso15924_tag' mangled-name='hb_script_to_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_to_iso15924_tag'>
      <parameter type-id='type-id-108' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1'/>
      <return type-id='type-id-183'/>
    </function-decl>
    <function-decl name='hb_script_get_horizontal_direction' mangled-name='hb_script_get_horizontal_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_get_horizontal_direction'>
      <parameter type-id='type-id-108' name='script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='hb_version' mangled-name='hb_version' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version'>
      <parameter type-id='type-id-60' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1'/>
      <parameter type-id='type-id-60' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='548' column='1'/>
      <parameter type-id='type-id-60' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='549' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_version_string' mangled-name='hb_version_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_string'>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='hb_version_atleast' mangled-name='hb_version_atleast' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_atleast'>
      <parameter type-id='type-id-12' name='major' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1'/>
      <parameter type-id='type-id-12' name='minor' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='585' column='1'/>
      <parameter type-id='type-id-12' name='micro' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='586' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-face.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-185' size-in-bits='32' id='type-id-186'>
      <subrange length='1' type-id='type-id-4' id='type-id-178'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-187' size-in-bits='128' id='type-id-188'>
      <subrange length='1' type-id='type-id-4' id='type-id-178'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='16' id='type-id-189'>
      <subrange length='2' type-id='type-id-4' id='type-id-8'/>
    </array-type-def>
    <type-decl name='variadic parameter type' id='type-id-190'/>
    <class-decl name='hb_face_t' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='43' column='1' id='type-id-191'>
      <member-type access='public'>
        <class-decl name='plan_node_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='59' column='1' id='type-id-192'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='shape_plan' type-id='type-id-193' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='60' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='next' type-id='type-id-194' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='61' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='reference_table_func' type-id='type-id-195' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='user_data' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='index' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='upem' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='num_glyphs' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='shaper_data' type-id='type-id-120' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='shape_plans' type-id='type-id-194' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='62' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='get_num_glyphs' mangled-name='_ZNK9hb_face_t14get_num_glyphsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-196' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='get_upem' mangled-name='_ZNK9hb_face_t8get_upemEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-196' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='reference_table' mangled-name='_ZNK9hb_face_t15reference_tableEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-196' is-artificial='yes'/>
          <parameter type-id='type-id-183'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='load_num_glyphs' mangled-name='_ZNK9hb_face_t15load_num_glyphsEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-196' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='load_upem' mangled-name='_ZNK9hb_face_t9load_upemEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-196' is-artificial='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='hb_face_t' type-id='type-id-191' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='44' column='1' id='type-id-197'/>
    <typedef-decl name='hb_reference_table_func_t' type-id='type-id-198' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='50' column='1' id='type-id-195'/>
    <class-decl name='hb_font_funcs_t' size-in-bits='3072' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='58' column='1' id='type-id-199'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='66' column='1' id='type-id-200'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='glyph' type-id='type-id-201' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='glyph_h_advance' type-id='type-id-202' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='glyph_v_advance' type-id='type-id-203' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='glyph_h_origin' type-id='type-id-204' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='glyph_v_origin' type-id='type-id-205' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='glyph_h_kerning' type-id='type-id-206' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='glyph_v_kerning' type-id='type-id-207' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='glyph_extents' type-id='type-id-208' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='glyph_contour_point' type-id='type-id-209' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='glyph_name' type-id='type-id-210' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <var-decl name='glyph_from_name' type-id='type-id-211' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__1' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='72' column='1' id='type-id-212'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='glyph' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='glyph_h_advance' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='glyph_v_advance' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='glyph_h_origin' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='glyph_v_origin' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='glyph_h_kerning' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='glyph_v_kerning' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='glyph_extents' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='glyph_contour_point' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='glyph_name' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <var-decl name='glyph_from_name' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__2' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='78' column='1' id='type-id-213'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='glyph' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='glyph_h_advance' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='glyph_v_advance' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='glyph_h_origin' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='glyph_v_origin' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='glyph_h_kerning' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <var-decl name='glyph_v_kerning' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <var-decl name='glyph_extents' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <var-decl name='glyph_contour_point' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <var-decl name='glyph_name' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <var-decl name='glyph_from_name' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='immutable' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='get' type-id='type-id-200' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='user_data' type-id='type-id-212' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='destroy' type-id='type-id-213' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='82' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_font_funcs_t' type-id='type-id-199' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='47' column='1' id='type-id-214'/>
    <class-decl name='hb_glyph_extents_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='84' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_bearing' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y_bearing' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_glyph_extents_t' type-id='type-id-215' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='89' column='1' id='type-id-216'/>
    <typedef-decl name='hb_font_get_glyph_func_t' type-id='type-id-217' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='97' column='1' id='type-id-201'/>
    <typedef-decl name='hb_font_get_glyph_advance_func_t' type-id='type-id-218' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='102' column='1' id='type-id-219'/>
    <typedef-decl name='hb_font_get_glyph_h_advance_func_t' type-id='type-id-219' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='103' column='1' id='type-id-202'/>
    <typedef-decl name='hb_font_get_glyph_v_advance_func_t' type-id='type-id-219' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='104' column='1' id='type-id-203'/>
    <typedef-decl name='hb_font_get_glyph_origin_func_t' type-id='type-id-220' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='109' column='1' id='type-id-221'/>
    <typedef-decl name='hb_font_get_glyph_h_origin_func_t' type-id='type-id-221' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='110' column='1' id='type-id-204'/>
    <typedef-decl name='hb_font_get_glyph_v_origin_func_t' type-id='type-id-221' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='111' column='1' id='type-id-205'/>
    <typedef-decl name='hb_font_get_glyph_kerning_func_t' type-id='type-id-222' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='115' column='1' id='type-id-223'/>
    <typedef-decl name='hb_font_get_glyph_h_kerning_func_t' type-id='type-id-223' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='116' column='1' id='type-id-206'/>
    <typedef-decl name='hb_font_get_glyph_v_kerning_func_t' type-id='type-id-223' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='117' column='1' id='type-id-207'/>
    <typedef-decl name='hb_font_get_glyph_extents_func_t' type-id='type-id-224' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='123' column='1' id='type-id-208'/>
    <typedef-decl name='hb_font_get_glyph_contour_point_func_t' type-id='type-id-225' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='127' column='1' id='type-id-209'/>
    <typedef-decl name='hb_font_get_glyph_name_func_t' type-id='type-id-226' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='133' column='1' id='type-id-210'/>
    <typedef-decl name='hb_font_get_glyph_from_name_func_t' type-id='type-id-227' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='137' column='1' id='type-id-211'/>
    <class-decl name='hb_auto_trace_t&lt;0, bool&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='749' column='1' id='type-id-228'>
      <member-function access='public'>
        <function-decl name='hb_auto_trace_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='797' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-229' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-49'/>
          <parameter type-id='type-id-32'/>
          <parameter type-id='type-id-49'/>
          <parameter type-id='type-id-49'/>
          <parameter is-variadic='yes'/>
          <return type-id='type-id-26'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ret' mangled-name='_ZN15hb_auto_trace_tILi0EbE3retEbj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='804' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-229' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='hb_shape_plan_t' size-in-bits='1664' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='36' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='default_shaper_list' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='face_unsafe' type-id='type-id-118' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='props' type-id='type-id-87' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='shaper_func' type-id='type-id-231' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='shaper_name' type-id='type-id-49' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='user_features' type-id='type-id-232' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='num_user_features' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='shaper_data' type-id='type-id-120' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='50' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_shape_plan_t' type-id='type-id-230' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan.h' line='39' column='1' id='type-id-233'/>
    <class-decl name='hb_feature_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='43' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tag' type-id='type-id-183' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='value' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='end' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hb_feature_t' type-id='type-id-234' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='48' column='1' id='type-id-235'/>
    <typedef-decl name='hb_shape_func_t' type-id='type-id-236' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='36' column='1' id='type-id-237'/>
    <class-decl name='hb_shaper_data_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='53' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ot' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fallback' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-245'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <reference-type-def kind='lvalue' type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-264'/>
    <reference-type-def kind='lvalue' type-id='type-id-185' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-268'/>
    <reference-type-def kind='lvalue' type-id='type-id-269' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-272'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-286'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-287'/>
    <qualified-type-def type-id='type-id-240' const='yes' id='type-id-288'/>
    <reference-type-def kind='lvalue' type-id='type-id-288' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-290'/>
    <qualified-type-def type-id='type-id-242' const='yes' id='type-id-291'/>
    <reference-type-def kind='lvalue' type-id='type-id-291' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-293'/>
    <qualified-type-def type-id='type-id-244' const='yes' id='type-id-294'/>
    <reference-type-def kind='lvalue' type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-296'/>
    <qualified-type-def type-id='type-id-246' const='yes' id='type-id-297'/>
    <reference-type-def kind='lvalue' type-id='type-id-297' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-299'/>
    <qualified-type-def type-id='type-id-248' const='yes' id='type-id-300'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-302'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <qualified-type-def type-id='type-id-252' const='yes' id='type-id-304'/>
    <reference-type-def kind='lvalue' type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-306'/>
    <qualified-type-def type-id='type-id-254' const='yes' id='type-id-307'/>
    <reference-type-def kind='lvalue' type-id='type-id-307' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-309'/>
    <qualified-type-def type-id='type-id-256' const='yes' id='type-id-310'/>
    <reference-type-def kind='lvalue' type-id='type-id-310' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-312'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-315'/>
    <qualified-type-def type-id='type-id-260' const='yes' id='type-id-316'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
    <qualified-type-def type-id='type-id-318' const='yes' id='type-id-319'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <qualified-type-def type-id='type-id-262' const='yes' id='type-id-321'/>
    <reference-type-def kind='lvalue' type-id='type-id-321' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-323'/>
    <qualified-type-def type-id='type-id-185' const='yes' id='type-id-324'/>
    <reference-type-def kind='lvalue' type-id='type-id-324' size-in-bits='64' id='type-id-325'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-326'/>
    <qualified-type-def type-id='type-id-327' const='yes' id='type-id-328'/>
    <reference-type-def kind='lvalue' type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
    <qualified-type-def type-id='type-id-267' const='yes' id='type-id-330'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-331'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-332'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <qualified-type-def type-id='type-id-273' const='yes' id='type-id-334'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-335'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-336'/>
    <reference-type-def kind='lvalue' type-id='type-id-336' size-in-bits='64' id='type-id-337'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-338'/>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-339'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-340'/>
    <qualified-type-def type-id='type-id-341' const='yes' id='type-id-342'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-343'/>
    <qualified-type-def type-id='type-id-278' const='yes' id='type-id-344'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-345'/>
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-346'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-347'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-348'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-350'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-196'/>
    <qualified-type-def type-id='type-id-235' const='yes' id='type-id-351'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-352'/>
    <qualified-type-def type-id='type-id-199' const='yes' id='type-id-353'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-354'/>
    <qualified-type-def type-id='type-id-116' const='yes' id='type-id-355'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-356'/>
    <qualified-type-def type-id='type-id-230' const='yes' id='type-id-357'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <qualified-type-def type-id='type-id-183' const='yes' id='type-id-359'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-360'/>
    <reference-type-def kind='lvalue' type-id='type-id-360' size-in-bits='64' id='type-id-361'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-229'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-218'/>
    <function-decl name='hb_face_create_for_tables' mangled-name='hb_face_create_for_tables' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_create_for_tables'>
      <parameter type-id='type-id-195' name='reference_table_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='83' column='1'/>
      <parameter type-id='type-id-32' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='84' column='1'/>
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='85' column='1'/>
      <return type-id='type-id-118'/>
    </function-decl>
    <function-decl name='hb_face_create' mangled-name='hb_face_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_create'>
      <parameter type-id='type-id-59' name='blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='163' column='1'/>
      <parameter type-id='type-id-12' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='164' column='1'/>
      <return type-id='type-id-118'/>
    </function-decl>
    <function-decl name='hb_face_get_empty' mangled-name='hb_face_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_empty'>
      <return type-id='type-id-118'/>
    </function-decl>
    <function-decl name='hb_face_reference' mangled-name='hb_face_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='212' column='1'/>
      <return type-id='type-id-118'/>
    </function-decl>
    <function-decl name='hb_face_destroy' mangled-name='hb_face_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_destroy'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_face_set_user_data' mangled-name='hb_face_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_user_data'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='263' column='1'/>
      <parameter type-id='type-id-31' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='264' column='1'/>
      <parameter type-id='type-id-32' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='265' column='1'/>
      <parameter type-id='type-id-21' name='destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='266' column='1'/>
      <parameter type-id='type-id-17' name='replace' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='267' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_face_get_user_data' mangled-name='hb_face_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_user_data'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='284' column='1'/>
      <parameter type-id='type-id-31' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='285' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='hb_face_make_immutable' mangled-name='hb_face_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_make_immutable'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_face_is_immutable' mangled-name='hb_face_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_is_immutable'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='318' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='hb_face_reference_table' mangled-name='hb_face_reference_table' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference_table'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='336' column='1'/>
      <parameter type-id='type-id-183' name='tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='337' column='1'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='hb_face_reference_blob' mangled-name='hb_face_reference_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference_blob'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='353' column='1'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='hb_face_set_index' mangled-name='hb_face_set_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_index'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <parameter type-id='type-id-12' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_face_get_index' mangled-name='hb_face_get_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_index'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='hb_face_set_upem' mangled-name='hb_face_set_upem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_upem'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <parameter type-id='type-id-12' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_face_get_upem' mangled-name='hb_face_get_upem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_upem'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='hb_face_set_glyph_count' mangled-name='hb_face_set_glyph_count' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_glyph_count'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <parameter type-id='type-id-12' name='index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='hb_face_get_glyph_count' mangled-name='hb_face_get_glyph_count' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_glyph_count'>
      <parameter type-id='type-id-118' name='face' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <namespace-decl name='OT'>
      <class-decl name='TableRecord' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='55' column='1' id='type-id-187'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tag' type-id='type-id-276' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='checkSum' type-id='type-id-248' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='offset' type-id='type-id-341' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='length' type-id='type-id-341' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='65' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='static_size' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='67' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='OffsetTable' size-in-bits='224' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='71' column='1' id='type-id-262'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='sfnt_version' type-id='type-id-276' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='111' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='numTables' type-id='type-id-371' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='112' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='48'>
          <var-decl name='searchRangeZ' type-id='type-id-371' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='113' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='entrySelectorZ' type-id='type-id-371' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='114' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='80'>
          <var-decl name='rangeShiftZ' type-id='type-id-371' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='115' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='96'>
          <var-decl name='tables' type-id='type-id-188' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='116' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='118' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='find_table_index' mangled-name='_ZNK2OT11OffsetTable16find_table_indexEjPj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-323' is-artificial='yes'/>
            <parameter type-id='type-id-183'/>
            <parameter type-id='type-id-60'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='get_table' mangled-name='_ZNK2OT11OffsetTable9get_tableEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-323' is-artificial='yes'/>
            <parameter type-id='type-id-12'/>
            <return type-id='type-id-337'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='get_table_by_tag' mangled-name='_ZNK2OT11OffsetTable16get_table_by_tagEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-323' is-artificial='yes'/>
            <parameter type-id='type-id-183'/>
            <return type-id='type-id-337'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT11OffsetTable8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-264' is-artificial='yes'/>
            <parameter type-id='type-id-279'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='OpenTypeFontFace' type-id='type-id-262' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='119' column='1' id='type-id-327'/>
      <class-decl name='TTCHeaderVersion1' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='127' column='1' id='type-id-273'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='ttcTag' type-id='type-id-276' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='139' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <var-decl name='version' type-id='type-id-250' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='140' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='table' type-id='type-id-238' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='143' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='146' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT17TTCHeaderVersion18sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-274' is-artificial='yes'/>
            <parameter type-id='type-id-279'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='get_face' mangled-name='_ZNK2OT17TTCHeaderVersion18get_faceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-335' is-artificial='yes'/>
            <parameter type-id='type-id-12'/>
            <return type-id='type-id-329'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='TTCHeader' size-in-bits='128' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='150' column='1' id='type-id-271'>
        <member-type access='protected'>
          <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='183' column='1' id='type-id-372'>
            <member-type access='public'>
              <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='184' column='1' id='type-id-373'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <var-decl name='ttcTag' type-id='type-id-276' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='185' column='1'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='32'>
                  <var-decl name='version' type-id='type-id-250' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='186' column='1'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <var-decl name='header' type-id='type-id-373' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='188' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='version1' type-id='type-id-273' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='189' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='u' type-id='type-id-372' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='190' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='sanitize' mangled-name='_ZN2OT9TTCHeader8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-272' is-artificial='yes'/>
            <parameter type-id='type-id-279'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='get_face' mangled-name='_ZNK2OT9TTCHeader8get_faceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-333' is-artificial='yes'/>
            <parameter type-id='type-id-12'/>
            <return type-id='type-id-329'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='OpenTypeFontFile' size-in-bits='224' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='199' column='1' id='type-id-267'>
        <member-type access='protected'>
          <union-decl name='__anonymous_union__' size-in-bits='224' is-anonymous='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='250' column='1' id='type-id-374'>
            <data-member access='public'>
              <var-decl name='tag' type-id='type-id-276' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='251' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='fontFace' type-id='type-id-327' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='252' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='ttcHeader' type-id='type-id-271' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='253' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='tableTag' type-id='type-id-359' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='200' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='CFFTag' type-id='type-id-359' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='202' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TrueTypeTag' type-id='type-id-359' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='203' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TTCTag' type-id='type-id-359' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='204' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='TrueTag' type-id='type-id-359' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='205' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='Typ1Tag' type-id='type-id-359' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='206' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='u' type-id='type-id-374' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='254' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='min_size' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='256' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='get_face' mangled-name='_ZNK2OT16OpenTypeFontFile8get_faceEj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-331' is-artificial='yes'/>
            <parameter type-id='type-id-12'/>
            <return type-id='type-id-329'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sanitize' mangled-name='_ZN2OT16OpenTypeFontFile8sanitizeEPNS_21hb_sanitize_context_tE' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-268' is-artificial='yes'/>
            <parameter type-id='type-id-279'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='hb_sanitize_context_t' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='178' column='1' id='type-id-278'>
        <member-type access='public'>
          <typedef-decl name='return_t' type-id='type-id-1' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='181' column='1' id='type-id-375'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='max_debug_depth' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='180' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='debug_depth' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='280' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='start' type-id='type-id-49' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='end' type-id='type-id-49' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='writable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='282' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='edit_count' type-id='type-id-12' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='283' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='blob' type-id='type-id-59' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='284' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-266'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::maxp&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-349'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::head&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-347'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::IntType&lt;unsigned int, 4u&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-315'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTable&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-323'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::FixedVersion&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-303'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-287'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-326'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='may_edit' mangled-name='_ZN2OT21hb_sanitize_context_t8may_editEPKvj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-32'/>
            <parameter type-id='type-id-12'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_range' mangled-name='_ZNK2OT21hb_sanitize_context_t11check_rangeEPKvj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-32'/>
            <parameter type-id='type-id-12'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='get_name' mangled-name='_ZN2OT21hb_sanitize_context_t8get_nameEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <return type-id='type-id-49'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='init' mangled-name='_ZN2OT21hb_sanitize_context_t4initEP9hb_blob_t' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-59'/>
            <return type-id='type-id-26'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='start_processing' mangled-name='_ZN2OT21hb_sanitize_context_t16start_processingEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <return type-id='type-id-26'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='end_processing' mangled-name='_ZN2OT21hb_sanitize_context_t14end_processingEv' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <return type-id='type-id-26'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_array' mangled-name='_ZNK2OT21hb_sanitize_context_t11check_arrayEPKvjj' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-32'/>
            <parameter type-id='type-id-12'/>
            <parameter type-id='type-id-12'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::SortedArrayOf&lt;OT::UnicodeValueRange, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-376'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::SortedArrayOf&lt;OT::UVSMapping, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-377'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::CmapSubtable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-378'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::EncodingRecord, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-379'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::IntType&lt;short unsigned int, 2u&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-312'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableFormat0&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-380'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableFormat4&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-381'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::USHORT, uint16_t&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-382'/>
            <parameter type-id='type-id-383'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-384'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableTrimmed&lt;OT::IntType&lt;short unsigned int, 2u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-385'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::IntType&lt;short unsigned int, 2u&gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-386'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableTrimmed&lt;OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-387'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::CmapSubtableLongGroup, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-388'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableLongSegmented&lt;OT::CmapSubtableFormat12&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-389'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableLongSegmented&lt;OT::CmapSubtableFormat13&gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-390'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::VariationSelectorRecord, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-391'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::UnicodeValueRange, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-392'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::SortedArrayOf&lt;OT::UnicodeValueRange, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-393'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::ArrayOf&lt;OT::UVSMapping, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-394'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::SortedArrayOf&lt;OT::UVSMapping, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-395'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::VariationSelectorRecord&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-396'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::CmapSubtableFormat14&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-397'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::OffsetTo&lt;OT::CmapSubtable, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-398'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::EncodingRecord&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-399'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::cmap&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-400'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='check_struct&lt;OT::_hea&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-345' is-artificial='yes'/>
            <parameter type-id='type-id-401'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::LangSys, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-402'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::FeatureParams, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-403'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Coverage, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-404'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Device, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-405'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::ClassDef, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-406'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::AttachList, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-407'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::LigCaretList, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-408'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::MarkGlyphSets, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-409'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::RecordListOf&lt;OT::Script&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-410'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::RecordListOf&lt;OT::Feature&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-411'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::Lookup&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-412'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::SubstLookup&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-413'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::Anchor, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-414'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::MarkArray, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-415'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::AnchorMatrix, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-416'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='try_set&lt;OT::OffsetTo&lt;OT::OffsetListOf&lt;OT::AnchorMatrix&gt;, OT::IntType&lt;short unsigned int, 2u&gt; &gt;, int&gt;' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-279' is-artificial='yes'/>
            <parameter type-id='type-id-417'/>
            <parameter type-id='type-id-361'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
